Repository: hekimoghlu/OpenSystem
Catalog: src/*/gnome-browser-extension/po/*.po
Languages: bg

source: Close
bg: Затваряне

source: Wrong connector response received
bg: Получен е грешен отговор от програмата за свързване

source: Enabled
bg: Включено

source: Installed
bg: Инсталирано

source: Extension
bg: Разширение

source: must be downgraded
bg: трябва да бъде понижено

source: can be upgraded
bg: може да бъде надградено

source: Synchronized
bg: Синхронизирано

source: GNOME Shell integration
bg: Интеграцията на GNOME обвивката

source: This extension provides integration with GNOME Shell and the corresponding extensions repository https://extensions.gnome.org
bg: Това разширение осигурява интеграция с GNOME обвивката и съответното хранилище за разширения https://extensions.gnome.org

source: «$REQUEST$» native request failed
bg: «$REQUEST$» заявката от обвивката е неуспешна

source: never
bg: никога

source: No
bg: Не

source: Unable to locate GNOME Shell settings or version. Make sure it is installed and running.
bg: Настройките или версията на GNOME обвивката не могат да бъдат намерени. Уверете се, че тя е инсталирана и работи.

source: Although GNOME Shell integration extension is running, native host connector is not detected. Refer <a href='$url$'>documentation</a> for instructions about installing connector.
bg: Въпреки че разширението за интеграция с GNOME обвивката работи, не може да бъде открита програма за свързване с обвивката на хоста. За инструкции за инсталиране на програма за свързване вижте <a href='$url$'>документацията</a>.

source: No host response
bg: Няма отговор от хоста

source: Open GNOME Shell extensions website
bg: Отваряне на уеб страницата за разширения на GNOME

source: Options
bg: Опции

source: Options saved.
bg: Опциите са запазени.

source: Show release notes when browser extension updated
bg: Показване на бележките за изданието, когато разширението за браузъра е обновено

source: Synchronize GNOME Shell extensions list
bg: Синхронизиране на списъка с разширения на GNOME обвивката

source: If enabled, your GNOME Shell extensions list will be synchronized with your Google account.
bg: Когато е включено, списъкът с разширенията на GNOME обвивката ще бъде синхронизиран с вашата Google регистрация.

source: $GS_CHROME$ options
bg: $GS_CHROME$ опции

source: Use light icon (dark theme)
bg: Използване на светли иконки (тъмна тема)

source: Native host connector is not supported for your platform.
bg: Програмата за свързване с обвивката на хоста не се поддържа за вашата платформа.

source: Retry
bg: Повтаряне

source: Save
bg: Запазване

source: Synchronization
bg: Синхронизация

source: Do not enable synchronization.
bg: Не включвайте синхронизацията.

source: Failed to synchronize extensions: $CAUSE$
bg: Разширенията не може да бъдат синхронизирани: $CAUSE$

source: Your remote synchronization storage already contains extensions list.
bg: Вашето хранилище за отдалечена синхронизация вече съдържа списък с разширения.

source: Use local extensions list, overwrite remote.
bg: Използване на локалния списък с разширения и презаписване на отдалечения.

source: Use remote extensions list, overwrite local.
bg: Използване на отдалечения списък с разширения и презаписване на локалния.

source: translation_credits
bg: twlvnn kraftwerk <kraft_werk@tutanota.com> Проектът за превод на GNOME има нужда от подкрепа. Научете повече за нас на <a href="http://gnome.cult.bg">http://gnome.cult.bg</a> Докладвайте за грешки на <a href="http://gnome.cult.bg/bugs">http://gnome.cult.bg/bugs</a>

source: About translation
bg: Относно превода

source: unknown error
bg: неизвестна грешка

source: Your native host connector do not support following APIs: $$1. Probably you should upgrade native host connector or install plugins for missing APIs. Refer <a href='$$2'>documentation</a> for instructions.
bg: Вашата програма за свързване с обвивката на хоста не поддържа следните API функции: $$1. Вероятно трябва да обновите програмата за свързване или да инсталирате приставки за липсващите API функции. За инструкции вижте <a href='$$2'>документацията</a>.

source: Yes
bg: Да

source: You MUST install native connector for this extension to work. For Arch Linux, Debian, Fedora, Gentoo and Ubuntu you can install package named "chrome-gnome-shell". You also can install connector manually. See https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html for install instructions.
bg: За да работи това разширение, ТРЯБВА да инсталирате програма за свързване с обвивката. За Arch Linux, Debian, Fedora, Gentoo и Ubuntu може да инсталирате пакета с името „chrome-gnome-shell“. Може също да инсталирате програмата за свързване ръчно. Вижте https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html за инструкции за инсталиране.
