Repository: hekimoghlu/OpenSystem
Catalog: src/*/decibels/po/*.po
Languages: ar, be, ca, cs, da, de, es, fa, fur, gl, ia, it, ja, ko, nl, ro, rw, sk, sr, ug, uk

source: Audio Player
ar: مشغل الصوتيات
be: Аўдыяпрайгравальнік
ca: Reproductor d'àudio
cs: Zvukový přehrávač
da: Lydafspiller
es: Reproductor de sonido
fa: پخش‌کنندهٔ صدا
fur: Riprodutôr audio
gl: Reprodutor de audio
ia: Reproductor de audio
it: Riproduttore audio
ja: 音声プレイヤー
ko: 오디오 재생기
nl: Audiospeler
ro: Redare audio
sk: Prehrávač zvuku
sr: Програм за музику
ug: ئۈن قويغۇچ
uk: Аудіопрогравач

source: Play audio files
ar: شغِّل الملفَّات الصوتية
be: Прайграванне аўдыяфайлаў
ca: Reprodueix fitxers d'àudio
cs: Přehrávejte zvukové soubory
da: Afspil lydfiler
de: Audiodateien abspielen
es: Reproduzca archivos de sonido
fa: پخش پرونده‌های صوتی
fur: Riprodûs files audio
gl: Reproducir ficheiros de audio
ia: Reproduce files de audio
it: Riproduci file audio
ja: 音声ファイルを再生
ko: 오디오 파일을 재생합니다
nl: Beluister audiobestanden
ro: Redă fișiere audio
rw: Kina amadosiye y'amajwi
sk: Prehráva audio súbory
sr: Пуштајте звучне датотеке
ug: ئۈن ھۆججىتىنى قويىدۇ
uk: Відтворювач аудіо файлів

source: music;player;media;audio;decibels;
ar: الموسيقى;الصوتيات;الوسائط;المشغل;الدسبل;الديسيبل;music;player;media;audio;decibels;
be: music;player;media;audio;decibels;музыка;музычны;музыкальны;плэер;прайгравальнік;аўдыяплэер;аўдыяпрайгравальнік;медыя;аўдыё;аўдыя;дэцыбелы;
ca: música;reproductor;mèdia;àudio;decibels;
cs: hudba;přehrávač;média;audio;zvuk;decibely;
da: musik;afspiller;medie;lyd;decibels;
de: music;player;media;audio;Musik;Abspieler;Medien;Decibels;
es: music;player;media;audio;decibels;música;reproductor;sonido;
fa: music;player:media;audio;decibels;آهنگ;موسیقی;صدا;صوت;آوا;پخش‌کننده;رسانه;دسی‌بل;
fur: musiche;riprodutôr;multimedia;audio;decibels;
gl: música;reprodutor;medios;audio;decibelios;
ia: musica;reproductor;multimedia;audio;decibels;
it: musica;lettore;media;audio;decibels;
ja: music;player;media;audio;decibels;ミュージック;音楽;プレイヤー;メディア;オーディオ;音声;デシベルズ;
ko: music;음악;player;재생기;media;미디어;audio;오디오;음향;decibels;데시벨;
nl: music;player;media;audio;decibels;muziek;speler;
ro: music;player;media;audio;decibels;muzică;
sk: hudba;prehrávač;médiá;zvuk;decibely;
sr: музика;звук;аудио;медија;децибели;пуштач;music;player;media;audio;decibels;
ug: music;player;media;audio;decibels;نەغمە؛قويغۇچ؛ۋاسىتە؛ئاۋاز؛
uk: music;player;media;audio;decibels;музика;аудіо;плеєр;медіа;звук;програвач;трек;музяка;відтворювач;плеєр;децибели;

source: An audio player that just plays audio files. It doesn't require an organized music library and won't overload you with tons of functionality.
ar: مُشغِّل صوتيات يُشغِّل الملفَّات الصوتية فقط، لا يتطلب مكتبة موسيقية مُرتَّبة ولن يثقل كاهلك بالكثير من الإمكانيات.
be: Аўдыяпрайгравальнік , які проста прайграе аўдыяфайлы, не патрабуе ўпарадкаванай бібліятэкі музыкі і не перагружае вас безліччу функцый.
ca: Un reproductor d'àudio que reprodueix fitxers d'àudio. No requereix una biblioteca de música organitzada i no us sobrecarregarà amb massa funcionalitat.
cs: Zvukový přehrávač, který pouze přehrává zvukové soubory. Nevyžaduje uspořádanou hudební knihovnu a nezahltí vás spoustou funkcí.
da: En lydafspiller som bare afspiller lydfiler. Den kræver ingen organiserede musikbiblioteker og vil ikke overbyrde dig med tonsvis af funktionalitet.
de: Ein Audioplayer, der Audiodateien einfach abspielt. Er benötigt keine organisierte Musikbibliothek und wird Sie nicht mit Massen an Funktionen überladen.
es: Un reproductor de sonido que sólo reproduce archivos de sonido. No requiere una biblioteca de música y no le abrumará con cientos de funciones.
fa: پخش کنندهٔ صدایی که فقط پرونده‌های صوتی را پخش می‌کند. این کاره نیازمند کتابخانهٔ آهنگی سازمان یافته نبوده و امکانات بیش از حد ندارد.
fur: Un riprodutôr audio che al riprodûs files audio. Nol à bisugne di une librarie musicâl organizade e no ti sorecjariarà di toneladis di funzionalitâts.
gl: Un reprodutor de sonido que solo reproduce ficheiros de audio. Non require unha biblioteca de música organizada e non estará sobrecargado con toneladas de funcionalidade.
ia: Un reproductor de audio que solmente reproduce files de audio. Iste non require un bibliotheca de musica organisate e non te supercargara con multe functionalitates.
it: Un lettore audio che non fa altro che riprodurre file audio. Non richiede di organizzare una libreria musicale e non ha una valanga di funzionalità extra.
ja: 音声ファイルを再生することに特化した音声プレイヤーです。音楽ライブラリを管理する必要はなく、簡単に使うことができます。
ko: 오디오 파일을 재생하는 오디오 재생기입니다. 여러가지를 모아둔 음악 라이브러리가 필요하지 않아 상당히 많은 기능으로 부담감을 안겨드리지 않습니다.
nl: Een audiospeler die alleen maar audiobestanden afspeelt. Hij heeft geen georganiseerde muziekbibliotheek nodig en belast u niet met talloze functies.
ro: O aplicație care nu face altceva decât să redea fișiere audio. Nu solicită organizarea unei biblioteci muzicale și nu oferă o mulțime de caracteristici.
sk: Prehrávač zvuku, ktorý prehráva len zvukové súbory. Nevyžaduje organizovanú hudobnú knižnicu a nezahlcuje vás množstvom funkcií.
sr: Програм за музику који само пушта датотеке звука. Не захтева сређену библиотеку музике и неће вас претрпати гомилом функционалности.
ug: پەقەت ئاۋاز ھۆججىتىنىلا قويىدىغان ئۈن قويغۇچ. ئۇ تەشكىللەنگەن نەغمە ئامبىرىغا ئېھتىياجلىق ئەمەس ئۇنىڭ ئۈستىگە نۇرغۇن ئىقتىدارلار بىلەن قايمۇقتۇرمايدۇ.
uk: Програвач звукових даних, який просто відтворює звукові файли. Не потребує упорядкованої фонотеки і не перевантажує вас сотнями функціональних можливостей.

source: Audio Player still offers advanced features such as:
ar: ومع ذلك يتيح إمكانيات متقدمة مثل:
be: Аўдыёпрайгравальнік па-ранейшаму прапануе і пашыраныя функцыі:
ca: Audio Player ofereix funcions avançades com ara:
cs: Zvukový přehrávač stále nabízí pokročilé funkce, jako jsou:
da: Lydafspiller tilbyder stadig avancerede funktioner såsom:
de: Audioplayer bietet dennoch Funktionen an, wie z. B.:
es: Aun así, el reproductor de sonido ofrece funciones avanzadas como:
fa: با این حال پخش کنندهٔ صدا دارای چندین ویژگی پیش‌رفته است:
fur: Riprodutôr audio al da distès funzions avanzadis come:
gl: O reprodutor de son aínda ofrece funcións avanzadas como:
ia: Reproductor de audio ancora offere functionalitates avantiate como:
it: Riproduttore audio offre comunque delle funzionalità avanzate come:
ja: さらに "音声プレイヤー" は以下の機能を備えています:
ko: 오디오 재생기는 다음 고급 기능을 제공합니다:
nl: Audiospeler biedt niettemin geavanceerde functies zoals:
ro: Oferă totuși caracteristici avansate, cum ar fi:
sk: Prehrávač zvuku však ponúka aj pokročilé funkcie ako napríklad:
sr: Програм нуди напредне функције као што су:
ug: ئۈن قويغۇچ يەنىلا ئالىي ئىقتىدارلارنى تەمىنلەيدۇ:
uk: Втім, програвач пропонує і додаткові можливості, зокрема:

source: An elegant waveform of the track
ar: شكل موجي جذاب للصوت
be: Паказ хвалевай формы трэка
ca: Una forma d'ona elegant de la pista
cs: Elegantní zvukové vlny stopy
da: En elegant bølgeform af lydsporet
de: Eine elegante Wellenform des Tracks
es: Una elegante forma de onda de la pista
fa: نمایش شکل موج قطعه
fur: Une elegante forme di onde dal toc
gl: Unha elegante forma de onda da pista
ia: Un forma de unda elegante del pista
it: Mostra un'elegante forma d'onda della traccia
ja: 音声の波形を美しく表示
ko: 우아한 트랙 파형 출력
nl: Een elegante golfvorm van het nummer
ro: O formă elegantă în valuri a piesei
sk: Elegantná zvuková vlna skladby
sr: Елегантан таласни облик нумере
ug: نەپىس ئاۋاز دولقۇنىنى كۆرسىتىدۇ
uk: Елегантну звукову хвилю треку

source: Adjustable playback speed
ar: إمكانية تغيير سرعة التشغيل
be: Змяненне хуткасці прайгравання
ca: Velocitat de reproducció ajustable
cs: Nastavitelná rychlost přehrávání
da: Justerbar afspilningshastighed
de: Anpassbare Wiedergabegeschwindigkeit
es: Velocidad de reproducción ajustable
fa: سرعت پخش تنظیم‌پذیر
fur: Velocitât di riproduzion regolabile
gl: Velocidade de reprodución axustábel
ia: Velocitate de reproduction adjustabile
it: Una velocità di riproduzione regolabile
ja: 再生速度を変えられます
ko: 재생 속도 조정
nl: Aanpasbare afspeelsnelheid
ro: Viteză de redare reglabilă
sk: Nastaviteľná rýchlosť prehrávania
sr: Подесива брзина пуштања
ug: تەڭشىگىلى بولىدىغان ياڭرىتىش سۈرئىتى
uk: Регулювання швидкості відтворення

source: Easy seek controls
ar: أزرار تقديم وإرجاع
be: Лёгкае кіраванне пошукам
ca: Controls de cerca fàcil
cs: Snadné ovládání přeskakování
da: Nemme søgekontroller
de: Einfache Suchen-Werkzeuge
es: Controles de desplazamiento sencillos
fa: واپایش‌های جویش آسان
fur: Facii controi di ricercje
gl: Controis fáciles de buscar
ia: Controlos facile de recerca
it: Controlli di ricerca facili
ja: 再生位置を簡単にコントロール
ko: 쉬운 탐색 컨트롤
nl: Eenvoudige spoelknoppen
ro: Comenzi ușoare de căutare
rw: Jya imbere n'inyuma mu buryo bworoheje
sk: Jednoduché ovládanie vyhľadávania
sr: Контроле лаког премотавања
ug: ئاددىي ئورۇن بەلگىلەپ تىزگىنلەش
uk: Просте керування позицією відтворення

source: Playing multiple files at the same time
ar: تشغيل ملفات كثيرة في الوقت نفسه
be: Прайграванне некалькіх файлаў адначасова
ca: Reproducció de diversos fitxers alhora
cs: Přehrávání více souborů najednou
da: Afspiller adskillige filer på samme tid
de: Mehrere Dateien zur gleichen Zeit abspielen
es: Reproducción de varios archivos simultáneamente
fa: پخش کردن همزمان چندین پرونده
fur: Riproduzion multime di files in contemporanie
gl: Reproduce varios ficheiros ao mesmo tempo
ia: Reproduction de multiple files al mesme tempore
it: Riproduzione di più di un file alla volta
ja: 複数のファイルを同時に再生可能
ko: 동시에 여러 파일 재생하기
nl: Meerdere bestanden tegelijk afspelen
ro: Redarea mai multor fișiere în același timp
sk: Prehrávanie viacerých súborov naraz
sr: Пушта више датотека у исто време
ug: كۆپ ھۆججەتنى بىرلا ۋاقىتتا قويالايدۇ
uk: Одночасне відтворення декількох файлів

source: Drop Here to Open
ar: أفلت هنا ليُفتَح
be: Перацягніце сюды, каб адкрыць
ca: Deixa anar aquí per a obrir
cs: Přetažením sem otevřete
da: Træk og slip her for at åbne
de: Hier ablegen zum Öffnen
es: Suelte aquí para abrir
fa: رها کردن در این‌جا برای گشودن
fur: Mole achì par vierzi
gl: Soltar aquí para abrir
ia: Depone hic pro aperir
it: Rilasciare qui per aprire
ja: ここにドロップして開く
ko: 열 파일을 여기에 끌어다 놓으십시오
nl: Versleep om te openen
ro: Așează aici pentru a deschide
sk: Pusti sem na otvorenie
sr: Убаци овде за отварање
ug: سۆرەپ تاشلىسىلا ئاچىدۇ
uk: Скиньте сюди, щоб відкрити

source: Play Audio Files
ar: شغِّل الملفات الصوتية
be: Прайграванне аўдыяфайлаў
ca: Reprodueix fitxers d'àudio
cs: Přehrávejte zvukové soubory
da: Afspil lydfiler
de: Audiodateien abspielen
es: Reproducir archivos de sonido
fa: پخش پرونده‌های صوتی
fur: Riprodûs files audio
gl: Reproducir ficheiros de audio
ia: Reproducer files de audio
it: Riproduzione di file audio
ja: 音声ファイルを再生
ko: 오디오 파일 재생
nl: Speel audiobestanden af
ro: Redă fișiere audio
sk: Prehrávať audio súbory
sr: Пусти датотеке звука
ug: ئۈن ھۆججىتىنى قويىدۇ
uk: Відтворювач аудіо файлів

source: Drag and drop audio files here
ar: اسحب ملفَّات صوتية وأفلتها هنا
be: Перацягніце аўдыяфайлы сюды
ca: Arrossega i deixa anar fitxers d'àudio aquí
cs: Sem přetáhněte zvukové soubory
da: Træk og slip lydfiler her
de: Audiodateien hierhin ziehen und ablegen
es: Arrastre y suelte archivos de sonido aquí
fa: کشیدن و رها کردن پرونده‌های صوتی در این‌جا
fur: Strissine e mole i files audio achì
gl: Arrastre e solte os ficheiros de audio aquí
ia: Trahe e depone files de audio hic
it: Trascinare e rilasciare qui i file audio
ja: 音声ファイルをドラッグ&ドロップしてください
ko: 오디오 파일을 여기에 끌어다 높으십시오
nl: Versleep audiobestanden hiernaartoe
ro: Trage și așează aici fișiere audio
sk: Potiahnite sem audio súbory
sr: Превуците и убаците датотеке звука овде
ug: بۇ جايغا ئاۋاز ھۆججىتى سۆرەپ تاشلىنىدۇ
uk: Перетягніть сюди звукові файли і скиньте їх

source: _Open…
ar: ا_فتح…
be: _Адкрыць…
ca: _Obre…
cs: _Otevřít…
da: _Åbn …
de: Ö_ffnen …
es: A_brir…
fa: _گشودن…
fur: _Vierç…
gl: _Abrir…
ia: _Aperir…
it: _Apri…
ja: 開く…(_O)
ko: 열기(_O)…
nl: _Openen…
ro: _Deschide…
rw: _Gufungura…
sk: _Otvoriť…
sr: _Отвори…
ug: ئاچ(_O)…
uk: _Відкрити…

source: File Cannot Be Played
ar: لا يُمكِن تشغيل الملف
be: Немагчыма прайграць файл
ca: No es pot reproduir el fitxer
cs: Soubor nelze přehrát
da: Filen kunne ikke afspilles
de: Datei kann nicht abgespielt werden
es: No se puede reproducir el archivo
fa: پرونده نمی‌تواند پخش شود
fur: Nol è pussibil riprodusi il file
gl: O ficheiro non se pode reproducir
ia: Le file non pote esser reproducite
it: Impossibile riprodurre il file
ja: このファイルは再生できません
ko: 파일을 재생할 수 없습니다
nl: Dit bestand kan niet afgespeeld worden
ro: Fișierul nu poate fi redat
rw: Iyi Dosiye Ntabwo Yakinwa
sk: Súbor nie je možné prehrať
sr: Датотека не може бити пуштена
ug: ھۆججەتنى قويالمايدۇ
uk: Неможливо програти файл

source: _Try Again…
ar: أعِد المحاولة…
be: _Паспрабуйце зноў…
ca: _Torna-ho a provar…
cs: _Zkusit znovu…
da: _Prøv igen …
de: Erneu_t versuchen …
es: _Intentar de nuevo…
fa: _تلاش دوباره…
fur: _Torne prove…
gl: _Tentar de novo…
ia: _Tentar de novo…
it: Ri_prova…
ja: もう一度試す…(_T)
ko: 다시 시도(_T)…
nl: O_pnieuw proberen…
ro: Î_ncearcă din nou…
rw: Kugerageza _Nanone…
sk: Skúsiť _znova…
sr: _Покушај опет…
ug: قايتا سىنا(_T)…
uk: _Спробувати ще раз…

source: Main Menu
ar: القائمة الرئيسية
be: Галоўнае меню
ca: Menú principal
cs: Hlavní nabídka
da: Hovedmenu
de: Hauptmenü
es: Menú principal
fa: فهرست اصلی
fur: Menù principâl
gl: Menú principal
ia: Menu principal
it: Menù principale
ja: メインメニュー
ko: 주 메뉴
nl: Hoofdmenu
ro: Opțiuni
rw: Ibikubiyemo by'ibanze
sk: Hlavné menu
sr: Главни изборник
ug: ئاساسىي تىزىملىك
uk: Головне меню

source: New Window
ar: نافذة جديدة
be: Новае акно
ca: Finestra nova
cs: Nové okno
da: Nyt vindue
de: Neues Fenster
es: Nueva ventana
fa: پنجرهٔ جدید
fur: Gnûf barcon
gl: Nova xanela
ia: Nove fenestra
it: Nuova finestra
ja: 新しいウィンドウ
ko: 새 창
nl: Nieuw venster
ro: Fereastră nouă
sk: Nové okno
sr: Нови прозор
ug: يېڭى كۆزنەك
uk: Нове вікно

source: Open…
ar: افتح…
be: Адкрыць…
ca: Obre…
cs: Otevřít…
da: Åbn …
de: Öffnen …
es: Abrir…
fa: گشودن…
fur: Vierç…
gl: Abrir…
ia: Aperir…
it: Apri…
ja: 開く…
ko: 열기…
nl: Openen…
ro: Deschide…
rw: Gufungura…
sk: Otvoriť…
sr: Отварам…
ug: ئاچ…
uk: Відкрити…

source: Show in _Files
ar: اعرض في تطبيق ال_ملفات
be: Паказаць праз «_Файлы»
ca: Mostra en el _Fitxers
cs: Zobrazit v _Souborech
da: Vis i _Filer
de: In Date_ien anzeigen
es: _Mostrar en Archivos
fa: نمایش در _پرونده‌ها
fur: Mostre in _Files
gl: Mostrar en _Ficheiros
ia: Monstrar in _files
it: Mostra in _File
ja: "ファイル" で音声の保存場所を開く(_F)
ko: 파일에 표시(_F)
nl: Tonen in _Bestanden
ro: Arată în _Fișiere
sk: Zobraziť v _Súboroch
sr: Прикажи програмом _Датотеке
ug: ھۆججەتتە كۆرسەت(_F)
uk: Показати у _Файлах

source: _Keyboard Shortcuts
ar: ا_ختصارات لوحة المفاتيح
be: _Спалучэнні клавіш
ca: _Dreceres del teclat
cs: _Klávesové zkratky
da: _Tastaturgenveje
de: _Tastenkürzel
es: Atajos del _teclado
fa: _میان‌برهای صفحه‌کلید
fur: Scurtis di _tastiere
gl: Atallos de _teclado
ia: Vias breve de _claviero
it: _Scorciatoie da tastiera
ja: キーボードショートカット(_K)
ko: 키보드 바로 가기 키(_K)
nl: _Sneltoetsen
ro: Scur_tături
rw: _Ihinanzira za mwandikisho
sk: _Klávesové skratky
sr: _Пречице тастатуре
ug: ھەرپتاختا تېزلەتمىسى(_K)
uk: _Клавіатурні скорочення

source: _About Audio Player
ar: معلومات _عن التطبيق
be: _Аб праграме
ca: _Quant al Reproductor d'àudio
cs: O _aplikaci Zvukový přehrávač
da: _Om Lydafspiller
de: _Info zu Audioplayer
es: _Acerca del reproductor de sonido
fa: _دربارهٔ پخش کنندهٔ صدا
fur: _Informazions su Riprodutôr audio
gl: _Sobre o Reprodutor de audio
ia: _A proposito de Reproductor de audio
it: _Informazioni su Riproduttore audio
ja: 音声プレイヤーについて(_A)
ko: 오디오 재생기 정보(_A)
nl: _Over Audiospeler
ro: Despre Redare _audio
sk: _O prehrávači zvuku
sr: О програму з_а музику
ug: ئۈن قويغۇچ ھەققىدە(_A)
uk: Про «Аудіопрогравач»

source: Adjust Playback Speed
ar: غيِّر سرعة التشغيل
be: Змяненне хуткасці прайгравання
ca: _Ajusta la velocitat de reproducció
cs: Nastavitelná rychlost přehrávání
da: Juster afspilningshastigheden
de: Wiedergabegeschwindigkeit anpassen
es: Ajustar la velocidad de reproducción
fa: تنظیم سرعت پخش
fur: Juste la velocitât di riproduzion
gl: Axustar a velocidade de reprodución
ia: Adjustar velocitate de reproduction
it: Regola la velocità di riproduzione
ja: 再生速度の調整
ko: 재생 속도 조절
nl: Afspeelsnelheid aanpassen
ro: Reglează viteza de redare
sk: Nastaviť rýchlosť prehrávania
sr: Подеси брзину пуштања
ug: قويۇش سۈرئىتىنى تەڭشەش
uk: Регулювання швидкості відтворення

source: Skip Back 10s
ar: أرجع 10 ثوانٍ
be: Назад на 10 с
ca: Ves enrere 10 s
cs: Přeskočit zpět 10s
da: Spring 10 sekunder tilbage
de: 10s zurück springen
es: Retroceder 10s
fa: ۱۰ ثانیه پرش به پس
fur: Salte indaûr di 10s
gl: Atrasar 10s
ia: Saltar 10 secundas retro
it: Torna indietro di 10 s
ja: 10秒巻き戻す
ko: 10초 뒤로 건너뛰기
nl: 10 seconden terug
ro: Înapoi cu 10s
sk: Preskočiť dozadu o 10 s
sr: Прескаче назад за 10s
ug: كەينىگە 10s قايت
uk: Перемотати назад на 10 секунд

source: Skip Forward 10s
ar: قدِّم 10 ثوانٍ
be: Наперад на 10 с
ca: Ves endavant 10 s
cs: Přeskočit vpřed 10s
da: Spring 10 sekunder frem
de: 10s vor springen
es: Avanzar 10s
fa: ۱۰ ثانیه پرش به پیش
fur: Salte indevant di 10s
gl: Avanzar 10s
ia: Saltar 10 secundas avante
it: Vai avanti di 10 s
ja: 10秒スキップ
ko: 10초 앞으로 건너뛰기
nl: 10 seconden verder
ro: Înainte cu 10s
sk: Preskočiť dopredu o 10 s
sr: Прескаче напред 10s
ug: ئالدىغا 10s ئاتلا
uk: Перемотати вперед на 10 секунд

# shortcut window
source: General
ar: عامّ
be: Агульныя
cs: Obecné
da: Generelt
de: Allgemein
fa: عمومی
fur: Gjenerâl
gl: Xeral
it: Generali
ja: 全般
ko: 일반
nl: Algemeen
ro: Generale
rw: Rusange
sk: Všeobecné
sr: Опште
ug: ئادەتتىكى
uk: Загальні

# shortcut window
source: Show Shortcuts
ar: أظهِر الاختصارات
be: Паказаць спалучэнні клавіш
ca: Mostra les dreceres
cs: Zobrazit klávesové zkratky
da: Vis genveje
de: Tastenkürzel anzeigen
es: Mostrar atajos
fa: نمایش میان‌برها
fur: Mostre scurtis
gl: Mostrar atallos
ia: Monstrar vias breve
it: Mostra scorciatoie
ja: ショートカットを表示
ko: 바로 가기 표시
nl: Sneltoetsen tonen
ro: Arată scurtăturile
rw: Kwerekana Amahinanzira
sk: Zobraziť skratky
sr: Приказује пречице
ug: تېزلەتمىنى كۆرسەت
uk: Клавіатурні скорочення

# shortcut window
source: New Window
ar: نافذة جديدة
be: Новае акно
ca: Finestra nova
cs: Nové okno
da: Nyt vindue
de: Neues Fenster
es: Nueva ventana
fa: پنجرهٔ جدید
fur: Gnûf barcon
gl: Nova xanela
ia: Nove fenestra
it: Nuova finestra
ja: 新しいウィンドウ
ko: 새 창
nl: Nieuw venster
ro: Fereastră nouă
sk: Nové okno
sr: Нови прозор
ug: يېڭى كۆزنەك
uk: Нове вікно

# shortcut window
source: Quit
ar: أنهِ التطبيق
be: Закрыць
ca: Surt
cs: Ukončit
da: Afslut
de: Beenden
es: Salir
fa: خروج
fur: Jes
gl: Saír
ia: Quitar
it: Esce
ja: 終了する
ko: 끝내기
nl: Afsluiten
ro: Închide
rw: Gusohoka
sk: Ukončiť
sr: Излази
ug: چېكىن
uk: Вийти

# shortcut window
source: Player
ar: المُشغِّل
be: Прайгравальнік
ca: Reproductor
cs: Přehrávač
da: Afspiller
es: Reproductor
fa: پخش‌کننده
fur: Riprodutôr
gl: Reprodutor
ia: Reproductor
it: Riproduttore
ja: プレイヤー
ko: 재생기
nl: Speler
ro: Redare
rw: Mukinnyi
sk: Prehrávač
sr: Програм за музику
ug: قويغۇچ
uk: Програвач

# shortcut window
source: Open File
ar: افتح ملفًّا
be: Адкрыць файл
ca: Obre un fitxer
cs: Otevřít soubor
da: Åbn fil
de: Datei öffnen
es: Abrir archivo
fa: گشودن پرونده
fur: Vierç file
gl: Abrir ficheiro
ia: Aperir file
it: Apre un file
ja: ファイルを開く
ko: 파일 열기
nl: Bestand openen
ro: Deschide un fișier
rw: Gufungura Dosiye
sk: Otvoriť súbor
sr: Отвара датотеку
ug: ھۆججەت ئاچ
uk: Відкрити файл

# shortcut window
source: Pause/Play
ar: شغِّل أو ألبِث
be: Паўза/Прайграванне
ca: Fes una pausa/Reprodueix
cs: Pozastavit/přehrát
da: Afspil/Pause
de: Pausieren/Abspielen
es: Pausar/Reproducir
fa: پخش یا مکث
fur: Pause/Riprodûs
gl: Pausar/Reproducir
ia: Pausar/Reproducer
it: Mette in pausa/Riproduce
ja: 一時停止/再生
ko: 일시정지/재생
nl: Pauzeren/afspelen
ro: Pauză/Redare
sk: Pauza/Prehrať
sr: Застаје/Пушта
ug: ۋاقىتلىق توختا/ياڭرات
uk: Відтворити/зупинити

# shortcut window
source: Go Back 10 Seconds
ar: أرجع 10 ثوانٍ
be: Назад на 10 секунд
ca: Ves enrere 10 segons
cs: Vrátit se o 10 sekund zpět
da: Gå 10 sekunder tilbage
de: 10 Sekunden zurückgehen
es: Retroceder 10 segundos
fa: ۱۰ ثانیه به پس
fur: Torne indaûr di 10 seconts
gl: Atrasar 10 segundos
ia: Retroceder 10 secundas
it: Torna indietro di 10 s
ja: 10秒巻き戻す
ko: 10초 뒤로
nl: Ga 10 seconden terug
ro: Dă înapoi cu 10s
sk: Vrátiť sa o 10 sekúnd späť
sr: Враћа се уназад 10 секунде
ug: كەينىگە 10 سېكۇنت قايت
uk: Перемотати назад на 10 секунд

# shortcut window
source: Go Forward 10 Seconds
ar: قدِّم 10 ثوانٍ
be: Наперад на 10 секунд
ca: Ves endavant 10 segons
cs: Přechod o 10 sekund vpřed
da: Gå 10 sekunder frem
de: 10 Sekunden vorgehen
es: Avanzar 10 segundos
fa: ۱۰ ثانیه به پیش
fur: Va indevant di 10 seconts
gl: Adiantar 10 segundos
ia: Avantiar 10 secundas
it: Va avanti di 10 s
ja: 10秒スキップ
ko: 10초 앞으로
nl: Ga 10 seconden verder
ro: Dă înainte cu 10s
sk: Preskočiť o 10 sekúnd dopredu
sr: Иде напред 10 секунде
ug: ئالدىغا 10 سېكۇنت ئاتلا
uk: Перемотати вперед на 10 секунд

# shortcut window
source: Playback Rate
ar: سرعة التشغيل
be: Хуткасць прайгравання
ca: Velocitat de reproducció
cs: Rychlost přehrávání
da: Afspilningshastighed
de: Wiedergabegeschwindigkeit
es: Velocidad de reproducción
fa: آهنگ پخش
fur: Velocitât di riproduzion
gl: Taxa de reprodución
ia: Taxa de reproduction
it: Velocità di riproduzione
ja: 再生速度
ko: 재생 배속
nl: Afspeelsnelheid
ro: Viteza de redare
sk: Rýchlosť prehrávania
sr: Стопа пуштања
ug: ياڭرىتىش نىسبىتى
uk: Швидкість відтворення

# shortcut window
source: Increase Playback Rate
ar: زِد سرعة التشغيل
be: Павялічыць хуткасць прайгравання
ca: Augmenta la velocitat de reproducció
cs: Zvýšit rychlost přehrávání
da: Forøg afspilningshastigheden
de: Schneller wiedergeben
es: Aumentar velocidad de reproducción
fa: افزایش آهنگ پخش
fur: Aumente velocitât di riproduzion
gl: Aumentar a taxa de reprodución
ia: Augmentar taxa de reproduction
it: Aumenta la velocità di riproduzione
ja: 再生速度を速くする
ko: 재생 배속 증가
nl: Afspeelsnelheid verhogen
ro: Mărește viteza de redare
sk: Zvýšiť rýchlosť prehrávania
sr: Повећава стопу пуштања
ug: ياڭرىتىش نىسبىتىنى ئۆرلەت
uk: Збільшити швидкість відтворення

# shortcut window
source: Decrease Playback Rate
ar: قلِّل سرعة التشغيل
be: Паменшыць хуткасць прайгравання
ca: Disminueix la velocitat de reproducció
cs: Snížit rychlost přehrávání
da: Formindsk afspilningshastigheden
de: Langsamer wiedergeben
es: Disminuir velocidad de reproducción
fa: کاهش آهنگ پخش
fur: Diminuî la velocitât di riproduzion
gl: Diminuír a taxa de reprodución
ia: Reducer taxa de reproduction
it: Riduce la velocità di riproduzione
ja: 再生速度を遅くする
ko: 재생 배속 감소
nl: Afspeelsnelheid verlagen
ro: Micșorează viteza de redare
sk: Znížiť rýchlosť prehrávania
sr: Смањује стопу пуштања
ug: ياڭرىتىش نىسبىتىنى تۆۋەنلەت
uk: Зменшити швидкість відтворення

# shortcut window
source: Reset Playback Rate
be: Звычайная хуткасць прайгравання
ca: Restableix la velocitat de reproducció
cs: Obnovit rychlost přehrávání
da: Nulstil afspilningshastigheden
de: Wiedergabegeschwindigkeit zurücksetzen
es: Reiniciar velocidad de reproducción
fa: بازنشانی آهنگ پخش
fur: Ripristine velocitât di riproduzion
gl: Restablecer a taxa de reprodución
ia: Reinitialisar velocitate de reproduction
it: Reimposta la velocità di riproduzione
ja: 再生速度をリセットする
ko: 재생 배속 초기화
nl: Afspeelsnelheid herstellen
ro: Viteză normală de redare
sk: Obnoviť rýchlosť prehrávania
sr: Враћа стопу пуштања
ug: ياڭرىتىش نىسبىتىنى ئەسلىگە قايتۇر
uk: Відновити типову швидкість відтворення
