Repository: hekimoghlu/OpenSystem
Catalog: src/*/decibels/po/*.po
Languages: ar, be, ca, cs, da, de, es, fa, fur, gl, ia, it, ja, ko, nl, ro, rw, sk, sr, ug, uk

source: translator-credits
ar: آخر من عدَّل الترجمة: علي جلال <engalali9@gmail.com> أحمد النجماوي <iramosu@protonmail.com> عمار <al_janabi7@yahoo.com>
be: Yahor Haurylenka <k1llo2810@gmail.com> 2023
ca: Jordi Mas i Hernàndez <jmas@softcatala.org>
cs: Písek Pískovec <pisekpiskovec@gmail.com> Václav Koterec <kot.va@centrum.cz> Daniel Rusek <mail@asciiwolf.com>
da: Kasper Agentoft Lind Dansk-gruppen Websted http://dansk-gruppen.dk E-mail <dansk@dansk-gruppen.dk>
de: Philipp Kiemle <philipp.kiemle@gmail.com> Gabriel Brand <gabr.brand@gmail.com> Jürgen Benvenuti <gastornis@posteo.org>
es: Julián Villodre <jvillodrede@gmail.com>, 2024-2025 Óscar Fernández Díaz <oscfdezdz@tuta.io>
fa: دانیال بهزادی <dani.behzi@ubuntu.com>
fur: Fabio Tomat <f.t.public@gmail.com>, 2025
gl: Fran Diéguez <frandieguez@gnome.org>, 2025
ia: Emilio Sepúlveda <emism.translations@gmail.com>
it: Albano Battistella Davide Ferracin <davide.ferracin@protonmail.com>
ja: 小山田 純 <oyamadajun@outlook.jp>
ko: 조성호 <shcho@gnome.org>
nl: Heimen Stoffels <vistausss@fastmail.com> Nathan Follens <nfollens@gnome.org> Meer info over GNOME-NL https://nl.gnome.org
ro: Florentina Mușat <florentina [dot] musat [dot] 28 [at] gmail [dot] com>, 2024 Antonio Marin <gnmer.6qxyg@slmail.me>, 2025
rw: Angelo Verlain
sk: Nostragodus <nostragodus@gmail.com>,
sr: Мирослав Николић
ug: تەرجىمان تۆھپىسى Gheyret Kenji <gheyret@gmail.com> ئابدۇقادىر ئابلىز <sahranbay@gmail.com>
uk: volkov <volkovissocool@gmail.com>

source: Unable to access dropped files
ar: يتعذَّر الوصول إلى الملفَّات المُفلَتة
be: Немагчыма атрымаць доступ да выбраных файлаў
ca: No s'ha pogut accedir als fitxers deixats
cs: Nelze přehrát přetažený soubor
da: Kunne ikke få adgang til de slupne filer
de: Zugriff auf abgelegte Dateien fehlgeschlagen
es: No se puede acceder a los archivos eliminados
fa: ناتوان در دسترسی به پرونده‌های رها شده
fur: Impussibil acedi ai files molâts
gl: Non se puido acceder a ficheiros soltados
ia: Non poteva acceder al files deponite
it: Impossibile accedere ai file rilasciati
ja: ドロップされたファイルにアクセスできません
ko: 끌어다 놓은 파일에 접근할 수 없습니다
nl: U hebt geen toegang tot de bestanden
ro: Nu se pot accesa fișierele așezate
rw: Ntibishoboka kwakira amadosiye wateretsemo
sk: Nie je možné získať prístup k potiahnutým súborom
sr: Не могу да приступим убаченим датотекама
ug: سۆرەپ تاشلانغان ھۆججەتنى زىيارەت قىلالمىدى
uk: Неможливо отримати доступ до перетягнутих файлів

source: An unknown error happened
ar: حدث خطأ ما
be: Адбылася невядомая памылка
ca: S'ha produït un error desconegut
cs: Vyskytla se neznámá chyba
da: En ukendt fejl skete
de: Ein unbekannter Fehler ist aufgetreten
es: Ocurrió un error desconocido
fa: خطایی ناشناخته رخ داد
fur: Al è capitât un erôr no cognossût
gl: Produciuse un erro descoñecido
ia: Ocurreva un error incognite
it: Si è verificato un errore sconosciuto
ja: 不明なエラーが起きました
ko: 알 수 없는 오류가 나타났습니다
nl: Er is een onbekende fout opgetreden
ro: A apărut o eroare necunoscută
rw: Habaye ikosa ritazwi
sk: Vyskytla sa neznáma chyba
sr: Догодила се непозната грешка
ug: يوچۇن خاتالىق كۆرۈلدى
uk: Сталася невідома помилка

source: File uses a format that cannot be played. Additional media codecs may be required.
ar: يستعمل الملف صيغة لا يُمكِن تشغيلها، لعل التطبيق يحتاج مُرمِّزات وسائط إضافية.
be: Файл выкарыстоўвае фармат, які немагчыма прайграць. Магчыма патрабуюцца дадатковыя кодэкі мультымедыя.
ca: El fitxer utilitza un format que no es pot reproduir. Es poden requerir còdecs multimèdia addicionals.
cs: Soubor používá formát, který nelze přehrát. Přídavné kodeky mohou být vyžadovány.
da: Filen bruger et format, som ikke kan afspilles. Yderligere codecs er måske påkrævet.
de: Datei ist in einem nicht abspielbaren Format. Zusätzliche Media-Codecs könnten erforderlich sein.
es: El archivo usa un formato que no se puede reproducir. Es posible que se necesiten códecs multimedia adicionales.
fa: پرونده از قالب که قابل پخش نیست استفاده می‌کند. شاید نیازمند رمزینه‌های رسانهٔ اضافی باشد.
fur: Nol è pussibil riprodusi il formât di chel file. Al è pussibil che a coventin altris codecs multimediâi.
gl: O ficheiro usa un formato que non se pode reproducir. Poden ser necesarios códecs de medios adicionais.
ia: Le file usa un formato que non se pote reproducer. Codecs multimedia additional pote esser requirite.
it: Il file utilizza un formato che non può essere riprodotto. Ulteriori codec multimediali potrebbero essere necessari.
ja: 再生できないフォーマットが使用されたファイルです。追加のメディアコーデックが必要です。
ko: 파일에서 재생할 수 없는 형식을 사용합니다. 추가 미디어 코덱이 필요할 수도 있습니다.
nl: Dit bestandsformaat wordt niet ondersteund. Wellicht zijn er aanvullende codecs beschikbaar.
ro: Fișierul utilizează un format care nu poate fi redat. Pot fi necesare codec-uri multimedia suplimentare.
rw: Iyi dosiye ifite imiterere itazwi. Ama "codecs" yandi ashobora kuba akenewe.
sk: Súbor používa formát, ktorý nie je možné prehrať. Možno budú potrebné ďalšie mediálne kodeky.
sr: Датотека користи формат који се не може пустити. Потребни су додатни медијски кодеци.
ug: ھۆججەت ياڭراتقىلى بولمايدىغان پىچىم ئىشلەتكەن. قوشۇمچە ۋاسىتە كودلىغۇچ زۆرۈر بولۇشى مۇمكىن.
uk: Файл використовує формат який неможливо відтворити. Можливо, вам потрібно встановити додаткові медіа-кодеки.

source: An error happened while trying to get information about the file. Please try again.
ar: حدث خطأ في أثناء قراءة معلومات الملف، لذا أعد المحاولة.
be: Адбылася памылка падчас спробы атрымаць інфармацыю пра файл. Паўтарыце спробу.
ca: S'ha produït un error en intentar obtenir informació sobre el fitxer. Torneu-ho a provar.
cs: Vyskytla se chyba při získávání informací o souboru. Zkuste to prosím znovu.
da: Der opstod en fejl under forsøget på at få oplysninger om filen. Prøv venligst igen.
de: Während des Holens von Informationen über die Datei ist ein Fehler aufgetreten. Bitte versuchen Sie es noch einmal.
es: Ocurrió un error al intentar obtener información sobre el archivo. Inténtelo de nuevo.
fa: هنگام تلاش برای گرفتن اطّلاعات دربارهٔ پرونده خطایی رخ داد. لطفاً دوباره تلاش کنید.
fur: Al è capitât un erôr tal cirî di otignî informazions sul file. Torne prove.
gl: Produciuse un erro ao intentar obter información sobre o ficheiro. Ténteo de novo.
ia: Ocurreva un error al tentar de obtener information super le file. Tenta de novo.
it: Si è verificato un errore durante il tentativo di ottenere informazioni sul file. Riprovare.
ja: ファイル情報を取得中にエラーが起きました。もう一度試してください。
ko: 파일 정보 가져오기를 시도하던 중 오류가 나타났습니다. 다시 시도하십시오.
nl: Er is een fout opgetreden tijdens het ophalen van de bestandsinformatie. Probeer het opnieuw.
ro: A apărut o eroare la încercarea de a obține informații despre fișier. Se poate încerca din nou.
rw: Habaye ikosa ritazwi mu kugerageza gutarura amakuru yerekeye dosiye. Ongera ugerageze nanone.
sk: Pri pokuse o získanie informácií o súbore došlo k chybe. Skúste to znova.
sr: Дошло је до грешке приликом покушаја добављања информација о датотеци. Покушајте поново.
ug: ھۆججەت ھەققىدىكى ئۇچۇرغا ئېرىشىشنى سىناۋاتقاندا خاتالىق كۆرۈلدى. قايتا سىناڭ.
uk: Сталася помилка під час спроби отримати інформацію про файл. Спробуйте ще раз.

source: File uses an invalid URI
ar: يستعمل الملف URI لا يقبله التطبيق
be: Файл выкарыстоўвае памылковы URI
ca: El fitxer utilitza un URI no vàlid
cs: Soubor používá neplatný URI
da: Filen bruger en ugyldig URI
de: Datei verwendet eine ungültige Adresse
es: El archivo usa una URI no válida
fa: پرونده از نشانی‌ای نامعتبر استفاده می‌کند
fur: Il file al dopre un URI no valit
gl: O ficheiro usa un URI non válido
ia: Le file usa in URI invalide
it: Il file usa un URI non valido
ja: ファイルのURIが無効です
ko: 파일이 부적절한 URI를 사용합니다
nl: Het bestand heeft een ongeldige URI
ro: Fișierul utilizează un URI incorect
sk: Súbor používa neplatný URI
sr: Датотека користи неисправну путању
ug: ھۆججەت ئىناۋەتسىز URI ئىشلەتكەن
uk: Файл використовує не правильний УІР (URI)

source: Reading the file’s information timed out. Please try again.
ar: انتهت مهلة قراءة معلومات الملف، فأعد المحاولة.
be: Скончыўся час для чытання інфармацыі пра файл. Паўтарыце спробу.
ca: La lectura de la informació del fitxer ha excedit el temps d'espera. Torneu-ho a provar.
cs: Čas pro čtení informací o souboru vypršel. Zkuste to prosím znovu.
da: Læsning af filens information overskred tidsgrænsen. Prøv venligst igen.
de: Das Lesen der Dateiinformationen wurde abgebrochen. Bitte versuchen Sie es erneut.
es: Se agotó el tiempo de lectura de la información del archivo. Inténtelo de nuevo.
fa: مهلت خواندن اطّلاعات پرونده به سر رسید. لطفاً دوباره تلاش کنید.
fur: La leture des informazions dal file e je scjadude. Torne prove.
gl: Superouse o tempo de espera da lectura da información do ficheiro . Ténteo de novo.
ia: Lectura de information del file expirate. Tenta de novo
it: La lettura delle informazioni del file ha impiegato troppo tempo. Riprovare.
ja: ファイル情報の読み取りにタイムアウトしました。もう一度試してください。
ko: 파일 정보 읽기 시간을 초과했습니다. 다시 시도하십시오.
nl: Er is een time-out opgetreden tijdens het ophalen van de bestandsinformatie. Probeer het opnieuw.
ro: Citirea informațiilor fișierului a expirat. Se poate încerca din nou.
sk: Čítanie informácií o súbore vypršalo. Skúste to znova.
sr: Истекло је време за читање информација о датотеци. Покушајте поново.
ug: ھۆججەتنىڭ ئۇچۇرىنى ئوقۇۋاتقاندا ۋاقتى توشتى. قايتا سىناڭ.
uk: Час читання файлу вичерпано. Спробуйте ще раз.

source: Unknown File
ar: ملف مجهول
be: Невядомы файл
ca: Fitxer desconegut
cs: Neznámý soubor
da: Ukendt fil
de: Unbekannte Datei
es: Archivo desconocido
fa: پروندهٔ ناشناخته
fur: File no cognossût
gl: Ficheiro descoñecido
ia: File incognite
it: File sconosciuto
ja: 不明なファイル
ko: 알 수 없는 파일
nl: Onbekend bestandstype
ro: Fișier necunoscut
rw: Dosiye Itazwi
sk: Neznámy súbor
sr: Непозната датотека
ug: يوچۇن ھۆججەت
uk: Невідомий файл

source: The selected file doesn’t contain any audio
ar: لا يحوي الملف المُحدَّد أي صوت
be: Выбраны файл не ўтрымлівае аўдыяданых
ca: El fitxer seleccionat no conté cap àudio
cs: Vybraný soubor neobsahuje žádný zvuk
da: Den valgte fil indeholder ingen lyd
de: Die ausgewählte Datei enthält kein Audio
es: El archivo seleccionado no contiene sonido
fa: پروندهٔ گزیده هیچ صدایی ندارد
fur: Il file selezionât nol conten dâts audio
gl: O ficheiro seleccionado non contén ningún audio
ia: Le file seligite non contine necun audio
it: Il file selezionato non contiene audio
ja: 選択されたファイルは、音声を含んでいません
ko: 선택한 파일에 오디오 정보가 없습니다
nl: Het gekozen bestand bevat geen audio
ro: Fișierul ales nu conține audio
sk: Vybraný súbor neobsahuje žiadny zvuk
sr: Изабрана датотека не садржи никакав звук
ug: تاللانغان ھۆججەت ھېچقانداق ئاۋاز ھۆججىتىنى ئۆز ئىچىگە ئالمىغان
uk: Обраний файл не містить аудіо даних

source: Muted
ar: صامت
be: Гук адключаны
ca: Silenciat
cs: Ztlumeno
da: Lydløs
de: Stumm geschaltet
es: Silenciado
fa: بی‌صدا
fur: Cidinât
gl: Silenciado
ia: Silentiate
it: Muto
ja: ミュート
ko: 음소거
nl: Gedempt
ro: Mut
sk: Stlmené
sr: Утишано
ug: ئۈنسىز
uk: Вимкнути звук

source: Full Volume
ar: شدَّة الصوت القصوى
be: Поўная гучнасць
ca: Màxim volum
cs: Plná hlasitost
da: Fuld lydstyrke
de: Volle Lautstärke
es: Volumen al máximo
fa: نهایت صدا
fur: Plen volum
gl: Volume completo
ia: Volumine plen
it: Volume massimo
ja: 最大音量
ko: 최대 음량
nl: Maximaal volume
ro: Volum maxim
sk: Plná hlasitosť
sr: Пун звук
ug: ئەڭ يۇقىرى ئاۋاز
uk: Повна гучність

# volume percentage
source: %d %%
ar: %Id‏ ٪
fa: %Id ٪

source: Pause
ar: ألبِث
be: Паўза
ca: Fes una pausa
cs: Pozastavit
de: Pausieren
es: Pausar
fa: مکث
gl: Pausar
ia: Pausar
it: Pausa
ja: 一時停止
ko: 일시정지
nl: Pauzeren
ro: Pauză
sk: Pauza
sr: Застани
ug: ۋاقىتلىق توختا
uk: Пауза

source: Play
ar: شغِّل
be: Прайграць
ca: Reprodueix
cs: Přehrát
da: Afspil
de: Abspielen
es: Reproducir
fa: پخش
fur: Riprodûs
gl: Reproducir
ia: Reproducer
it: Riproduci
ja: 再生
ko: 재생
nl: Afspelen
ro: Redă
sk: Prehrať
sr: Пусти
ug: ياڭرات
uk: Відтворити

source: Audio files
ar: الملفَّات الصوتية
be: Аўдыяфайлы
ca: Fitxers d'àudio
cs: Zvukové soubory
da: Lydfiler
de: Audiodateien
es: Archivos de sonido
fa: پرونده‌های صوتی
fur: Files audio
gl: Ficheiros de audio
ia: Files de audio
it: File audio
ja: 音声ファイル
ko: 오디오 파일
nl: Audiobestanden
ro: Fișiere audio
rw: Dosiye z'amajwi
sk: Zvukové súbory
sr: Датотеке звука
ug: ئۈن ھۆججەتلىرى
uk: Аудіо файли

source: Open File
ar: افتح ملفًّا
be: Адкрыць файл
ca: Obre un fitxer
cs: Otevřít soubor
da: Åbn fil
de: Datei öffnen
es: Abrir archivo
fa: گشودن پرونده
fur: Vierç file
gl: Abrir ficheiro
ia: Aperir file
it: Apri file
ja: ファイルを開く
ko: 파일 열기
nl: Bestand openen
ro: Deschide un fișier
rw: Gufungura dosiye
sk: Otvoriť súbor
sr: Отвори датотеку
ug: ھۆججەت ئاچ
uk: Відкрити файл

source: No available audio file found
ar: الملف الصوتي غير موجود
be: Прыдатнага аўдыяфайла не знойдзена
ca: No s'ha trobat cap fitxer d'àudio disponible
cs: Nebyl nalezen žádný dostupný zvukový soubor
da: Ingen tilgængelig lydfil fundet
de: Keine verfügbare Audiodatei gefunden
es: No se encontró ningún archivo de sonido disponible
fa: هیچ پروندهٔ صوتی موجودی پیدا نشد
fur: Nissun file audio disponibil cjatât
gl: Non se atopou un ficheiro de audio dispoñíbel
ia: Necun files de audio disponibile
it: Nessun file audio disponibile trovato
ja: 使用できるファイルがありません
ko: 가용 오디오 파일이 없습니다
nl: Geen beschikbaar audiobestand gevonden
ro: Nu s-a găsit niciun fișier audio disponibil
sk: Nebol nájdený žiadny dostupný zvukový súbor
sr: Нема доступних датотека звука
ug: ئىشلەتكىلى بولىدىغان ئاۋاز ھۆججىتى تېپىلمىدى
uk: Не вдалося знайти доступний аудіо файл

source: Directories Cannot Be Played
ar: لا يُمكِن تشغيل المجلدات
be: Немагчыма прайграць каталогі
ca: No es poden reproduir els directoris
cs: Adresáře nelze přehrát
da: Mapper kan ikke afspilles
de: Ordner können nicht abgespielt werden
es: Las carpetas no se pueden reproducir
fa: شاخه‌ها نمی‌توانند پخش شوند
fur: Nol è pussibil riprodusi cartelis
gl: Non se poden reproducir cartafoles
ia: Le directorios non pote esser reproducite
it: Le directory non possono essere riprodotte
ja: フォルダーは再生できません
ko: 디렉터리를 재생할 수 없습니다
nl: Mappen kunnen niet afgespeeld worden
ro: Dosarele nu pot fi redate
sk: Adresáre nie je možné prehrávať
sr: Фасцикле се не могу пуштати
ug: مۇندەرىجىنى ياڭرىتالمايدۇ
uk: Не можна програвати теки

source: Please select a file.
ar: اختر ملفًّا.
be: Выберыце файл.
ca: Seleccioneu un fitxer.
cs: Vyberte soubor.
da: Vælg venligst en fil.
de: Bitte wählen Sie eine Datei aus.
es: Seleccione un archivo.
fa: لطفاً پرونده‌ای برگزینید.
fur: Selezione un file.
gl: Seleccione un ficheiro.
ia: Selige un file
it: Selezionare un file.
ja: ファイルを1つ選択してください。
ko: 파일을 선택하십시오.
nl: Selecteer een bestand.
ro: Alege un fișier.
sk: Vyberte súbor, prosím.
sr: Изаберите датотеку.
ug: ھۆججەت تاللىنىدۇ.
uk: Оберіть файл.

source: The selected file is not a regular file.
ar: الملف المختار ليس ملفَّا عاديًّا.
be: Выбраны файл не з'яўляецца звычайным файлам.
ca: El fitxer seleccionat no és un fitxer normal.
cs: Vybraný soubor není běžný soubor.
da: Den valgte fil er ikke en almindelig fil.
de: Die ausgewählte Datei ist keine reguläre Datei.
es: El archivo seleccionado no es un archivo admitido.
fa: پروندهٔ گزیده پرونده‌ای عادی نیست.
fur: Il file selezionât nol è un file regolâr.
gl: O ficheiro seleccionado non é un ficheiro regular.
ia: Le file seligite non es un file regular
it: Il file selezionato non è un file regolare.
ja: 選択されたファイルは、通常のファイル(regular file)ではありません。
ko: 선택한 파일은 일반 파일이 아닙니다.
nl: Het gekozen bestand is geen normaal bestand.
ro: Fișierul ales nu este un fișier obișnuit.
sk: Vybraný súbor nie je bežný súbor.
sr: Изабрана датотека није обична датотека.
ug: تاللانغان ھۆججەت ئادەتتىكى ھۆججەت ئەمەس.
uk: Обраний файл не є звичайним файлом.

source: No file was selected
ar: لم يُختَر أي ملف
be: Файл не выбраны
ca: No s'ha seleccionat cap fitxer
cs: Nebyl vybrán žádný soubor
da: Der blev ikke valgt nogen fil
de: Keine Datei wurde ausgewählt
es: No se seleccionó ningún archivo
fa: هیچ پرونده‌ای گزیده نشده
fur: Nol è stât selezionât nissun file
gl: Non se seleccionou ningún ficheiro
ia: Necun file ha essite seligite
it: Non è stato selezionato alcun file
ja: ファイルが選択されていません
ko: 파일을 선택하지 않았습니다
nl: Geen bestand geselecteerd
ro: Nu a fost ales niciun fișier
sk: Nebol vybraný žiadny súbor
sr: Није изабрана ни једна датотека
ug: ھېچقانداق ھۆججەت تاللانمىغان
uk: Не було обрано жодного файлу

source: Decibels
rw: Amajwi

source: music;player;media;audio;
rw: muzika;umuziki;kina;media;audio;

source: Current features:
rw: Ubushobozi:

source: Shows the waveform of the track
rw: Kwerekana isanisha ry'indirimbo

source: Adjust playback speed
rw: Hindura umuvuduko w'amajwi

source: Drop an audio file to play it
rw: Terekamo dosiye y'amajwi kugirango uyikine

source: Open an Audio File
rw: Gufungura Amajwi

source: _About Decibels
rw: Ibyerekeye _Amajwi

source: The selected file doesn't contain any audio
rw: Dosiye wahisemo nta majwi ifite

source: The file could not be accessed
rw: Dosiye ntabwo yabashije gutarurwa
