Repository: hekimoghlu/OpenSystem
Catalog: src/*/gnome-tour/po/*.po
Languages: ug

source: Tour
ug: ساياھەت

source: Greeter & Tour
ug: سالام ۋە ساياھەت

source: GNOME Tour and Greeter
ug: GNOME سالام ۋە ساياھەت

source: A guided tour and greeter for GNOME.
ug: GNOME نىڭ سالام ۋە ساياھەت يېتەكچىسى.

source: The GNOME Project
ug: GNOME قۇرۇلۇشى

source: Previous
ug: ئالدىنقى

source: Next
ug: كېيىنكى

source: Start
ug: باشلا

source: Let's Begin
ug: باشلايلى

source: Get an Overview
ug: ئىخچام كۆرۈنۈشكە ئېرىشىش

source: The overview shows all your apps and windows. Press the Super (Windows) key to open it.
ug: ئىخچام كۆرۈنۈش بارلىق پىروگرامما ۋە كۆزنەكنى كۆرسىتىدۇ. Super (Windows) بېسىلسا ئۇنى ئاچىدۇ.

source: Powerful Search
ug: كۈچلۈك ئىزدەش ئىقتىدارى

source: To search, just start typing in the overview. You can use search to launch apps, find files, perform calculations, and more.
ug: ئىزدەشتە، ئىخچام كۆرۈنۈشتە بىۋاسىتە خەت بېسىلسىلا بولىدۇ. ئىزدەشنى ئىشلىتىپ پىروگرامما قوزغىتىش، ھۆججەت ئىزدەش، ھېسابلاش ئېلىپ بېرىش قاتارلىقلارنى قىلغىلى بولىدۇ.

source: Stay Organized With Workspaces
ug: خىزمەت بوشلۇقى رەتلىك تۇرىدۇ

source: Organize your windows by moving them into different workspaces. This can be done by dragging them in the overview.
ug: كۆزنەكنى پەرقلىق خىزمەت بوشلۇقىغا يۆتكەش ئارقىلىق تەشكىللەيدۇ. بۇ مەشغۇلاتنى ئىخچام كۆرۈنۈشتە سۆرەپ تاشلاش ئارقىلىق تاماملىغىلى بولىدۇ.

source: Swipe Up and Down
ug: ئۈستى ۋە ئاستىغا سىيرى

source: To quickly open the overview with a touchpad, swipe up with three fingers.
ug: سەزگۈر تاختىدا تېز سۈرئەتتە ئىخچام كۆرۈنۈشنى ئېچىشتا، ئۈچ بارماقتا ئۈستىگە سىيرىلىدۇ.

source: Swipe Left and Right
ug: ئوڭ ۋە سولغا سىيرى

source: To move between workspaces, swipe three fingers horizontally.
ug: ئوخشىمىغان خىزمەت بوشلۇقى ئارىسىدا يۆتكەشتە، ئۈچ بارماق توغرىسىغا سىيرىلىدۇ.

source: That's It!
ug: مانا مۇشۇنداق!

source: To get more advice and tips, see the Help app.
ug: تېخىمۇ كۆپ تەۋسىيە ۋە ئەسكەرتىشنى ياردەم پىروگراممىسىدىن كۆرۈڭ.

source: Learn about the key features in {name} {version}.
ug: {name} {version} نىڭ مۇھىم ئىقتىدارلىرى ھەققىدىكى مول بىلىم.
