Repository: hekimoghlu/OpenSystem
Catalog: src/*/gnome-directory-thumbnailer/po/*.po
Languages: bg

source: Error generating thumbnail for file ‘%s’.
bg: Грешка при генерирането на миниатюра за файл „%s“.

source: Error generating thumbnail for file ‘%s’: recursion limit reached.
bg: Грешка при генерирането на миниатюра за файл „%s“. Достигнато е ограничението за рекурсия.

source: Error generating thumbnail for file ‘%s’: MIME type ‘%s’ is unsupported.
bg: Грешка при генериране на миниатюра за файл „%s“: MIME вид „%s“ не се поддържа.

source: Directory is empty.
bg: Папката е празна.

source: Maximum size of the thumbnail in pixels (maximum width or height)
bg: Максимален размер на миниатюрата в пиксели (максимална ширина или височина)

source: Show the normal folder icon as an overlay on the thumbnail
bg: Показване на нормалната иконка на папката като наслагване върху миниатюрата

source: [INPUT FILE] [OUTPUT FILE]
bg: [ВХОДЕН ФАЙЛ] [ИЗХОДЕН ФАЙЛ]

source: — Generate thumbnails for directories
bg: — Генериране на миниатюри за папки

source: Couldn’t parse command line options: %s
bg: Опциите на командия ред не могат да бъдат разчетени: %s

source: Couldn’t generate thumbnail for directory ‘%s’: %s
bg: Миниатюрата на папката „%s“ не може да бъде генерирана: %s

source: Couldn’t load folder overlay icon: %s
bg: Иконката за наслагване на папката не може да бъде заредена: %s

source: Couldn’t save thumbnail to ‘%s’: %s
bg: Миниатюрата не може да бъде запазена в „%s“: %s
