Repository: hekimoghlu/OpenSystem
Catalog: src/*/libsecret/po/*.po
Languages: kab

source: Received invalid secret from the secret storage
kab: Yettwarmes tuffirt tarameɣtut seg uḥraz uffir

source: Default keyring
kab: Keyring amezwer

source: Couldn’t communicate with the secret storage
kab: Ur yezmir ara ad yemmeslay akked uḥraz uffir

source: the label for the new stored item
kab: tabzimt i uferdis amaynut i yettwaḥerzen

source: the collection in which to place the stored item
kab: talkensit anida yella uferdis yettwaḥerzen

source: attribute value pairs of item to lookup
kab: iyugan n wazal n umyerr n uferdis iɣef ara yili unadi

source: attribute value pairs which match items to clear
kab: iyugan n wazal n umyerr yemṣadan d yiferdisen ara yettwasefḍen

source: collection in which to lock
kab: talkensit anida ttwasekkṛen

source: return all results, instead of just first one
kab: yerra-d akk igmaḍ, deg wadeg n yiwen kan

source: unlock item results if necessary
kab: kkes asekkeṛ i yigmaḍ n uferdis ma yella ilaq
