Repository: hekimoghlu/OpenSystem
Catalog: src/*/meld/po/*.po
Languages: bg

source: Remove folder and all its files?
bg: Да се изтрие ли папката с всичките ѝ файлове?

source: This will remove all selected files and folders, and all files within any selected folders, from version control.
bg: Действието изтрива всички избрани файлове и папки, рекурсивно, от системата за контрол на версиите.

source: Clear
bg: Изчистване
