Repository: hekimoghlu/OpenSystem
Catalog: src/*/meld/po/*.po
Languages: bg

source: Open Containing Folder
bg: Отваряне на съдържащата папка

source: Copy Full Path
bg: Копиране на целия път

source: This file can not be written to. You may click here to unlock this file and make changes anyway, but these changes must be saved to a new file.
bg: Този файл не може да се променя. Може да натиснете тук, за да позволите променянето му, но промените ще трябва да се запазят в нов файл.

source: Save file in this pane
bg: Запазване на файла в този панел

source: Open file in this pane
bg: Отваряне на файл в този панел

source: File 3
bg: Файл 3

source: File 2
bg: Файл 2

source: File 1
bg: Файл 1

source: Name
bg: Име

source: Pattern
bg: Шаблон

source: Add new filter
bg: Добавяне на нов филтър

source: _Add
bg: _Добавяне

source: Remove selected filter
bg: Премахване на избрания филтър

source: Previous Result
bg: Предишен резултат

source: Next Result
bg: Следващ резултат

source: Find
bg: Търсене

source: Replace
bg: Замяна

source: _Match case
bg: Зачитане на главни/_малки

source: Who_le word
bg: _Цели думи

source: Regular e_xpression
bg: Ре_гулярен израз

source: Wrapped
bg: Пренасяне

source: Replace _All
bg: Замяна на _всички

source: _Replace
bg: _Замяна

source: Switch between Find and Find-and-Replace
bg: Превключване между търсене и търсене със замяна

source: Search highlight mode…
bg: Режим за открояване на търсеното…

source: New comparison
bg: Ново сравнение

source: File
bg: Файл

source: Folder
bg: Папка

source: Version control
bg: Контрол на версиитe

source: _3-way comparison
bg: _Тройно сравняване

source: Select First File
bg: Избор на първия файл

source: Select Second File
bg: Избор на втория файл

source: Select Third File
bg: Избор на третия файл

source: Select First Folder
bg: Избор на първата папка

source: Select Second Folder
bg: Избор на втората папка

source: Select Third Folder
bg: Избор на третата папка

source: Select A Version-Controlled Folder
bg: Избор на папка под контрол на версиите

source: _Blank comparison
bg: _Празно сравняване

source: C_ompare
bg: _Сравняване

source: Close Tab
bg: Затваряне на подпрозореца

source: Format as Patch
bg: Форматиране като кръпка

source: Copy to Clipboard
bg: Копиране в междинния буфер

source: Save Patch
bg: Запазване на кръпка

source: Use differences between:
bg: Да се ползват разликите между:

source: Left and middle panes
bg: Левият и средният подпрозорци

source: Middle and right panes
bg: Средният и десният подпрозорци

source: _Reverse patch direction
bg: _Обръщане на посоката на кръпката

source: Path
bg: Път

source: Copy Path
bg: Копиране на път

source: Copy the full path
bg: Копиране на целия път

source: View the folder in file manager
bg: Разглеждане на папката в мениджъра на файлове

source: Preferences
bg: Настройки

source: Font
bg: Шрифт

source: _Use the system fixed width font
bg: Използване на _системния равноширок шрифт

source: _Editor font:
bg: _Шрифт на редактора:

source: Display
bg: Визуализация

source: _Tab width:
bg: Ширина на _табулация:

source: _Insert spaces instead of tabs
bg: _Шпации вместо табулации

source: Enable text _wrapping
bg: _Пренасяне на текста

source: Do not _split words over two lines
bg: _Думите да не се пренасят

source: Highlight _current line
bg: Открояване на _текущия ред

source: Show _line numbers
bg: Показване на _номерата на редовете

source: Show w_hitespace
bg: Показване на _празните знаци

source: Prefer dark theme
bg: Предпочитане на тъмна тема

source: Use s_yntax highlighting
bg: Използване на _оцветяване на синтаксиса

source: Syntax highlighting color scheme:
bg: Цветова схема за синтаксиса:

source: Code Overview
bg: Обзор на кода

source: Show overview map
bg: Показване на обзорна карта

source: Overview map style:
bg: Стил на картата на обзора:

source: External Editor
bg: Външен редактор

source: Use _default system editor
bg: Използване на стандартния _редактор на GNOME

source: Edito_r command:
bg: _Команда на редактора:

source: Editor
bg: Редактор

source: Shallow Comparison
bg: Плитко сравнение

source: C_ompare files based only on size and timestamp
bg: _Сравняване на файловете само на база размер и времево клеймо

source: _Timestamp resolution:
bg: _Разделителна способност на времевото клеймо:

source: Note: enabling text filters may make comparing large files much slower
bg: ВНИМАНИЕ: включването на филтрите за текст може силно да забави сравняването на файлове

source: Symbolic Links
bg: Символни връзки

source: Visible Columns
bg: Видими колони

source: Folder Comparisons
bg: Сравнение на папки

source: Version Comparisons
bg: Сравняване на версии

source: _Order when comparing file revisions:
bg: _Подредба при сравнение на версии на файлове:

source: Order when _merging files:
bg: Подредба при _сливане на файлове:

source: Commit Messages
bg: Съобщение при подаване

source: Show _right margin at:
bg: Показване на _дясно поле при:

source: Automatically _break lines at right margin on commit
bg: _Автоматично пренасяне на думи при достигане на дясното поле при подаване

source: Version Control
bg: Контрол на версиите

source: Filename filters
bg: Филтри за имената на файловете

source: When performing directory comparisons, you may filter out files and directories by name. Each pattern is a list of shell style wildcards separated by spaces.
bg: При сравняване на папки някои файлове и директории може да се пренебрегват. Всеки ред е списък от шаблони на обвивката, разделени с интервали.

source: Change trimming
bg: Съкращаване на разликите

source: Trim blank line differences from the start and end of changes
bg: Съкращаване на разликите в празните редове в началото и края на промените

source: Text filters
bg: Филтри за текст

source: When performing file comparisons, you may ignore certain types of changes. Each pattern here is a python regular expression which replaces matching text with the empty string before comparison is performed. If the expression contains groups, only the groups are replaced. See the user manual for more details.
bg: При сравняване на файлове някои промени може да се пренебрегват. Всеки шаблон тук е регулярен израз на Python, който заменя всеки напасващ текст с празен низ, преди да се извърши сравняването. Ако изразът съдържа групи, само групите се заменят. Обърнете се към ръководството за повече подробности.

source: Left is remote, right is local
bg: Отляво е отдалечената версия, отдясно е локалната

source: Left is local, right is remote
bg: Отляво е локалната версия, отдясно е отдалечената

source: Simple change map
bg: Опростена карта на промените

source: Compact source map
bg: Компактна карта на промените

source: Full source map
bg: Пълна карта на промените

source: Remote, merge, local
bg: Отдалечено, сливане, локално

source: Local, merge, remote
bg: Локално, сливане, отдалечено

source: Ignore timestamp
bg: Прескачане на времевото клеймо

source: Push local commits to remote?
bg: Да се изтласкат ли локалните промени към отдалеченото хранилище?

source: The commits to be pushed are determined by your version control system.
bg: Подаванията за изтласкване се определят автоматично от системата за контрол на версиите.

source: _Push commits
bg: Из_тласкване на промѐни

source: Search recent comparisons…
bg: Търсене в скорошните сравнения…

source: _Open
bg: _Отваряне

source: Discard unsaved changes to documents?
bg: Незапазените промени да се пренебрегнат ли?

source: Changes made to the following documents will be permanently lost:
bg: Промените по следните файлове ще бъдат загубени:

source: _Discard
bg: _Отмяна

source: Save changes to documents before closing?
bg: Да се запазят ли промените по файловете преди затваряне?

source: If you don’t save, changes will be permanently lost.
bg: Ако не ги запазите, те ще бъдат изгубени.

source: Close _without Saving
bg: Затваряне _без запазване

source: _Save
bg: _Запазване

source: Show whitespace
bg: Показване на празните знаци

source: Text wrapping
bg: Пренасяне на текста

source: _Compare
bg: _Сравняване

source: Co_mmit…
bg: _Подаване…

source: _Unstage
bg: _Изваждане от индекса

source: Re_vert
bg: _Отмяна

source: Delete
bg: Заличаване

source: Resolve Conflict
bg: Разрешаване на конфликт

source: Commit changes to version control
bg: Подаване на промените към контрола на версиите

source: Commit…
bg: Подаване…

source: Pull remote changes to the local repository
bg: Издърпване на отдалечените промени в локалното хранилище

source: Push local changes to remote
bg: Изтласкване на локалните промени към отдалеченото хранилище

source: Add to version control
bg: Добавяне към контрола на версиите

source: Remove staged changes
bg: Заличаване на промените в индекса

source: Remove from version control
bg: Изтриване от контрола на версиите

source: Revert working copy to original state
bg: Връщане на работното копие към първоначалното състояние

source: Mark as resolved in version control
bg: Отбелязване като разрешен спрямо контрола на версиите

source: Open version controlled folder in this pane
bg: Отваряне на папка под контрол на версиите в този панел

source: Location
bg: Местоположение

source: Status
bg: Състояние

source: Extra
bg: Допълнителни

source: Console output
bg: Изход на терминала

source: Copy _up
bg: Копиране на_горе

source: Copy _down
bg: Копиране на_долу

source: Size
bg: Размер

source: Modification time
bg: Време на промяна

source: Modification time (ISO)
bg: Време на промяна (ISO)

source: Permissions
bg: Права̀

source: {filename} (scanning…)
bg: {filename} (обхождане…)

source: [{label}] Scanning {folder}
bg: [{label}] Обхождане на „{folder}“

source: [{label}] Done
bg: [{label}] Готово

source: Folder {} is being compared to itself
bg: Папката „{}“ се сравнява със себе си

source: Folders have no differences
bg: Няма разлики между папките

source: Contents of scanned files in folders are identical.
bg: Съдържанието на проверените файлове е еднакво.

source: Scanned files in folders appear identical, but contents have not been scanned.
bg: Файловете в папките изглеждат еднакви, но самото им съдържание не бе проверено.

source: File filters are in use, so not all files have been scanned.
bg: В момента се ползват филтри по файлове, затова някои файлове се прескачат.

source: Text filters are in use and may be masking content differences.
bg: Използват се филтри за текста. Те може да скриват разлики между текстовете.

source: Hide
bg: Скриване

source: Hi_de
bg: _Скриване

source: Multiple errors occurred while scanning this folder
bg: При обхождането на тази папка възникнаха множество грешки

source: Files with invalid encodings found
bg: Открити са файлове с неправилно кодиране

source: Some files were in an incorrect encoding. The names are something like:
bg: Някои файлове са в друго кодиране. Имената им са:

source: Files hidden by case insensitive comparison
bg: Сравнението без разлика главни/малки крие файлове

source: You are running a case insensitive comparison on a case sensitive filesystem. The following files in this folder are hidden:
bg: Извършвате сравняване без отчитане на регистъра на буквите върху файлова система, която отчита регистъра на буквите. Следните файлове не се виждат: %s

source: Files had mismatched leading or trailing whitespace
bg: Файловете се различават по празни знаци в началото или края на редовете

source: This comparison found some files that differed only in leading or trailing whitespace. Their names appear as:
bg: Сравнението откри някои файлове, които се различават само по празните знаци в началото или края на реда. Имената им са:

source: “{first_file}” hidden by “{second_file}”
bg: „{first_file}“ е скрит от „{second_file}“

source: Replace folder “%s”?
bg: Да се замени ли папката „%s“?

source: Another folder with the same name already exists in “%s”. If you replace the existing folder, all files in it will be lost.
bg: В „%s“ вече съществува папка със същото име. Ако замените съществуващата папка, всички файлове в нея ще бъдат изтрити.

source: Error copying file
bg: Грешка при копиране на файл

source: Couldn’t copy {source} to {dest}. {error}
bg: {source} не може да се копира в {dest}. {error}

source: Error deleting {}
bg: Грешка при изтриване на „{}“

source: No folder
bg: Няма папка

source: Folder comparison:
bg: Сравняване на папки:

source: Failed to launch custom editor
bg: Неуспешно стартиране на външния редактор

source: Unsupported file type
bg: Неподдържан вид файл

source: External opening of files of type {file_type} is not supported
bg: Отварянето на файлове от вид {file_type} във външен редактор не се поддържа.

source: Comparison results will be inaccurate
bg: Резултатите от сравнението ще са неточни

source: A filter changed the number of lines in the file, which is unsupported. The comparison will not be accurate.
bg: Филтърът „%s“ промени броя на редовете във файла, а това не се поддържа. Сравняването няма да бъде коректно.

source: Mark conflict as resolved?
bg: Да се отбележи ли конфликтът като разрешен?

source: If the conflict was resolved successfully, you may mark it as resolved now.
bg: Ако конфликтът е коригиран, може да го отбележите като решен.

source: Cancel
bg: Отмяна

source: Mark _Resolved
bg: Отбелязване като _разрешен

source: Add Synchronization Point
bg: Добавяне на точка за синхронизация

source: Remove Synchronization Point
bg: Премахване на точка за синхронизация

source: Move Synchronization Point
bg: Преместване на точки за синхронизация

source: Match Synchronization Point
bg: Напасване на точките за синхронизация

source: Clear Synchronization Points
bg: Изчистване на точките за синхронизация

source: File comparison:
bg: Сравняване на файлове:

source: Line {line_number} exceeded maximum line length ({line_length} > {LINE_LENGTH_LIMIT})
bg: Ред {line_number} е по-дълъг от максимума ({line_length} > {LINE_LENGTH_LIMIT})

source: There was a problem opening the file “%s”.
bg: Грешка при отварянето на файла „%s“.

source: File %s appears to be a binary file.
bg: „%s“ прилича на двоичен файл.

source: Do you want to open the file using the default application?
bg: Искате ли да отварите файла в стандартната външна програма?

source: Open
bg: Отваряне

source: [%s] Merging files
bg: [%s] Сливане на файлове

source: [%s] Computing differences
bg: [%s] Изчисляване на разликите

source: File %s has changed on disk
bg: Файлът „%s“ бе променен на диска

source: Do you want to reload the file?
bg: Искате ли файлът да се презареди?

source: _Reload
bg: _Презареждане

source: File {} is being compared to itself
bg: Файлът „{}“ се сравнява със себе си

source: Files are identical
bg: Файловете са еднакви

source: Text filters are being used, and may be masking differences between files. Would you like to compare the unfiltered files?
bg: Използват се филтри за текста. Те може да скриват разлики между текстовете. Искате ли да сравните файловете без използване на филтри?

source: Files differ in line endings only
bg: Файловете се различават само по знаците за край на ред

source: Files are identical except for differing line endings: %s
bg: Файловете са еднакви с изключение на знаците за край на ред: %s

source: Show without filters
bg: Показване без филтри

source: Change highlighting incomplete
bg: Открояването на промените не е завършило

source: Some changes were not highlighted because they were too large. You can force Meld to take longer to highlight larger changes, though this may be slow.
bg: Някои промени не са откроени, защото са прекалено големи. Може да накарате Meld да откроява и тях, това може да е бавно.

source: Keep highlighting
bg: Продължаване с оцветяването на синтаксиса

source: _Keep highlighting
bg: Продължаване с _оцветяването на синтаксиса

source: Saving failed
bg: Неуспешно запазване

source: Please consider copying any critical changes to another program or file to avoid data loss.
bg: Копирайте критично важните промени в друга програма или файл, за да избегнете загубата на данни.

source: Save Left Pane As
bg: Запазване на левия панел като

source: Save Middle Pane As
bg: Запазване на средния панел като

source: Save Right Pane As
bg: Запазване на десния панел като

source: File %s has changed on disk since it was opened
bg: Файлът „%s“ е променен на диска след отварянето си.

source: If you save it, any external changes will be lost.
bg: Ако го запазите, външните промени ще се загубят.

source: Save Anyway
bg: Запазване въпреки това

source: Don’t Save
bg: Без запазване

source: File “{}” contains characters that can’t be encoded using its current encoding “{}”.
bg: Файлът „{}“ съдържа знаци извън поддържаните от текущото кодиране „{}“.

source: Couldn’t save file due to: %s
bg: Файлът не може да се запази, защото: %s

source: Could not save file %s.
bg: Файлът „%s“ не може да се запази.

source: Live comparison updating disabled
bg: Обновяванията на сравненията на живо са изключени

source: Live updating of comparisons is disabled when synchronization points are active. You can still manually refresh the comparison, and live updates will resume when synchronization points are cleared.
bg: Незабавното обновяване на сравненията се изключва, когато точките за синхронизация са включени. Може ръчно да обновите сравнението, а незабавните обновявания ще се включат отново след изчистване на точките за синхронизация.

source: Can't swap unsaved files
bg: Незапазени файлове не може да се разменят

source: Files must be saved to disk before swapping panes.
bg: Файловете трябва първо да се запазят на диска преди размяната на панелите.

source: Can't swap version control comparisons
bg: Панелите при сравненията чрез системата за контрол на версии не може да се разменят

source: Swapping panes is not supported in version control mode.
bg: Размяната на панели не се поддържа в режим на контрол на версиите.

source: Deleting remote folders is not supported
bg: Не се поддържа отдалечено изтриване на папки

source: Not a file or directory
bg: Не е файл или папка

source: “{}” can’t be put in the trash. Do you want to delete it immediately?
bg: „{}“ не може да се премести в кошчето. Искате ли незабавно да го изтриете?

source: This remote location does not support sending items to the trash.
bg: Това отдалечено местоположение не поддържа преместване на елементи в кошчето.

source: _Delete Permanently
bg: _Окончателно изтриване

source: Replace file “%s”?
bg: Да се замени ли файлът „%s“?

source: A file with this name already exists in “%s”. If you replace the existing file, its contents will be lost.
bg: Вече има файл с такова име в „%s“. Ако замените съществуващ файл, съществуващото му съдържание се губи.

source: wrong number of arguments supplied to --diff
bg: грешен брой аргументи подадени на опцията „--diff“

source: Start with an empty window
bg: Стартиране с празен прозорец

source: file
bg: файл

source: folder
bg: папка

source: Start a version control comparison
bg: Ново сравнение спрямо системата за версии

source: Start a 2- or 3-way file comparison
bg: Ново сравнение на 2 или 3 файла

source: Start a 2- or 3-way folder comparison
bg: Ново сравнение на 2 или 3 папки

source: For file comparisons, the special argument @blank may be used instead of a <file> argument to create a blank pane.
bg: При сравняване на файлове специалният аргумент „@blank“ може да се ползва вместо име на файл за създаване на празен панел.

source: Error: %s
bg: Грешка: %s

source: Meld is a file and directory comparison tool.
bg: Meld е инструмент за сравняване на файлове и папки.

source: Set label to use instead of file name
bg: Задаване на етикет, който да се ползва вместо име на файл

source: Open a new tab in an already running instance
bg: Отваряне на нов подпрозорец във вече работещ процес

source: Automatically compare all differing files on startup
bg: При стартиране автоматично да се сравняват всички различаващи се файлове

source: Ignored for compatibility
bg: Игнорира се за съвместимост

source: Set the target file for saving a merge result
bg: Задаване къде да се запише резултатът от сливането

source: Automatically merge files
bg: Автоматично сливане на файлове

source: Load a saved comparison from a Meld comparison file
bg: Зареждане на запазено сравнение от файл за това на Meld

source: Create a diff tab for the supplied files or folders
bg: Създаване на подпрозорец за сравнение на подадените файлове или папки

source: too many arguments (wanted 0-3, got %d)
bg: прекалено много аргументи (позволени са 0÷3, а не %d)

source: can’t auto-merge less than 3 files
bg: по-малко от 3 файла не може да се слеят автоматично

source: can’t auto-merge directories
bg: папки не може да се сливат автоматично

source: Error reading saved comparison file
bg: Грешка при изчитане на сравнение, запазено като файл

source: invalid path or URI “%s”
bg: неправилен път или адрес „%s“

source: remote folder “{}” not supported
bg: отдалечената папка „{}“ не се поддържа

source: <unnamed>
bg: <ненаименован>

source: untitled
bg: ненаименован

source: Filename
bg: Име на файл

source: Need three files to auto-merge, got: %r
bg: За автоматично сливане са необходими три файла, а не %r

source: Cannot compare a mixture of files and directories
bg: Невъзможно е да се сравняват файлове с папки

source: Cannot compare a non-existent file
bg: Не може да се сравнява с несъществуващ файл

source: {} Meld encountered a critical error while running: <tt>{}</tt>
bg: {} В Meld възникна критична грешка при изпълнението на: <tt>{}</tt>

source: [None]
bg: [Липсва]

source: label
bg: етикет

source: pattern
bg: шаблон

source: Version control:
bg: Контрол на версиите:

source: Couldn’t find color scheme details for {}; this is a bad install
bg: Данните за цветовата схема {} липсват — инсталацията е повредена

source: Plain Text
bg: Обикновен текст

source: Unnamed file
bg: Ненаименован файл

source: Ln {line}, Col {column}
bg: Ред {line}, Кол. {column}

source: Line you want to move the cursor to
bg: Към кой ред да се придвижи курсора

source: No files will be committed
bg: Никои файлове няма да бъдат подадени

source: {unpushed_commits} in {unpushed_branches}
bg: {unpushed_commits} в {unpushed_branches}

source: %d unpushed commit
bg: %d неизтласкано подаване

source: %d branch
bg: %d клон

source: Mode changed from {old_mode} to {new_mode}
bg: Права̀та са променени от {old_mode} на {new_mode}

source: Partially staged
bg: Частично в индекса

source: Staged
bg: В индекса

source: None
bg: Липсва

source: Rev %s
bg: Версия %s

source: Merged
bg: Слято

source: Base
bg: База

source: Local
bg: Локално

source: Remote
bg: Отдалечено

source: Error
bg: Грешка

source: Newly added
bg: Новодобавено

source: Renamed
bg: Преименувано

source: Conflict
bg: Конфликт

source: Removed
bg: Изтрито

source: Missing
bg: Липсва

source: Not present
bg: Неналично

source: Scanning…
bg: Претърсване…

source: %(name)s (not found)
bg: %(name)s (липсва)

source: %(name)s (%(cmd)s not installed)
bg: %(name)s (%(cmd)s не е инсталирана)

source: %(name)s (invalid repository)
bg: %(name)s (неправилно хранилище)

source: No valid version control system found in this folder
bg: Тази папка не е под позната система за контрол на версиите

source: Choose which version control system to use
bg: Избор на системата за контрол на версиите

source: {vc} comparison:
bg: Сравняване чрез {vc}

source: Scanning repository
bg: Претърсване на хранилището

source: Scanning %s
bg: Претърсване на %s

source: (Empty)
bg: (Празен)

source: %s — local
bg: %s — локално

source: %s — remote
bg: %s — отдалечено

source: %s (local, merge, remote)
bg: %s (локално, слято, отдалечено)

source: %s (remote, merge, local)
bg: %s (отдалечено, слято, локално)

source: %s — repository
bg: %s — хранилище

source: %s (working, repository)
bg: %s (работно дърво, хранилище)

source: %s (repository, working)
bg: %s (хранилище, работно дърво)
