Repository: hekimoghlu/OpenSystem
Catalog: src/*/meld/po/*.po
Languages: bg

source: Diff Viewer
bg: Преглед на разлики

source: Compare and merge your files
bg: Сравняване и сливане на файлове

source: diff;merge;
bg: разлика;разлики;сливане;сравняване;git;mercurial;bazaar;subversion;diff;merge;

source: Meld is a visual diff and merge tool targeted at developers. Meld helps you compare files, directories, and version controlled projects. It provides two- and three-way comparison of both files and directories, and supports many version control systems including Git, Mercurial, Bazaar and Subversion.
bg: Meld е визуален инструмент за сравняване и сливане за разработчици. С Meld може да сравнявате файлове, папки и проекти под контрол на версиите. Програмата поддържа двойно и тройно сравняване и поддържа множество системи за контрол на версиите като: Git, Mercurial, Bazaar и Subversion.

source: Meld helps you review code changes, understand patches, and makes enormous merge conflicts slightly less painful.
bg: Meld ви помага да преглеждате промените по кода, да работите с кръпки и прави корекциите на големи конфликти при сливане поносими.

source: Meld comparison description
bg: Описание на сравнението с Meld

source: Default window width
bg: Стандартна широчина на прозорец

source: Default window height
bg: Стандартна височина на прозорец

source: Default window maximized state
bg: Стандартно състояние за максимизиране

source: Prefer application-wide dark theme
bg: Предпочитане на тъмна тема

source: If true, the GTK dark theme variant will be used, if available. Note that this is separate from the syntax highlighting scheme.
bg: Ако е зададено, ще се ползва тъмната тема на GTK, ако такава е налична. Това е различна настройка от схемата за оцветяване на синтаксиса.

source: Additional automatically detected text encodings
bg: Допълнителни автоматично засичани кодирания на текст

source: Meld will use these text encodings to try to decode loaded text files before trying any other encodings. In addition to the encodings in this list, UTF-8 and the current locale-default encoding will always be used; other encodings may also be tried, depending on the user’s locale.
bg: Meld ползва настройката, за да се опита да зареди файловете със зададените кодирания. Допълнително винаги се пробват UTF-8 и кодирането от локала. На база на локала може да се пробват още кодирания.

source: Width of an indentation step
bg: Широчина на отстъпа

source: The number of spaces to use for a single indent step
bg: Брой интервали за единичен отстъп

source: Whether to indent using spaces or tabs
bg: Дали отстъпът да е в интервали или табулации

source: If true, any new indentation will use spaces instead of tabs.
bg: Ако е зададено, новите отстъпи ще са с интервали.

source: Show line numbers
bg: Показване на номерата на редовете

source: If true, line numbers will be shown in the gutter of file comparisons.
bg: Ако е зададено, номерата на редовете се показват в страничните полета на сравненията на файлове.

source: Highlight syntax
bg: Оцветяване на синтаксиса

source: Whether to highlight syntax in comparisons. Because of Meld’s own color highlighting, this is off by default.
bg: Дали синтаксисът да се оцветява при сравнения. Стандартно това е изключено, защото Meld ползва собствената си схема.

source: Color scheme to use for syntax highlighting
bg: Цветова схема за оцветяване на синтаксиса

source: Used by GtkSourceView to determine colors for syntax highlighting
bg: Ползва се от GtkSourceView за определяне на цветовете за оцветяване на синтаксиса

source: Draw whitespace
bg: Показване на празните знаци

source: If true, whitespace characters will be drawn in comparisons even if they are not in a changed area.
bg: Ако е зададено, знаците за интервали ще се показват, дори и да не са в места с промени.

source: Wrap mode
bg: Пренасяне

source: Lines in file comparisons will be wrapped according to this setting, either not at all ('none'), at any character ('char') or only at the end of words ('word').
bg: Редовете в сравненията на файлове се пренасят съгласно настройката. Възможните стойности са „none“ — без пренасяне, „char“ — при всеки знак или „word“ — след края на дума.

source: Highlight current line
bg: Открояване на текущия ред

source: If true, the line containing the cursor will be highlighted in file comparisons.
bg: Ако е зададено, редът на курсора ще се откроява при файловите сравнения.

source: Use the system default monospace font
bg: Използване на системния шрифт с фиксирана ширина

source: If false, custom-font will be used instead of the system monospace font.
bg: Ако не е зададено, се ползва шрифт избран от потребителя, а не системният.

source: Custom font
bg: Потребителски шрифт

source: The custom font to use, stored as a string and parsed as a Pango font description.
bg: Шрифт избран от потребителя, като низ-описание на Pango.

source: Show overview source map
bg: Показване на картата с обзор на кода

source: If true, file comparisons will have paired source maps for compared files.
bg: Ако е зададено, файловите сравнения са придружени от карта с обзор на кода.

source: Style of overview map
bg: Стил на картата с обзор на кода

source: Style options for how the overview map is displayed.
bg: Настройки на стила за показване на картата с обзор на кода

source: Ignore blank lines when comparing files
bg: Прескачане на празните редове при сравняване на файлове

source: If true, blank lines will be trimmed when highlighting changes between files.
bg: Ако е зададено, празните редове се прескачат при сравняване на файлове за разлики.

source: Use the system default editor
bg: Използване на системния стандартен редактор

source: If false, custom-editor-command will be used instead of the system editor when opening files externally.
bg: Ако не е зададено, се ползва текстовият редактор от настройката „custom-editor-command“ вместо системния.

source: The custom editor launch command
bg: Команда за потребителски текстов редактор

source: The command used to launch a custom editor. Some limited templating is supported here; at the moment '{file}' and '{line}' are recognised tokens.
bg: Команда за стартиране на потребителски текстов редактор. Поддържат се следните две лексеми за шаблони: „{file}“ — името на файл и „{line}“ — ред.

source: Columns to display
bg: Колони за визуализация

source: List of column names in folder comparison and whether they should be displayed.
bg: Списък с имената на колони при сравняване на папки и дали трябва да се показват.

source: Ignore symbolic links
bg: Игнориране на символните връзки

source: If true, folder comparisons do not follow symbolic links when traversing the folder tree.
bg: Ако е зададено, сравненията на папките не проследяват символните връзки при обхождане на дървото с папките.

source: Use shallow comparison
bg: Плитко сравнение

source: If true, folder comparisons compare files based solely on size and mtime, considering files to be identical if their size and mtime match, and different otherwise.
bg: Ако е зададено, сравненията на папки сравняват файловете само на база размер и време на промяна (mtime). Ако тези два индикатора съвпадат, файловете се считат за еднакви независимо съдържанието им.

source: File timestamp resolution
bg: Разделителна способност на времевото клеймо на файла

source: When comparing based on mtime, this is the minimum difference in nanoseconds between two files before they’re considered to have different mtimes. This is useful when comparing files between filesystems with different timestamp resolution.
bg: Каква е минималната разлика в наносекунди при сравненията на клеймата на промяна (mtime), преди приемането, че са различни. Това е особено полезно при сравняване на файлове от файлови системи с различна разделителна способност на времевите клейма.

source: Apply text filters during folder comparisons
bg: Прилагане на филтри върху текста при сравняване на папки

source: If true, folder comparisons that compare file contents also apply active text filters and the blank line trimming option, and ignore newline differences.
bg: Ако е зададено, сравненията на папки, които проверяват и съдържанието на файлове, прилагат филтри, изрязване на празните редове и прескачат разликите за край на ред.

source: File status filters
bg: Филтри за състоянието на файловете

source: List of statuses used to filter visible files in folder comparison.
bg: Списък със състояния за филтриране на видимите файлове при сравнения на папки.

source: Show the version control console output
bg: Извеждане на изхода от сравнението чрез системата за контрол на версиите

source: If true, a console output section will be shown in version control views, showing the commands run for version control operations.
bg: Ако е зададено, ще се показва изходът на терминал при изгледите със сравнения със системи за контрол на версиите, за да се визуализират командите за действията.

source: Version control pane position
bg: Местоположение на панела за контрола на версиите

source: This is the height of the main version control tree when the console pane is shown.
bg: Това е височината на основното дърво за контрол на версиите при визуализация на панела за терминала.

source: Present version comparisons as left-local/right-remote
bg: Сравненията с контрола на версиите да са: отляво е локалната версия, а отдясно — отдалечената

source: If true, version control comparisons will use a left-is-local, right-is-remote scheme to determine what order to present files in panes. Otherwise, a left-is-theirs, right-is-mine scheme is used.
bg: Ако е зададено, при сравнение със системата за контрол на версиите ще ползва следната подредба: отляво е локалната версия, а отдясно — отдалечената. В противен случай отляво е отдалечената, а отдясно — локалната.

source: Order for files in three-way version control merge comparisons
bg: Подредба на файловете при тройно сравнение чрез системата за контрол на версиите

source: Choices for file order are remote/merged/local and local/merged/remote. This preference only affects three-way comparisons launched from the version control view, so is used solely for merges/conflict resolution within Meld.
bg: Възможностите за подредба са отдалечено/слято/локално или локално/слято/отдалечено. Тази настройка се отнася само за тройните сравнения, стартирани от изгледа за контрол на версиите, и се ползва само за сливания/разрешаване на конфликти в Meld.

source: Show margin in commit message editor
bg: Показване на дясно поле в редактора за съобщение при подаване

source: If true, a guide will be displayed to show what column the margin is at in the version control commit message editor.
bg: Ако е зададено, се извежда линия-водач, която показва крайното поле в редактора на съобщения за подаване към системата за контрол на версиите.

source: Margin column in commit message editor
bg: Колона за дясното поле в редактора на съобщения при подаване

source: The column at which to show the margin in the version control commit message editor.
bg: Колона, при която се визуализира дясно поле в редактора на съобщения при подаване към системата за контрол на версиите.

source: Automatically hard-wrap commit messages
bg: Автоматично пренасяне на думите в съобщенията за подаване

source: If true, the version control commit message editor will hard-wrap (i.e., insert line breaks) at the commit margin before commit.
bg: Ако е зададено, думите в съобщенията за подаване автоматично се пренасят на нов ред при достигане на дясното поле за съобщенията за подаване.

source: Version control status filters
bg: Филтри за състоянието за системата за контрол на версиите

source: List of statuses used to filter visible files in version control comparison.
bg: Списък със състояния са филтриране на видимите файлове в сравненията със системата за контрол на версиите.

source: [ ("Backups", true, "#*# .#* ~* *~ *.{orig,bak,swp}"), ("OS-Specific Metadata", true, ".DS_Store ._* .Spotlight-V100 .Trashes Thumbs.db Desktop.ini"), ("Version Control", true, "_MTN .bzr .svn .svn .hg .fslckout _FOSSIL_ .fos CVS _darcs .git .svn .osc"), ("Binaries", true, "*.{pyc,a,obj,o,so,la,lib,dll,exe}"), ("Media", false, "*.{jxl,jpg,jpeg,gif,png,avif,webp,heif,heic,bmp,tif,tiff,raw,dng,cr2,wav,wave,mp3,ogg,oga,vorbis,spx,opus,flac,ac3,aac,aif,aiff,aifc,alac,m4a,3gp,wma,aup,aup3,avi,mov,mpg,mpeg,mp4,m4v,webm,ogv,flv,xcf,xpm,ora,kra,psd,psp}") ]
bg: [ ("Резервни копия", true, "#*# .#* ~* *~ *.{orig,bak,swp}"), ("Метафайлове от ОС", true, ".DS_Store ._* .Spotlight-V100 .Trashes Thumbs.db Desktop.ini"), ("Контрол на версиите", true, "_MTN .bzr .svn .svn .hg .fslckout _FOSSIL_ .fos CVS _darcs .git .svn .osc"), ("Двоични файлове", true, "*.{pyc,a,obj,o,so,la,lib,dll,exe}"), ("Медия", false, "*.{jxl,jpg,jpeg,gif,png,avif,webp,heif,heic,bmp,tif,tiff,raw,dng,cr2,wav,wave,mp3,ogg,oga,vorbis,spx,opus,flac,ac3,aac,aif,aiff,aifc,alac,m4a,3gp,wma,aup,aup3,avi,mov,mpg,mpeg,mp4,m4v,webm,ogv,flv,xcf,xpm,ora,kra,psd,psp}") ]

source: Filename-based filters
bg: Филтри за файлове на база имената им

source: List of predefined filename-based filters that, if active, will remove matching files from a folder comparison.
bg: Списък от филтри на база имената на файлове, които при активиране, ще прескачат напасващите файлове от сравненията на папки.

source: [ ("CVS/SVN Keywords", false, "\\$\\w+(:[^\\n$]+)?\\$"), ("C++ Comment", false, "//.*"), ("C Comment", false, "/\\*.*?\\*/"), ("All Whitespace", false, "[ \\t\\r\\f\\v]*"), ("Leading Whitespace", false, "^[ \\t\\r\\f\\v]*"), ("Trailing Whitespace", false, "[ \\t\\r\\f\\v]*$"), ("Script Comment", false, "#.*") ]
bg: [ ("Ключови думи на CVS/SVN", false, "\\$\\w+(:[^\\n$]+)?\\$"), ("Коментари на C++", false, "//.*"), ("Коментари на C", false, "/\\*.*?\\*/"), ("Всички празни знаци", false, "[ \\t\\r\\f\\v]*"), ("Празни знаци в началото на реда", false, "^[ \\t\\r\\f\\v]*"), ("Празни знаци в края на реда", false, "[ \\t\\r\\f\\v]*$"), ("Коментари в скриптове", false, "#.*") ]

source: Text-based filters
bg: Филтри за текст

source: List of predefined text-based regex filters that, if active, will remove text from being used in a file comparison. The text will still be displayed, but won’t contribute to the comparison itself.
bg: Списък с предварително дефинирани филтри за текст на база регулярни изрази. Когато филтър е включен, той автоматично изрязва текст при сравненията на файлове. Текстът се визуализира, но се прескача при сравненията.

source: Classic (Meld)
bg: Класическа (Meld)

source: Base color scheme for Meld highlighting
bg: Базова цветова схема за оцветяването на Meld

source: Meld dark scheme
bg: Тъмна схема на Meld

source: Dark color scheme for Meld highlighting
bg: Тъмна цветова схема за оцветяването на Meld

# shortcut window
source: Windows and Tabs
bg: Прозорци и подпрозорци

# shortcut window
source: New comparison
bg: Ново сравняване

# shortcut window
source: Close a comparison
bg: Затваряне на сравняването

# shortcut window
source: Quit Meld
bg: Спиране на Meld

# shortcut window
source: General
bg: Общи

# shortcut window
source: Show help
bg: Извеждане на помощта

# shortcut window
source: Show preferences
bg: Извеждане на настройките

# shortcut window
source: Keyboard shortcuts
bg: Клавишни комбинации

# shortcut window
source: Open menu
bg: Отваряне на менюто

# shortcut window
source: Fullscreen
bg: На цял екран

# shortcut window
source: Common Actions
bg: Чести действия

# shortcut window
source: Stop the current action
bg: Спиране на текущото действие

# shortcut window
source: Refresh comparison
bg: Презареждане на сравнението

# shortcut window
source: Open externally
bg: Отваряне с външна програма

# shortcut window
source: Panes
bg: Панели

# shortcut window
source: Previous comparison pane
bg: Предишният панел за сравнение

# shortcut window
source: Next comparison pane
bg: Следващият панел за сравнение

# shortcut window
source: Swap left and right panes
bg: Смяна на левия и десния панели

# shortcut window
source: Changes
bg: Промени

# shortcut window
source: Go to previous change
bg: Към предишната разлика

# shortcut window
source: Go to next change
bg: Към следващата разлика

# shortcut window
source: Tabs
bg: Подпрозорци

# shortcut window
source: Go to previous tab
bg: Към предишния панел

# shortcut window
source: Go to next tab
bg: Към следващия панел

# shortcut window
source: Switch to tab
bg: Към подпрозорец

# shortcut window
source: Move tab left
bg: Преместване на подпрозореца наляво

# shortcut window
source: Move tab right
bg: Преместване на подпрозореца надясно

# shortcut window
source: Editing
bg: Редактиране

# shortcut window
source: Undo
bg: Отмяна

# shortcut window
source: Redo
bg: Повтаряне

# shortcut window
source: Cut
bg: Изрязване

# shortcut window
source: Copy
bg: Копиране

# shortcut window
source: Paste
bg: Поставяне

# shortcut window
source: Find
bg: Търсене

# shortcut window
source: Find Next
bg: Следваща поява

# shortcut window
source: Find Previous
bg: Предишна поява

# shortcut window
source: Replace
bg: Замяна

# shortcut window
source: Go to line
bg: Към ред

# shortcut window
source: File comparison
bg: Сравняване на файлове

# shortcut window
source: Save current file
bg: Запазване на текущия файл

# shortcut window
source: Save current file to new path
bg: Запазване на текущия файл на ново място

# shortcut window
source: Save all files in comparison
bg: Запазване на всички файлове в сравнението

# shortcut window
source: Previous conflict
bg: Предишен конфликт

# shortcut window
source: Next conflict
bg: Следващ конфликт

# shortcut window
source: Push change to left
bg: Прилагане на промяната наляво

# shortcut window
source: Push change to right
bg: Прилагане на промяната надясно

# shortcut window
source: Pull change from left
bg: Издърпване на промяната отляво

# shortcut window
source: Pull change from right
bg: Издърпване на промяната отдясно

# shortcut window
source: Copy change above left
bg: Повтаряне на промяната отгоре вляво

# shortcut window
source: Copy change below left
bg: Повтаряне на промяната отдолу вляво

# shortcut window
source: Copy change above right
bg: Повтаряне на промяната отгоре вдясно

# shortcut window
source: Copy change below right
bg: Повтаряне на промяната отдолу вляво

# shortcut window
source: Delete change
bg: Заличаване на промяната

# shortcut window
source: Show overview map
bg: Показване на картата на обзора

# shortcut window
source: Folder comparison
bg: Сравняване на папки

# shortcut window
source: Copy to left
bg: Копиране наляво

# shortcut window
source: Copy to right
bg: Копиране надясно

# shortcut window
source: Expand the current folder
bg: Отваряне на текущата папка

# shortcut window
source: Collapse the current folder
bg: Затваряне на текущата папка

# shortcut window
source: Version control comparison
bg: Сравнение спрямо системата за версии

# shortcut window
source: Commit to version control
bg: Подаване към системата за контрол на версиите

# shortcut window
source: Show/hide console output
bg: Превключване на изхода на терминала

source: Save As…
bg: Запазване като…

source: Save A_ll
bg: Запазване на _всички

source: Revert Files…
bg: Връщане на файлове към първоначалното им състояние…

source: _Open Externally
bg: _Отваряне с външна програма

source: Refresh Comparison
bg: Обновяване на сравнението

source: _Find…
bg: _Търсене…

source: _Replace…
bg: _Замяна…

source: _View
bg: _Изглед

source: Fullscreen
bg: На цял екран

source: Overview Map
bg: Карта на обзора

source: Version Control Console
bg: Терминал за контрол на версиите

source: Lock Scrolling
bg: Съвместно придвижване

source: Swap Left and Right Panes
bg: Разменяне на левия и десния подпрозорец

source: _Comparison
bg: _Сравняване

source: _Stop
bg: _Край

source: Merge All from _Left
bg: Сливане на всички промени от _ляво

source: Merge All from _Right
bg: Сливане на всички промени от _дясно

source: Merge _All
bg: Сливане на _всичко

source: Format as _Patch…
bg: _Форматиране на кръпка…

source: _Preferences
bg: _Настройки

source: Keyboard Shortcuts
bg: Клавишни комбинации

source: _Help
bg: Помо_щ

source: _About Meld
bg: _Относно Meld

source: File Status
bg: Състояние на файла

source: Same
bg: Еднакви

source: New
bg: Нови

source: Modified
bg: Променени

source: Ignore Filename Case
bg: Без разлика главни/малки в имената на файловете

source: Normalize Unicode Paths
bg: Нормализиране на пътищата в Уникод

source: Normal
bg: Нормални

source: Unversioned
bg: Неконтролирани файлове

source: Ignored
bg: Игнорирани

source: Flatten Folders
bg: Представяне на папките като една

source: Copyright © 2002-2009 Stephen Kennedy Copyright © 2009-2022 Kai Willadsen
bg: Авторски права̀ © 2002-2009 Stephen Kennedy Авторски права̀ © 2009-2022 Kai Willadsen

source: translator-credits
bg: Александър Шопов &lt;<a href='mailto:ash@kambanaria.org'>ash@kambanaria.org</a>&gt; Проектът за превод на GNOME има нужда от подкрепа. Научете повече за нас на <a href='https://fsa-bg.org/project/gtp'>уеб сайта</a> ни. Докладвайте за грешки в превода в <a href='https://fsa-bg.org/project/gtp/newticket'>съответния раздел</a>.

source: Start a new comparison
bg: Ново сравнение

source: Open a recent comparison
bg: Отваряне на скорошно сравнение

source: Go to the previous change
bg: Към предишната разлика

source: Go to the next change
bg: Към следващата разлика

source: Go to the previous conflict
bg: Към предишния конфликт

source: Go to the next conflict
bg: Към следващия конфликт

source: Version Filters
bg: Филтри на версиите

source: File Filters
bg: Филтър за файлове

source: Text Filters
bg: Филтри за текст

source: Active
bg: Действащ

source: Column Name
bg: Име на колона

source: _Remove
bg: _Премахване

source: Move item up
bg: Преместване на елемента надолу

source: Move _Up
bg: На_долу

source: Move item down
bg: Преместване на елемента нагоре

source: Move _Down
bg: На_горе

source: Commit
bg: Подаване

source: Commit Files
bg: Файлове за подаване

source: Log Message
bg: Съобщение в журнала

source: Previous logs:
bg: Предишни съобщения:

source: _Cancel
bg: _Отказ

source: Co_mmit
bg: По_даване

source: Copy to left
bg: Копиране наляво

source: Copy to right
bg: Копиране надясно

source: Delete selected
bg: Изтриване на избраното

source: _Compare Selected Files
bg: _Сравняване на избраните файлове

source: _Mark Selected File
bg: _Отбелязване на избрания файл

source: Compare _with Marked File
bg: Сравняване с _отбелязания файл

source: Copy to _Left
bg: Копиране на_ляво

source: Copy to _Right
bg: Копиране на_дясно

source: _Delete Selected
bg: _Изтриване на избраното

source: Collapse Recursively
bg: Рекурсивно свиване

source: Expand Recursively
bg: Рекурсивно разширяване

source: _Copy File Paths
bg: Копиране на _файловите пътища

source: Select Folder
bg: Избор на папка

source: Select folder to open in this pane
bg: Избор на папка за отваряне в този панел

source: Folder 1
bg: Папка 1

source: Folder 2
bg: Папка 2

source: Folder 3
bg: Папка 3

source: Search text encoding…
bg: Търсене на текстово кодиране…

source: Push current change to the left
bg: Повтаряне на текущата промяна наляво

source: Push current change to the right
bg: Повтаряне на текущата промяна надясно

source: Copy chunks
bg: Копиране на парче

source: Delete change
bg: Заличаване на промяната

source: Copy change above the left chunk
bg: Повтаряне на промяната над лявото парче код

source: Copy change below the left chunk
bg: Повтаряне на промяната под лявото парче код

source: Copy change above the right chunk
bg: Повтаряне на промяната над дясното парче код

source: Copy change below the right chunk
bg: Повтаряне на промяната под дясното парче код

source: _Undo
bg: _Отмяна

source: _Redo
bg: По_втаряне

source: Cu_t
bg: Из_рязване

source: _Copy
bg: _Копиране

source: _Paste
bg: _Поставяне
