Repository: hekimoghlu/OpenSystem
Catalog: src/*/network-manager-iodine/po/*.po
Languages: bg

source: Iodine DNS Tunnel
bg: Iodine DNS тунел

source: Client for Iodine DNS Tunnel
bg: Клиент за Iodine DNS тунел

source: Support for tunnelling IP traffic via DNS using Iodine.
bg: Поддръжка за създаване на тунели на IP трафик чрез DNS с Iodine.

source: This is useful to get useful connectivity in cases where Internet access is severely filtered.
bg: Това е полезно за получаване на полезна свързаност в случаи, когато достъпът до Интернет е строго филтриран.

source: You need to authenticate to access the Virtual Private Network “%s”.
bg: За да получите достъп до виртуалната частна мрежа „%s“ е необходима идентификация.

source: Authenticate VPN
bg: Удостоверяване на ВЧМ

source: Password:
bg: Парола:

source: Tunnel connections via DNS.
bg: Тунелни връзки чрез DNS.

source: Saved
bg: Запазено

source: Always ask
bg: Винаги питайте

source: General
bg: Общи

source: _Toplevel Domain:
bg: _Домейн от най-горно ниво:

source: Optional
bg: По избор

source: _Nameserver:
bg: _DNS-сървър:

source: _Password:
bg: _Парола:

source: _Fragment Size:
bg: _Размер на фрагмента:

source: Show password
bg: Показване на паролата

source: invalid integer property “%s” or out of range [%d -> %d]
bg: невалидно цяло число „%s” или е извън обхвата [%d -> %d]

source: invalid boolean property “%s” (not yes or no)
bg: невалидно булево свойство „%s“ (не е „да“ или „не“)

source: unhandled property “%s” type %s
bg: необработено свойство „%s“ вид %s

source: property “%s” invalid or not supported
bg: свойството „%s“ е невалидно или не се поддържа

source: No VPN configuration options.
bg: Няма опции за настройване на ВЧМ.

source: No VPN secrets!
bg: Няма ВЧМ тайни!

source: Could not find iodine binary.
bg: Двоичната програма на iodine не може да бъде намерен.
