Repository: hekimoghlu/OpenSystem
Catalog: src/*/libgdata/po/*.po
Languages: ne

source: Batch operations are unsupported by this service.
ne: यस सेवा द्वारा ब्याच सञ्चालन असमर्थित छन्।

source: This entry does not support comments.
ne: यो प्रविष्टिले टिप्पणीहरू समर्थन गर्दैन ।

source: Comments may not be added to this entry.
ne: यो प्रविष्टिमा टिप्पणीहरू थप्न सकिँदैन।

source: This comment may not be deleted.
ne: यो टिप्पणी मेट्न सकिदैन ।

source: Invalid seek request
ne: अवैध खोजी अनुरोध

source: The server returned a malformed response.
ne: सर्भरले विकृत प्रतिक्रिया फर्कायो।

source: Access was denied by the user or server.
ne: प्रयोगकर्ता वा सर्भरद्वारा पहुँच निषेध गरिएको थियो ।

source: Error parsing XML: %s
ne: एक्सएमएल पद वर्णन गर्दा त्रुटि: %s

source: Empty document.
ne: कागजात खाली गर्नुहोस् ।

source: Error parsing JSON: %s
ne: जेएसओएन पद वर्णन गर्दा त्रुटि: %s

source: Outermost JSON node is not an object.
ne: बाह्य JSON नोड वस्तु होइन।

source: A %s element was missing required content.
ne: %s तत्वले आवश्यक सामग्री हराइरहेको थियो ।

source: The content of a %s element (‘%s’) was not in ISO 8601 format.
ne: %s तत्व ('%s') को सामग्री ISO ८६०१ ढाँचामा थिएन।

source: The value of the %s property of a %s element (‘%s’) was unknown.
ne: गुण %s को %s मान अज्ञात तत्व ('%s') थियो ।

source: The content of a %s element (‘%s’) was unknown.
ne: %s तत्व ('%s') को सामग्री अज्ञात थियो ।

source: A required property of a %s element (%s) was not present.
ne: %s तत्व (%s) को आवश्यक गुण अवस्थित थिएन ।

source: Values were present for properties %s and %s of a %s element when only one of the two is allowed.
ne: %s तत्वको गुण %s र %s का लागि मानहरू उपस्थित थिए जब दुईमध्ये एउटालाई मात्र अनुमति दिइन्छ ।

source: A required element (%s) was not present.
ne: आवश्यक तत्व (%s) अवस्थित थिएन ।

source: A singleton element (%s) was duplicated.
ne: सिंगलटन तत्व (%s) नक्कल गरिएको थियो ।

source: A ‘%s’ element was missing required content.
ne: एउटा '%s' तत्वले आवश्यक सामग्री हराइरहेको थियो ।

source: The content of a ‘%s’ element (‘%s’) was not in ISO 8601 format.
ne: '%s' तत्वको सामग्री ('%s') आईएसओ ८६०१ ढाँचामा थिएन ।

source: Invalid JSON was received from the server: %s
ne: सर्भरबाट अवैध जेएसओएन प्राप्त भयो: %s

source: The content of a %s element (‘%s’) was not in hexadecimal RGB format.
ne: %s तत्व ('%s') को सामग्री हेक्साडेसिमल आरजीबी ढाँचामा थिएन ।

source: Cannot connect to the service’s server.
ne: सेवाको सर्भरमा जडान गर्न सकिँदैन ।

source: Cannot connect to the proxy server.
ne: प्रोक्सी सर्भरमा जडान गर्न सकिँदैन ।

source: Invalid request URI or header, or unsupported nonstandard parameter: %s
ne: अवैध अनुरोध यूआरआई वा हेडर, वा असमर्थित गैर मानक मान्य: %s

source: Authentication required: %s
ne: %s प्रमाणिकरण आवश्यक छ ।

source: The requested resource was not found: %s
ne: अनुरोध गरिएको स्रोत फेला परेन: %s

source: The entry has been modified since it was downloaded: %s
ne: प्रविष्टि डाउनलोड भएदेखि परिमार्जन गरिएको छ: %s

source: Error code %u when authenticating: %s
ne: प्रमाणीकरण गर्दा %u कोड त्रुटि: %s

source: Error code %u when querying: %s
ne: क्वेरी गर्दा त्रुटि सङ्केत %u: %s

source: Error code %u when inserting an entry: %s
ne: प्रविष्टि घुसाउँदा त्रुटि सङ्केत %u: %s

source: Error code %u when updating an entry: %s
ne: प्रविष्टि अद्यावधिक गर्दा त्रुटि सङ्केत %u: %s

source: Error code %u when deleting an entry: %s
ne: प्रविष्टि मेट्दा त्रुटि सङ्केत %u: %s

source: Error code %u when downloading: %s
ne: डाउनलोड गर्दा त्रुटि सङ्केत %u: %s

source: Error code %u when uploading: %s
ne: अपलोड गर्दा त्रुटि सङ्केत %u: %s

source: Error code %u when running a batch operation: %s
ne: ब्याच सञ्चालन चलाउँदा त्रुटि सङ्केत %u: %s

source: Invalid redirect URI: %s
ne: अवैध पुनर्निर्देशन यूआरआई: %s

source: The entry has already been inserted.
ne: प्रविष्टि पहिल्यै घुसाइएको छ ।

source: Error received from server after uploading a resumable upload chunk.
ne: पुन: सुरु गर्न सकिने अपलोड खण्ड अपलोड गरेपछि सर्भरबाट त्रुटि प्राप्त भयो ।

source: Stream is already closed
ne: स्ट्रीम पहिल्यै बन्द छ

source: You have made too many API calls recently. Please wait a few minutes and try again.
ne: तपाईंले हालै धेरै एपीआई कलहरू गर्नुभएको छ। कृपया केही मिनेट पर्खनुहोस् र फेरि प्रयास गर्नुहोस्।

source: You must be authenticated to do this.
ne: तपाईं यो गर्न प्रमाणीकरण हुनुपर्छ।

source: You must be authenticated to query all calendars.
ne: तपाइँलाई सबै क्यालेन्डरहरू प्रश्नको लागि प्रमाणीकरण गर्न अनिवार्य छ।

source: You must be authenticated to query your own calendars.
ne: तपाइँलाई आफ्नो क्यालेन्डरहरू प्रश्नको लागि प्रमाणीकरण गर्न अनिवार्य छ।

source: You must be authenticated to download documents.
ne: तपाईँले कागजातहरू डाउनलोड गर्न प्रमाणीकरण गर्नुपर्दछ।

source: Unknown or unsupported document export format ‘%s’.
ne: अज्ञात वा असमर्थित कागजात निर्यात ढाँचा '%s'।

source: Invalid visibility: unrecognized value ‘%s’
ne: अवैध दृश्यता: अज्ञात मान '%s'

source: You must be authenticated to query documents.
ne: तपाइँलाई कागजातहरू प्रश्नको लागि प्रमाणीकरण गर्न अनिवार्य छ।

source: You must be authenticated to query drives.
ne: तपाईँ ड्राइभहरू क्वेरी गर्न प्रमाणीकरण हुनुपर्दछ ।

source: You must be authenticated to upload documents.
ne: तपाइँलाई कागजातहरू अपलोड लागि प्रमाणीकरण गर्न अनिवार्य छ।

source: The document has already been uploaded.
ne: कागजात पहिल्यै अपलोड गरिएको छ ।

source: You must be authenticated to update documents.
ne: तपाइँलाई कागजातहरू अद्यावधिक लागि प्रमाणीकरण गर्न अनिवार्य छ।

source: The content type of the supplied document (‘%s’) could not be recognized.
ne: आपूर्ति गरिएको कागजातको सामग्री प्रकार ('%s') पहिचान गर्न सकिएन ।

source: You must be authenticated to copy documents.
ne: कागजातहरू प्रतिलिपि गर्न तपाईँले प्रमाणीकरण गर्नुपर्दछ ।

source: Parent folder not found
ne: प्रमूल फोल्डर फेला पार्न सकिएन

source: You must be authenticated to insert or move documents and folders.
ne: तपाईँले कागजात हरू र फोल्डरहरू घुसाउन वा सार्न प्रमाणीकरण गर्नुपर्दछ ।

source: You must be authenticated to move documents and folders.
ne: तपाईँले कागजात हरू र फोल्डरहरू सार्न प्रमाणीकरण गर्नु पर्दछ ।

source: You must specify a username or be authenticated to query a user.
ne: तपाईँले प्रयोगकर्ता नाम निर्दिष्ट गर्नुपर्दछ वा प्रयोगकर्तालाई क्वेरी गर्न प्रमाणीकरण गर्नुपर्दछ ।

source: Query parameter not allowed for albums.
ne: एल्बमका लागि क्वेरी परिमिति अनुमति छैन ।

source: You must specify a username or be authenticated to query all albums.
ne: तपाईँले प्रयोगकर्ता नाम निर्दिष्ट गर्नुपर्दछ वा सबै एल्बमक्वेरी गर्न प्रमाणीकरण गर्नुपर्दछ ।

source: The album did not have a feed link.
ne: एल्बममा फिड लिङ्क थिएन ।

source: You must be authenticated to upload a file.
ne: तपाईँले फाइल अपलोड गर्न प्रमाणीकरण गर्नुपर्दछ ।

source: The album has already been inserted.
ne: एल्बम पहिल्यै घुसाइएको छ ।

source: You must be authenticated to insert an album.
ne: एल्बम घुसाउन तपाईँले प्रमाणीकरण गर्नुपर्दछ ।

source: You must be authenticated to query all tasklists.
ne: तपाईँले सबै कार्यसूची क्वेरी गर्न प्रमाणीकरण हुनुपर्दछ ।

source: You must be authenticated to query your own tasks.
ne: तपाईँले आफ्नै कार्यहरू क्वेरी गर्न प्रमाणीकरण गर्नुपर्दछ।

source: You have exceeded your entry quota. Please delete some entries and try again.
ne: तपाईँले तपाईँको प्रविष्टि कोटा पार गर्नुभएको छ । कृपया केही प्रविष्टिहरू मेट्नुहोस् र पुन: प्रयास गर्नुहोस् ।

source: Your Google Account must be associated with a YouTube channel to do this. Visit %s to create one.
ne: यसका लागि तपाईँको गुगल एकाउन्ट युट्युब च्यानलसँग जोडिएको हुनुपर्छ । एउटा सिर्जना गर्न %s मा जानुहोस् ।

source: You must be authenticated to upload a video.
ne: भिडियो अपलोड गर्न तपाईँले प्रमाणीकरण गर्नुपर्छ ।
