Repository: hekimoghlu/OpenSystem
Catalog: src/*/manuals/po/*.po
Languages: es, eu, fa, fr, oc, pt_br, ru, sv, uk, zh_cn

source: Manuals
es: Manuales
eu: Eskuliburuak
fa: دفترچه‌های راهنما
fr: Manuels
pt_br: Manuais
ru: Справочник
sv: Manualer
uk: Підручники
zh_cn: 手册

source: Install, Browse, and Search Documentation
es: Instalar, explorar y buscar documentación
eu: Instalatu, arakatu eta bilatu dokumentazioa
fa: نصب، مرور و جست‌وجوی مستندات
fr: Installer, parcourir et rechercher la documentation
oc: Installar, percórrer e cercar de la documentacion
pt_br: Instale, navegue e pesquise documentação
ru: Установка, просмотр и поиск документации
sv: Installera, bläddra bland och sök dokumentation
uk: Встановлення документації, навігація і пошук у документації
zh_cn: 安装、浏览和搜索文档

source: documentation;manuals;api;reference;docs;developer;
es: documentación;manuales;api;referencia;docs;desarrollador;programador;
eu: dokumentazioa;eskuliburuak;api;erreferentzia;dok;garatzaile;
fa: documentation;manuals;api;reference;docs;developer;مستندات;راهنما;سند;دفترچه;میانا;مرجع;توسعه;
fr: documentation;manuels;api;référence;docs;développeur;
oc: documentacion;manual;api;referéncia:docs;desvolopaire;desvolopaira;
pt_br: documentação; manuais; API; referência; documentos; desenvolvedor;
ru: документация;руководства;api;справочник;docs;разработчик;documentation;manuals;reference;developer;
sv: dokumentation;handböcker;manualer;api;referens;docs;utvecklare;
uk: documentation;manuals;api;reference;docs;developer;документація;підручники;інтерфейс;довідник;доки;розробник;
zh_cn: documentation;manuals;api;reference;docs;developer;文档;手册;接口;应用开发;引用;参考;开发者;

source: Width of sidebar in application pixels
es: Anchura de la barra lateral de la aplicación, en píxeles
eu: Alboko barraren zabalera aplikazio-pixeletan
fa: پهنای نوار کناری در برنامه بر حسب تصدانه
fr: Largeur de la barre latérale en pixels
oc: La largor de la barra laterala dins l’aplicacion en pixèls
pt_br: Largura da barra lateral em pixels de aplicação
ru: Ширина боковой панели в приложении в пикселях
sv: Sidopanelens bredd i bildpunkter
uk: Ширина бічної панелі у програмі у пікселях
zh_cn: 应用程序中侧边栏的宽度（像素）

source: Window dimensions
es: Dimensiones de la ventana
eu: Leiho-dimentsioak
fa: ابعاد پنجره
fr: Taille de la fenêtre
oc: Dimensions de la fenèstra
pt_br: Dimensões da janela
ru: Размеры окна
sv: Fönsterdimensioner
uk: Розмірності вікна
zh_cn: 窗口尺寸

source: Window is Maximized
es: La ventana está maximizada
eu: Leihoa maximizatuta dago
fa: پنجره بیشینه است
fr: Fenêtre maximisée
oc: La fenèstra es maximizada
pt_br: A janela é maximizada
ru: Окно развернуто
sv: Fönster är maximerat
uk: Вікно розгорнуто
zh_cn: 窗口最大化

source: Read developer documentation
es: Leer la documentación del desarrollador
eu: Irakurri garatzaile-dokumentazioa
fa: خواندن مستندات توسعه‌دهنده
fr: Lire la documentation développeur
oc: Legir la documentacion pels desvelopaires
pt_br: Leia a documentação do desenvolvedor
ru: Чтение документации разработчика
sv: Läs utvecklardokumentation
uk: Читання документації для розробників
zh_cn: 阅读开发者文档

source: Manuals indexes your developer manuals and provides robust browsing and searching capabilities.
es: Manuales indexa sus manuales para desarrolladores y proporciona sólidas capacidades de navegación y búsqueda.
eu: Eskuliburuak aplikazioak zure garatzaile-eskuliburuak indexatzen ditu eta arakatze- eta bilatze-aukera sendoak eskaintzen ditu.
fa: دفترچه‌های راهنما راهنماهای توسعه‌دهندگانتان را نمایه کرده و قابلیت‌های جست‌وجو و مرور را فراهم می‌کند.
fr: Manuels indexe vos manuels de développement et offre des fonctionnalités de navigation et de recherche performantes.
oc: Manuals indexa los manuals de desvolopament e provesís de capacitats robustas de navigacion e de recèrca.
pt_br: Manuais indexam seus manuais de desenvolvedor e fornecem recursos robustos de navegação e pesquisa.
ru: Приложение индексирует ваши руководства для разработчиков и предоставляет широкие возможности просмотра и поиска.
sv: Manualer indexerar dina utvecklarhandböcker och tillhandahåller robusta bläddrings- och sökförmågor.
uk: «Підручники» індексують ваші підручники для розробників і надають у ваше розпорядження стійку систему навігації і пошуку.
zh_cn: “手册”索引您的开发者手册并提供稳健的浏览和搜索能力。

source: It supports the devhelp documentation format used by many libraries integrating with the GTK platform.
es: Admite el formato de documentación devhelp utilizado por muchas bibliotecas que se integran con la plataforma GTK.
eu: GTK plataforman integratzen diren liburutegi askok erabiltzen duten devhelp dokumentazioa onartzen du.
fa: این برنامه از قالب مستندات devhelp که از سوی بسیاری از کتابخانه‌های یکپارچه با بن‌سازهٔ GTL استفاده می‌شود پشتیبانی می‌کند.
fr: L’application prend en charge le format de documentation devhelp utilisé par de nombreuses bibliothèques s’intégrant à la plate-forme GTK.
oc: Suporta lo format de documentacion devhelp utilizat per fòrça bibliotècas que s'intègran amb la plataforma GTK.
pt_br: Ele suporta o formato de documentação devhelp usado por muitas bibliotecas que se integram à plataforma GTK.
ru: Оно поддерживает формат документации devhelp, используемый многими библиотеками, интегрированными с платформой GTK.
sv: Det stöder devhelp-dokumentationsformatet som används av många bibliotek som integrerar med GTK-plattformen.
uk: У програмі передбачено підтримку формату документації devhelp, який використовується у багатьох бібліотеках, які інтегровано з платформою GTK.
zh_cn: 它支持由很多与 GTK 平台集成的共享库使用的 devhelp 文档格式。

source: Browse Documentation by SDK
es: Explorar documentación por SDK
eu: Arakatu dokumentazioa SDKaren arabera
fa: مرور مستندات بر اساس SDK
fr: Parcourir la documentation par SDK
oc: Percórrer la documentacion per SDK
pt_br: Navegue pela documentação do SDK
ru: Просмотр документации по SDK
sv: Bläddra bland dokumentation efter SDK
uk: Навігація документацією за SDK
zh_cn: 按 SDK 浏览文档

source: Free Form Search
es: Búsqueda de formulario libre
eu: Forma libreko bilaketa
fa: جست‌وجوی آزادانه
fr: Recherche libre
oc: Formulari de recèrca liure
pt_br: Pesquisa de formulário livre
ru: Поиск в свободной форме
sv: Friformssökning
uk: Пошук із довільним критерієм
zh_cn: 自由形式搜索

source: Install SDK Documentation
es: Instalar documentación del SDK
eu: Instalatu SDK dokumentazioa
fa: نصب مستندات SDK
fr: Installer la documentation des SDK
oc: Installar la documentacion SDK
pt_br: Instale a documentação do SDK
ru: Установка документации SDK
sv: Installera SDK-dokumentation
uk: Встановити документацію до SDK
zh_cn: 安装 SDK 文档

source: Integrated Dark Mode
es: Modo oscuro integrado
eu: Modu ilun integratua
fa: حالت تیرهٔ یکپارچه
fr: Mode sombre intégré
oc: Mòde fosc integrat
pt_br: Modo escuro integrado
ru: Встроенный темный режим
sv: Integrerat mörkt läge
uk: Вбудований темний режим
zh_cn: 集成暗色模式

source: Mobile Search
es: Búsqueda móvil
eu: Bilaketa mugikorra
fa: جست‌وجوی همراه
fr: Recherche mobile
oc: Recèrca mobile
pt_br: Busca móvel
ru: Мобильный поиск
sv: Mobilsökning
uk: Мобільний пошук
zh_cn: 移动搜索

source: Adaptable Documentation
es: Doumentación adaptable
eu: Dokumentazio moldakorra
fa: مستندات سازوارپذیر
fr: Documentation adaptable
oc: Documentacion adaptabla
pt_br: Documentação adaptável
ru: Адаптивная документация
sv: Adaptiv dokumentation
uk: Адаптивна документація
zh_cn: 自适应文档

source: translator-credits
es: Daniel Mustieles <Daniel.mustieles@gmail.com>, 2025
eu: Asier Saratsua Garmendia <asiersarasua@ni.eus>
fa: دانیال بهزادی <dani.behzi@ubuntu.com>
fr: Julien Humbert <julroy67@gmail.com>
oc: Quentin PAGÈS
pt_br: Juliano de Souza Camargo <julianosc@pm.me>
ru: Artur So <arturios2005@mail.ru>
sv: Anders Jonsson <anders.jonsson@norsjovallen.se>, 2025
uk: Юрій Чорноіван <yurchor@ukr.net>, 2025
zh_cn: lumingzh <lumingzh@qq.com>, 2025

source: Builder
fa: سازنده
uk: Будівник
zh_cn: 构建器

source: Create GNOME Applications
es: Crear aplicaciones de GNOME
eu: Sortu GNOME aplikazioak
fa: ایجاد برنامه‌های گنوم
fr: Créer des applications GNOME
oc: Crear d’aplicacions GNOME
pt_br: Crie aplicações GNOME
ru: Создание приложений для GNOME
sv: Skapa GNOME-program
uk: Створення програм GNOME
zh_cn: 创建 GNOME 应用程序

source: Open a new Manuals window
es: Abrir una ventana de Manuales nueva
eu: Ireki Eskuliburuak aplikazioaren leiho berria
fa: گشودن پنجرهٔ جدید دفترچه‌های راهنما
fr: Ouvrir une nouvelle fenêtre Manuels
oc: Dobrir una fenèstra novèla de Manuals
pt_br: Abrir uma nova janela do manuais
ru: Открыть новое окно Справочника
sv: Öppna ett nytt Manualer-fönster
uk: Відкрити нове вікно «Підручників»
zh_cn: 打开新的手册窗口

source: Install
es: Instalar
eu: Instalatu
fa: نصب
fr: Installer
oc: Installar
pt_br: Instalar
ru: Установка
sv: Installera
uk: Встановити
zh_cn: 安装

source: Documentation
es: Documentación
eu: Dokumentazioa
fa: مستندات
oc: Documentacion
pt_br: Documentação
ru: Документация
sv: Dokumentation
uk: Документація
zh_cn: 文档

source: Loading SDKs…
es: Cargando SDK…
eu: SDKak kargatzen…
fa: بار کردن SDK‌ها…
fr: Chargement des SDK…
oc: Cargament dels SDK…
pt_br: Carregando SDKs…
ru: Загрузка SDK…
sv: Läser in SDK:er…
uk: Завантаження SDK…
zh_cn: 正在加载 SDK…

source: Please wait while we locate the SDKs on your system
es: Espere mientras localizo los SDK en su sistema
eu: Itxaron SDKa zure sisteman aurkitzen dugun arte
fa: لطفاُ تا یافتن مکان SDKها روی سامانه‌تان شکیبا باشید
fr: Veuillez patienter pendant que nous localisons les SDK sur votre système
oc: Mercés d’esperar pendent que cercam los SDK sul sistèma
pt_br: Por favor, espere enquanto nós localizamos o SDKs em seu sistema
ru: Пожалуйста, подождите, пока мы найдем SDK в вашей системе
sv: Vänta medan vi hittar SDK:erna på ditt system
uk: Будь ласка, зачекайте на завершення пошуку SDK у вашій системі
zh_cn: 请在定位您系统上的 SDK 时等待

source: No SDKs Available
es: No hay SDK disponibles
eu: Ez dago SDKrik eskuragarri
fa: هیچ SDK‌ای موجود نیست
fr: Aucun SDK disponible
oc: Cap de SDK pas disponible
pt_br: Nenhum SDKs disponível
ru: Нет доступных SDK
sv: Inga SDK:er tillgängliga
uk: Немає доступних SDK
zh_cn: 无可用 SDK

source: Your system is not configured to access any SDKs.
es: Su sistema no está configurado para acceder a ningun SDK.
eu: Zure sistema ez dago konfiguratuta SDKak atzitzeko.
fa: سامانه‌تان برای دسترسی به هیچ SDK ای پیکربندی نشده.
fr: Votre système n’est pas configuré pour accéder aux SDK.
oc: Vòstre sistèma es pas configurat corrèctament per accedir a quin SDK que siá.
pt_br: Seu sistema não está configurado para acessar quaisquer SDKs.
ru: Ваша система не настроена для доступа к SDK.
sv: Ditt system är inte konfigurerat för att komma åt några SDK:er.
uk: Вашу систему не налаштовано на доступ до будь-яких SDK.
zh_cn: 您的系统未配置以访问任何 SDK。

source: Installed SDKs
es: SDK instalados
eu: Instalatutako SDKak
fa: SDK‌های نصب شده
fr: SDK installés
oc: SDK installats
pt_br: SDKs instalados
ru: Установленные SDK
sv: Installerade SDK:er
uk: Встановлені SDK
zh_cn: 已安装 SDK

source: Available SDKs
es: SDK disponibles
eu: Eskuragarri dauden SDKak
fa: SDK‌های موجود
fr: SDK disponibles
oc: SDK disponibles
pt_br: SDKs disponível
ru: Доступные SDK
sv: Tillgängliga SDK:er
uk: Доступні набори засобів розробки
zh_cn: 可用 SDK

source: Installing Documentation
es: Instalando documentación
eu: Dokumentazioa instalatzen
fa: نصب کردن مستندات
fr: Installation de la documentation
oc: Installacion de la documentacion
pt_br: Instalando a documentação
ru: Установка документации
sv: Installerar dokumentation
uk: Встановлення документації
zh_cn: 正在安装文档

source: _Install
es: _Instalar
eu: _Instalatu
fa: _نصب
fr: _Installer
oc: _Installar
pt_br: _Instalar
ru: _Установить
sv: _Installera
uk: _Встановити
zh_cn: 安装(_I)

source: _Cancel
es: C_ancelar
eu: _Utzi
fa: _لغو
fr: _Annuler
oc: _Anullar
pt_br: _Cancelar
ru: _Отменить
sv: A_vbryt
uk: _Скасувати
zh_cn: 取消(_C)

source: %u of %u
es: %u de %u
eu: %u / %u
fa: %Iu از %Iu
fr: %u de %u
oc: %u de %u
pt_br: %u de %u
ru: %u из %u
sv: %u av %u
uk: %u з %u
zh_cn: %u 共 %u

source: Search
es: Buscar
eu: Bilatu
fa: جست‌وجو
fr: Recherche
oc: Cercar
pt_br: Procurar
ru: Поиск
sv: Sök
uk: Пошук
zh_cn: 搜索

source: Open Link in New Tab
es: Abrir enlace en una pestaña nueva
eu: Ireki esteka fitxa berrian
fa: گشودن پیوند در زبانهٔ جدید
fr: Ouvrir le lien dans un nouvel onglet
oc: Dobrir lo ligam dins un onglet novèl
pt_br: Abrir link em nova aba
ru: Открыть ссылку в новой вкладке
sv: Öppna länk i ny flik
uk: Відкрити посилання у новій вкладці
zh_cn: 在新标签页中打开链接

source: Open Link in New Window
es: Abrir enlace en una ventana nueva
eu: Ireki esteka leiho berrian
fa: گشودن پیوند در پنجرهٔ جدید
fr: Ouvrir le lien dans une nouvelle fenêtre
oc: Dobrir lo ligam dins una fenèstra novèla
pt_br: Abrir link em nova janela
ru: Открыть ссылку в новом окне
sv: Öppna länk i nytt fönster
uk: Відкрити посилання у новому вікні
zh_cn: 在新窗口中打开链接

source: Empty Page
es: Página vacía
eu: Orri hutsa
fa: صفحهٔ خالی
fr: Page vide
oc: Pagina voida
pt_br: Página vazia
ru: Пустая страница
sv: Tom sida
uk: Порожня сторінка
zh_cn: 空白页

source: Loading…
es: Cargando…
eu: Kargatzen…
fa: بار کردن…
fr: Chargement…
oc: Cargament…
pt_br: Carregando…
ru: Загрузка…
sv: Läser in…
uk: Завантаження…
zh_cn: 正在加载…

source: One moment please while we locate your documentation
es: Un momento mientras busco su documentación
eu: Itxaron zure dokumentazioa aurkitzen dugun arte
fa: یک لحظه زمان برای یافتن مکان مستنداتتان
fr: Veuillez patienter pendant que nous recherchons votre documentation
oc: Mercés d’esperar pendent que cercam la documentacion
pt_br: Um momento, por favor, enquanto localizamos sua documentação
ru: Минутку, пожалуйста, пока мы найдем вашу документацию
sv: Ett ögonblick medan vi hittar din dokumentation
uk: Хвилиночку, будь ласка — шукаємо документацію
zh_cn: 请在定位您的文档时稍等

source: Browse Documentation
es: Explorar la documentación
eu: Arakatu dokumentazioa
fa: مرور مستندات
fr: Parcourir la documentation
oc: Percórrer la documentacion
pt_br: Procure documentação
ru: Просмотр документации
sv: Bläddra bland dokumentation
uk: Навігація документацією
zh_cn: 浏览文档

source: • Press Ctrl+K to search for classes and more • Press Ctrl+T to open a new tab Or, press Ctrl+W to close the window
es: • Pulse Ctrl+K para buscar clases y más. • Pulse Ctrl+T para abrir una nueva pestaña. O pulse Ctrl+W para cerrar la ventana.
eu: • Sakatu Ctrl+K klaseak eta gehiago bilatzeko • Sakatu Ctrl+T fitxa berria irekitzeko Edo sakatu Ctrl+W leihoa ixteko
fa: • زدن مهار+K برای جست‌وجوی کلاس‌ها و بیش‌تر • زدن مهار+T برای گشودن زبانه‌ای جدید یا زدن مهار+W برای بستن پنجره
fr: • Appuyez sur Ctrl+K pour rechercher des classes et plus encore • Appuyez sur Ctrl+T pour ouvrir un nouvel onglet Ou appuyez sur Ctrl+W pour fermer la fenêtre
oc: • Quichar Ctrl+K per cercar de classas e mai • Quichar Ctrl+T per dobrir un onglet novèl O, quichar Ctrl+W per tampar la fenèstra
pt_br: • Pressione Ctrl+K para procurar aulas e mais • Pressione Ctrl+T para abrir uma nova guia Ou pressione Ctrl+W para fechar a janela
ru: • Нажмите Ctrl+K, чтобы найти классы и прочее • Нажмите Ctrl+T, чтобы открыть новую вкладку Или нажмите Ctrl+W, чтобы закрыть окно
sv: • Tryck Ctrl+K för att söka klasser med mera • Tryck Ctrl+T för att öppna en ny flik Eller tryck Ctrl+W för att stänga fönstret
uk: • Натисніть Ctrl+K, щоб шукати класи та інше • Натисніть Ctrl+T, щоб відкрити нову вкладку Або натисніть Ctrl+W, щоб закрити це вікно
zh_cn: • 按 Ctrl+K 以搜索类和更多 • 按 Ctrl+T 以打开新标签页 或按 Ctrl+W 以关闭窗口

source: Install Documentation…
es: Instalar documentación…
eu: Instalatu dokumentazioa…
fa: نصب مستندات…
fr: Installer la documentation…
oc: Installar la documentacion…
pt_br: Instale a documentação…
ru: Установить документацию…
sv: _Installera dokumentation…
uk: Встановити документацію…
zh_cn: 安装文档…

source: Filter…
es: Filtrar…
eu: Iragazkia…
fa: پالایش…
fr: Filtrer…
oc: Filtre…
pt_br: Filtro…
ru: Фильтровать…
sv: Filtrera…
uk: Фільтрувати…
zh_cn: 筛选器…

source: Toggle Sidebar
es: Conmutar barra lateral
eu: Txandakatu alboko barra
fa: تغییر وضعیت نوار کناری
fr: Afficher/masquer la barre latérale
oc: Alternar la barra laterala
pt_br: Alterne a barra lateral
ru: Переключить боковую панель
sv: Växla sidopanel
uk: Увімкнути або вимкнути бічну панель
zh_cn: 切换侧边栏

source: Main Menu
es: Menú principal
eu: Menu nagusia
fa: فهرست اصلی
fr: Menu principal
oc: Menú principal
pt_br: Menu principal
ru: Главное меню
sv: Huvudmeny
uk: Головне меню
zh_cn: 主菜单

source: New _Tab
es: _Pestaña nueva
eu: _Fitxa berria
fa: _‌زبانهٔ جدید
fr: Nouvel _onglet
oc: Ongle_t novèl
pt_br: Novo _aba
ru: Новая _вкладка
sv: Ny f_lik
uk: Нова _вкладка
zh_cn: 新建标签页(_T)

source: New _Window
es: _Ventana nueva
eu: Leiho _berria
fa: _پنجرهٔ جدید
fr: Nouvelle _fenêtre
oc: _Fenèstra novèla
pt_br: Nova _janela
ru: Новое о_кно
sv: Nytt _fönster
uk: Створити _вікно
zh_cn: 新建窗口(_W)

source: _Install Documentation…
es: _Instalar documentación…
eu: _Instalatu dokumentazioa…
fa: _نصب مستندات…
fr: _Installer la documentation…
oc: _Installar la documentacion…
pt_br: _Instale a documentação…
ru: _Установить документацию…
sv: _Installera dokumentation…
uk: _Встановити документацію…
zh_cn: 安装文档(_I)…

source: _About Manuals
es: Acerca _de Manuales
eu: Eskuliburuak aplikazioari _buruz
fa: _دربارهٔ دفترچه‌های راهنما
fr: _À propos de Manuels
oc: _A prepaus de Manuals
pt_br: _Sobre manuais
ru: _О приложении
sv: _Om Manualer
uk: _Про «Підручники»
zh_cn: 关于手册(_A)
