Repository: hekimoghlu/OpenSystem
Catalog: src/*/iagno/po/*.po
Languages: hi

source: Dominate the board in a classic reversi game, or play the reversed variant
hi: शास्त्रीय रिवर्सी खेल में बोर्ड पर हावी हों, या उल्टा संस्करण खेलें

source: Reversi is a two-player strategy game, played on an 8 by 8 board. Players use tiles that are dark on one side and light on the other.
hi: रिवर्सी दो खिलाड़ियों वाला रणनीति खेल है, जो 8 बाय 8 बोर्ड पर खेला जाता है। खिलाड़ी ऐसी टाइलों का उपयोग करते हैं जो एक तरफ गहरे रंग की और दूसरी तरफ हल्की होती हैं।

source: The object of reversi is to flip your opponent’s tiles to your color, while your opponent is trying to flip your tiles to his own color. Opponent’s tiles are flipped when trapped between an already placed tile of your color and the tile you add. Who finishes with more tiles wins!
hi: रिवर्सी का उद्देश्य आपके प्रतिद्वंद्वी की टाइलों को आपके रंग में बदलना है, जबकि आपका प्रतिद्वंद्वी आपकी टाइलों को अपने रंग में बदलने का प्रयास कर रहा है। आपके रंग की पहले से रखी टाइल और आपके द्वारा जोड़ी गई टाइल के बीच फंसने पर प्रतिद्वंद्वी की टाइलें पलट जाती हैं। जो अधिक टाइलों के साथ समापन करता है वह जीतता है!

source: Reversi allows you to play both a classic reversi game, and the reversed variant, where the goal is to finish with less tile than your opponent.
hi: रिवर्सी आपको शास्त्रीय रिवर्सी खेल और उल्टा संस्करण दोनों खेलने की अनुमति देता है, जहां लक्ष्य अपने प्रतिद्वंद्वी की तुलना में कम टाइल के साथ समाप्त करना है।

source: A Reversi game preview
hi: रिवर्सी खेल का पूर्वावलोकन

source: The Reversi Team
hi: रिवर्सी टीम

source: Dominate the board in a classic version of Reversi
hi: रिवर्सी के शास्त्रीय संस्करण में बोर्ड पर प्रभुत्व रखें

source: reversi;othello;
hi: रिवर्सी;ओथेलो;

source: Actions
hi: क्रियाएँ

source: Current view actions
hi: वर्तमान दृश्य क्रियाएँ

source: Start a new game
hi: नया खेल प्रारंभ करें

source: _New Game
hi: नया खेल (_N)

source: Go back to the current game
hi: वर्तमान खेल पर वापस जाएँ

# shortcut window
source: During a game
hi: खेल के दौरान

# shortcut window
source: New game
hi: नया खेल (_N)

# shortcut window
source: Undo last move
hi: पिछली चाल पूर्ववत करें

# shortcut window
source: Toggle game menu
hi: खेल मेनू टॉगल करें

# shortcut window
source: Play with keyboard
hi: कीबोर्ड से खेलें

# shortcut window
source: Select where to play
hi: चुनें कि कहां खेलना है

# shortcut window
source: Select the given row
hi: दी गई पंक्ति का चयन करें

# shortcut window
source: Select the given column
hi: दिए गए कॉलम को चुनें

# shortcut window
source: Play on selected tile
hi: चयनित टाइल पर खेलें

# shortcut window
source: During game selection
hi: खेल चयन के दौरान

# shortcut window
source: Start new game
hi: नया खेल प्रारंभ करें

# shortcut window
source: Go back
hi: पीछे जाएँ

# shortcut window
source: Generic
hi: सामान्य

# shortcut window
source: Toggle main menu
hi: मुख्य मेनू टॉगल करें

# shortcut window
source: Keyboard shortcuts
hi: कीबोर्ड शॉर्टकट

# shortcut window
source: Help
hi: सहायता

# shortcut window
source: About
hi: बारे में

# shortcut window
source: Quit
hi: छोड़ें

source: End!
hi: समाप्त!

source: Game
hi: खेल

source: Options
hi: विकल्प

source: Adwaita
hi: अद्वैता

source: Classic
hi: शास्त्रीय

source: Black and White
hi: काला और सफेद

source: Sun and Star
hi: सूर्य और तारा

source: A flag to follow system night light
hi: प्रणाली रात्रि प्रकाश का अनुसरण करने हेतु ध्वज

source: Use GNOME night light setting to activate night-mode.
hi: रात्रि-मोड सक्रिय करने के लिए GNOME रात्रि प्रकाश प्रणाली का उपयोग करें।

source: The width of the window
hi: विंडो की चौड़ाई

source: The width of the main window in pixels.
hi: मुख्य विंडो की चौड़ाई पिक्सल में।

source: The height of the window
hi: विंडो की ऊँचाई

source: The height of the main window in pixels.
hi: मुख्य विंडो की ऊंचाई पिक्सल में।

source: A flag to enable maximized mode
hi: अधिकतम मोड सक्षम करने हेतु ध्वज

source: If “true”, the main window starts in maximized mode.
hi: यदि "सही" है, तो मुख्य विंडो अधिकतम मोड में प्रारंभ होती है।

source: A flag to alternate who starts
hi: प्रारंभ करने वाले को वैकल्पिक करने हेतु ध्वज

source: If “true”, when playing against AI, the “color” settings is toggled after every new game request, making the next game being started with inverted roles (previous Dark player playing Light). Ignored for two-player games.
hi: यदि "सही" है, तो AI के खिलाफ खेलते समय, "रंग" सेटिंग्स को हर नए खेल अनुरोध के बाद टॉगल किया जाता है, जिससे अगला खेल उलटी भूमिकाओं (पिछला गहरा खिलाड़ी हल्के से खेल रहा है) के साथ शुरू किया जा रहा है। दो-खिलाड़ियों वाले खेल के लिए अनदेखा किया गया।

source: Color to play as
hi: इस रंग से खेलने के लिए

source: Whether to play as Dark or Light. Ignored for two-player games.
hi: चाहे तो गहरे या हल्के रंग से खेलें। दो-खिलाड़ी वाले खेलों के लिए अनदेखा किया गया।

source: Computer’s AI level
hi: कंप्यूटर के AI का स्तर

source: From 1, the easiest, to 3, the hardest.
hi: 1 (सबसे आसान) से 3 (सबसे कठिन) तक।

source: A flag to highlight playable tiles
hi: खेलने योग्य टाइलों को चिन्हांकित करने हेतु ध्वज

source: If “true”, the tiles where you can play are highlighted.
hi: यदि "सही" है, तो वे टाइलें चिन्हांकित हो जाती हैं जहां आप खेल सकते हैं।

source: A flag to highlight capturable tiles
hi: कब्ज़े योग्य टाइलों को चिन्हांकित करने हेतु ध्वज

source: If “true”, the tiles that will be captured to the opponent by a play are highlighted.
hi: यदि "सही" है, तो वे टाइलें चिन्हांकित हो जाती हैं जिन्हें प्रतिद्वंद्वी की चाल द्वारा कब्ज़े में लिया जा सकता है।

source: Whether to play against the computer or another human.
hi: चाहे कंप्यूटर या किसी अन्य मानव के विरुद्ध खेलें।

source: A flag to randomize start position
hi: प्रारंभ स्थिति को यादृच्छिक बनाने हेतु ध्वज

source: Reversi can be played with two different initial positions (and their symmetries). If “true”, the game will randomly start with one or the other position; if “false”, only the most common initial position is used. You can force the game to use the alternative position by using the “--alternative-start” argument on the command-line; also, if either “--usual-start” or “--random-start” is given instead on the command-line, this flag will be ignored.
hi: रिवर्सी को दो अलग प्रारंभिक स्थितियों (और उनकी समरूपता) के साथ खेला जा सकता है। यदि "सही" है, तो खेल बेतरतीब ढंग से एक या दूसरे स्थान से शुरू होगा; यदि "गलत" है, तो केवल सबसे सामान्य प्रारंभिक स्थिति का उपयोग किया जाता है। आप कमांड-लाइन पर "--alternative-start" तर्क का उपयोग करके खेल को वैकल्पिक स्थिति का उपयोग करने के लिए बाध्य कर सकते हैं; इसके अलावा, यदि कमांड-लाइन पर इसके बजाय "--usual-start" या "--random-start" दिया गया है, तो इस ध्वज को अनदेखा कर दिया जाएगा।

source: Sound
hi: ध्वनि

source: Whether or not to play event sounds.
hi: घटनाओं हेतु ध्वनि बजाएँ या नहीं।

source: Theme
hi: थीम

source: Filename of the theme used, or “default”. Are provided “adwaita.theme”, “high_contrast.theme” and “sun_and_star.theme”.
hi: प्रयुक्त थीम का फाइल नाम, या "डिफ़ॉल्ट"। "adwaita.theme", "high_contrast.theme" और "sun_and_star.theme" उपलब्ध कराए गए हैं।

source: Name of the game
hi: खेल का नाम

source: The name of the game that will be played. It could be “classic” (the usual game, where you try to have more pieces), or “reverse” (the opposite game, where you try to have less pieces).
hi: उस खेल का नाम जो खेला जाएगा। यह "शास्त्रीय" (सामान्य खेल, जहां आप अधिक टुकड़े रखने की कोशिश करते हैं), या "उल्टा" (विपरीत खेल, जहां आप कम टुकड़े रखने की कोशिश करते हैं) हो सकता है।

source: About
hi: बारे में

source: Credits
hi: श्रेय

source: GNU General Public License version 3 or later
hi: GNU जनरल पब्लिक लाइसेंस संस्करण 3 या बाद का

source: Creators
hi: निर्माता

source: Documenters
hi: दस्तावेज़कर्ता

source: Translators
hi: रविशंकर श्रीवास्तव (raviratlami@yahoo.com) राजेश रंजन (rajeshkajha@yahoo.com) Scrambled777 <weblate.scrambled777@simplelogin.com>

source: Artists
hi: कलाकार

source: Pause night mode
hi: रात्रि मोड रोकें

source: Reuse night mode
hi: रात्रि मोड का पुनः उपयोग

source: Use night mode
hi: रात्रि मोड का उपयोग करें

source: _Keyboard Shortcuts
hi: कीबोर्ड शॉर्टकट (_K)

source: _Help
hi: सहायता (_H)

source: A_ppearance
hi: दिखावट (_p)

source: _Sound
hi: ध्वनि (_S)

source: _Start Game
hi: खेल शुरू करें (_S)

source: Start with an alternative position
hi: वैकल्पिक स्थिति से शुरुआत करें

source: Play Classic Reversi
hi: शास्त्रीय रिवर्सी खेलें

source: Reduce delay before AI moves
hi: AI के चलने से पहले देरी कम करें

source: Play first
hi: पहले खेलें

source: Set the level of the computer’s AI
hi: कंप्यूटर के AI का स्तर निर्धारित करें

source: LEVEL
hi: स्तर

source: Turn off the sound
hi: ध्वनि बंद करें

source: Log the game moves
hi: खेल की चालों का हिसाब रखें

source: Start with a random position
hi: किसी यादृच्छिक स्थिति से प्रारंभ करें

source: Play Reverse Reversi
hi: उल्टा रिवर्सी खेलें

source: Play second
hi: दूसरा खेलें

source: Size of the board (debug only)
hi: बोर्ड का आकार (केवल डिबग)

source: SIZE
hi: आकार

source: Two-players mode
hi: दो-खिलाड़ी मोड

source: Turn on the sound
hi: ध्वनि चालू करें

source: Start with the usual position
hi: सामान्य स्थिति से प्रारंभ करें

source: Print release version and exit
hi: रिलीज़ संस्करण प्रिंट करें और बाहर निकलें

source: The “--alternative-start”, “--random-start” and “--usual-start” arguments are mutually exclusive.
hi: "--alternative-start", "--random-start" और "--usual-start" तर्क परस्पर अनन्य हैं।

source: The “--classic” and “--reverse” arguments are mutually exclusive.
hi: "--classic" और "--reverse" तर्क परस्पर अनन्य हैं

source: Size must be at least 4.
hi: आकार कम से कम 4 होना चाहिए।

source: Size must not be more than 16.
hi: आकार 16 से अधिक नहीं होना चाहिए।

source: Level should be between 1 (easy) and 3 (hard). Settings unchanged.
hi: स्तर 1 (आसान) और 3 (कठिन) के बीच होना चाहिए। सेटिंग्स अपरिवर्तित।

source: Play _first (Dark)
hi: पहले खेलें (गहरा) (_f)

source: Play _second (Light)
hi: दूसरा खेलें (हल्का) (_s)

source: _Alternate who starts
hi: वैकल्पिक कौन प्रारंभ करें (_A)

source: _Two players
hi: दो खिलाड़ी (_T)

source: _Easy
hi: आसान (_E)

source: _Medium
hi: मध्यम (_M)

source: _Hard
hi: कठिन (_H)

source: _Vary start position
hi: आरंभिक स्थिति बदलें (_V)

source: Classic Reversi
hi: शास्त्रीय रिवर्सी

source: Reverse Reversi
hi: उल्टा रिवर्सी

source: Default
hi: डिफ़ॉल्ट

source: Pla_yable tiles
hi: खेलने योग्य टाइलें (_y)

source: _Capturable tiles
hi: कब्जायोग्य टाइलें (_C)

source: Highlights
hi: चिन्हांकित

source: _Undo last move
hi: पिछली चाल पूर्ववत करें (_U)

source: _Show final board
hi: अंतिम बोर्ड दिखाएँ (_S)

source: _About Reversi
hi: Reversi के बारे में (_A)

source: Two players
hi: दो खिलाड़ी

source: Color: Dark
hi: रंग: गहरा

source: Color: Light
hi: रंग: हल्का

source: More options
hi: अधिक विकल्प

source: Difficulty: Easy
hi: कठिनाई: आसान

source: Difficulty: Medium
hi: कठिनाई: मध्यम

source: Difficulty: Hard
hi: कठिनाई: कठिन

source: Light must pass, Dark’s move
hi: हल्के को छोड़ना होगा, गहरे की चाल

source: Dark must pass, Light’s move
hi: गहरे को छोड़ना होगा, हल्के की चाल

source: Light wins! (%u-%u)
hi: हल्का जीता! (%u-%u)

source: Dark wins! (%u-%u)
hi: गहरा जीता! (%u-%u)

source: The game is draw.
hi: खेल बराबरी पर रहा।

source: You can’t move there!
hi: आप वहां नहीं जा सकते!

source: In this opening, Light can only play on tiles bordering on Dark one.
hi: इस उद्घाटन में, हल्का केवल गहरे की सीमा वाली टाइलों पर ही चल सकती है।

source: Click on one of the highlighted tiles to move the selected piece there.
hi: चयनित टुकड़े को चलने के लिए चिन्हांकित में से एक टाइलों पर क्लिक करें।

source: A disk flipping game derived from Reversi
hi: रिवर्सी से प्राप्त एक डिस्क फ़्लिपिंग खेल

source: Masuichi Ito (pieces)
hi: मासुइची इतो (टुकड़े)

source: Arnaud Bonatti (themes)
hi: अरनॉड बोनाटी (थीम)

source: Ian Peters
hi: इयान पीटर्स

source: Robert Ancell
hi: रॉबर्ट एंसेल

source: Arnaud Bonatti
hi: अरनॉड बोनाटी

source: Copyright © %u-%u – Ian Peters
hi: कॉपीराइट © %u-%u - इयान पीटर्स

source: Copyright © %u-%u – Michael Catanzaro
hi: कॉपीराइट © %u-%u - माइकल कैटनज़ारो

source: Copyright © %u-%u – Arnaud Bonatti
hi: कॉपीराइट © %u-%u - अरनॉड बोनाटी

source: Tiffany Antopolski
hi: टिफ़नी एंटोपोलस्की

source: translator-credits
hi: रविशंकर श्रीवास्तव (raviratlami@yahoo.com) राजेश रंजन (rajeshkajha@yahoo.com) Scrambled777 <weblate.scrambled777@simplelogin.com>

source: Page on GNOME wiki
hi: GNOME विकी पर पेज

source: Size: %d × %d ▾
hi: आकार: %d × %d ▾
