Repository: hekimoghlu/OpenSystem
Catalog: src/*/phodav/po/*.po
Languages: bg, nl

source: Print program version
bg: Извеждане на версията на програмата
nl: Programmaversie tonen

source: Be verbose
bg: Извеждане на допълнителна информация
nl: Uitgebreide uitvoer

source: Port to listen to
bg: Порт за слушане
nl: Poort om op te luisteren

source: Listen on loopback only
bg: Слушане само на локалния интерфейс
nl: Enkel op loopback luisteren

source: Listen on all interfaces
bg: Слушане на всички интерфейси
nl: Op alle interfaces luisteren

source: Path to export
bg: Местоположение за изнасяне
nl: Pad naar export

source: Path to htdigest file
bg: Местоположение на файла htdigest
nl: Pad naar htdigest-bestand

source: DIGEST realm
bg: DIGEST сфера
nl: DIGEST-domein

source: Read-only access
bg: Достъп само за четене
nl: Alleen-lezen-toegang

source: Skip mDNS service announcement
bg: Пропускане на съобщението за mDNS услугата
nl: mDNS-dienstaankondiging overslaan

source: - simple WebDAV server
bg: — прост WebDAV сървър
nl: - eenvoudige WebDAV-server

source: Report bugs to <%s>
bg: Докладвайте за грешки на <%s>
nl: Rapporteer fouten aan <%s>

source: Option parsing failed: %s
bg: Опцията не може да бъде разчетена: %s
nl: Ontleden van optie mislukt: %s

source: Unsupported extra arguments: %s ...
bg: Неподдържани допълнителни аргументи: %s ...
nl: Niet-ondersteunde extra parameters: %s â€¦

source: --local and --public are mutually exclusive
bg: --local и --public са несъвместим
nl: --local en --public sluiten elkaar onderling uit

source: Failed to open htdigest: %s
bg: htdigest не може да бъде отворен: %s
nl: Openen van htdigest mislukt: %s

source: mDNS failed: %s
bg: mDNS е неуспешно: %s
nl: mDNS mislukt: %s

source: Internal error, should not happen
bg: Вътрешна грешка, не би трябвало да се случва
nl: Interne fout, dit zou niet mogen gebeuren

source: Listen failed: %s
bg: Слушането е неуспешно: %s
nl: Luisteren mislukt: %s
