Repository: hekimoghlu/OpenSystem
Catalog: src/*/systemuserland-boxes/po/*.po
Languages: ug

source: Virtual machine viewer/manager
ug: مەۋھۇم ماشىنا كۆرگۈچ/باشقۇرغۇچ

source: View and use virtual machines
ug: مەۋھۇم ماشىنىنى ئىشلىتىش ۋە كۆرۈش

source: virtual machine;vm;
ug: virtual machine;vm;مەۋھۇم ماشىنا;

source: Virtualization made simple
ug: مەۋھۇملاشتۇرۇشنى ئاددىيلاشتۇرىدۇ

source: Select an operating system and let Boxes download and install it for you in a virtual machine.
ug: مەشغۇلات سىستېمىسى تاللانسا Boxes سىزگە كېرەكلىكنى چۈشۈرۈپ مەۋھۇم ماشىنىغا ئورنىتىدۇ.

source: Features:
ug: ئىقتىدار:

source: Download freely available operating systems
ug: ئىشلەتكىلى بولىدىغان مەشغۇلات سىستېمىلىرىنى ھەقسىز چۈشۈرىدۇ

source: Automatically install CentOS Stream, Debian, Fedora, Microsoft Windows, OpenSUSE, Red Hat Enterprise Linux, and Ubuntu
ug: مەشغۇلات سىستېمىسىدىن CentOS Stream، Debian، Fedora، Microsoft Windows، OpenSUSE، Red Hat Enterprise Linux ۋە Ubuntu نى ئاپتوماتىك ئورنىتىدۇ

source: Create virtual machines from operating system images with a couple of clicks
ug: بىر قانچە قېتىم چېكىپلا مەشغۇلات سىستېمىسىنىڭ تەسۋىر ھۆججىتىدىن مەۋھۇم ماشىنا قۇرغىلى بولىدۇ

source: Limit the resources (memory and storage) your virtual machines consume from your system
ug: سىستېمىڭىزدىن مەۋھۇم ماشىنا سەرپ قىلىدىغان مەنبە (ئەسلەك ۋە ساقلىغۇچ) نى چەكلەڭ

source: Take snapshots of virtual machines to restore to previous states
ug: ئالدىنقى قېتىملىق ھالەتنى ئەسلىگە كەلتۈرۈش ئۈچۈن مەۋھۇم ماشىنىنىڭ ھالىتىنى ساقلايدۇ

source: Redirect USB devices from your physical machine into virtual machines
ug: USB ئۈسكۈنىلىرىنى فىزىكىلىق كومپيۇتېرىڭىزدىن مەۋھۇم ماشىنىغا نىشانلايدۇ

source: 3D acceleration for some of the supported operating systems
ug: قوللايدىغان بەزى مەشغۇلات سىستېمىلىرى ئۈچۈن 3D نى تېزلىتىدۇ

source: Automatically resize virtual machines displays to the window size
ug: مەۋھۇم ماشىنىنىڭ كۆرۈنۈشىنى كۆزنەك چوڭلۇقىغا ئۆزلۈكىدىن تەڭشەيدۇ

source: Share clipboard between your system and virtual machines
ug: سىستېمىڭىز بىلەن مەۋھۇم ماشىنا ئارىسىدا چاپلاش تاختىسىنى ھەمبەھىرلەيدۇ

source: Share files to virtual machines by dropping them from your file manager into the Boxes window
ug: ھۆججەت باشقۇرغۇچىڭىزدىن ھۆججەتنى مەۋھۇم ماشىنىنىڭ Boxes كۆزنىكىگە سۆرەپ تاشلاپلا ھەمبەھىرلىگىلى بولىدۇ

source: Setup Shared Folders between your system and virtual machines
ug: سىستېمىڭىز بىلەن مەۋھۇم ماشىنا ئارىسىدا ھەمبەھىر قىسقۇچنى تەڭشىگىلى بولىدۇ

source: The GNOME Project
ug: GNOME قۇرۇلۇشى

source: Screenshot interval
ug: ئېكران كۆرۈنۈشى تۇتۇش ئارىلىقى

source: The interval in seconds between screenshot updates
ug: ئېكران كۆرۈنۈشلىرىنىڭ يېڭىلىنىش ۋاقتى

source: Window size
ug: كۆزنەك چوڭلۇقى

source: Window size (width and height)
ug: كۆزنەك چوڭلۇقى(كەڭلىك ۋە ئېگىزلىك)

source: Window position
ug: كۆزنەك ئورنى

source: Window position (x and y)
ug: كۆزنەك ئورنى (x ۋە y)

source: Window maximized
ug: كۆزنەك چوڭايتىلدى

source: Window maximized state
ug: كۆزنەك ئەڭ چوڭ ھالەتتە

source: First run
ug: تۇنجى قوزغىتىش

source: Whether Boxes is running for the first time
ug: Boxes تۇنجى قېتىم ئىجرا بولۇۋاتامدۇ يوق

source: Shared folders
ug: ھەمبەھىرلەنگەن قىسقۇچ

source: Variant array of shared folders’ names and path mapping
ug: ھەمبەھىرلەنگەن قىسقۇچ ئىسمى ۋە يول خەرىتىلەشنىڭ شالغۇت قاتارى

source: Recommended Downloads Source URL
ug: تەۋسىيە قىلىنغان چۈشۈرۈش مەنبە تور ئادرېسى

source: An URL pointing at a recommended-downloads.xml file
ug: بىر recommended-downloads.xml ھۆججەتتىكى تور ئادرېس نۇقتىسى

source: Welcome to Boxes
ug: Boxes قا خۇش كەلدىڭىز

source: Use the <b>+</b> button to create your first virtual machine.
ug: <b>+</b> توپچىنى چېكىپ تۇنجى مەۋھۇم ماشىنىڭىزنى قۇرۇڭ.

source: New Virtual Machine
ug: يېڭى مەۋھۇم ماشىنا

source: Cancel
ug: ۋاز كەچ

source: Create
ug: ياسا

source: Name
ug: ئاتى

source: Operating System
ug: مەشغۇلات سىستېمىسى

source: Operating System not found
ug: مەشغۇلات سىستېمىسى تېپىلمىدى

source: Resources
ug: مەنبە

source: Memory
ug: ئەسلەك

source: Storage limit
ug: ساقلىغۇچ چېكى

source: Oops! Something went wrong!
ug: ئاپلا! خاتالىق كۆرۈلدى!

source: Setting up drivers...
ug: قوزغاتقۇچنى تەڭشەۋاتىدۇ…

source: Express Installation
ug: تېز ئورنىتىش

source: Set credentials for an automatic install of the operating system.
ug: مەشغۇلات سىستېمىسىنىڭ ئاپتوماتىك ئورنىتىلىشى ئۈچۈن كىملىك ئۇچۇرى تەڭشىلىدۇ.

source: Username
ug: ئىشلەتكۈچى ئاتى

source: Enter username...
ug: ئىشلەتكۈچى ئاتى كىرگۈزۈلىدۇ…

source: Password
ug: ئىم

source: Enter password...
ug: ئىم كىرگۈزۈلىدۇ…

source: Product Key
ug: مەھسۇلات ئاچقۇچى

source: Firmware
ug: مۇقىم دېتال

source: Unknown media
ug: يوچۇن ۋاسىتە

source: Select an Operating System
ug: مەشغۇلات سىستېمىسى تاللىنىدۇ

source: Search for an operating system…
ug: مەشغۇلات سىستېمىسىنى ئىزدەۋاتىدۇ…

source: Search for an Operating System
ug: مەغۇلات سىستېمىسى ئىزدە

source: Download an Operating System
ug: مەشغۇلات سىستېمىسى چۈشۈرىدۇ

source: New
ug: يېڭى

source: Back
ug: قايت

source: Application Menu
ug: پىروگرامما تىزىملىكى

source: List view
ug: تىزىم كۆرۈنۈشى

source: Grid view
ug: تورسىمان كۆرۈنۈش

source: Search
ug: ئىزدە

source: Downloads
ug: چۈشۈرۈش

source: Create new virtual machine
ug: يېڭى مەۋھۇم ماشىنا قۇرىدۇ

source: Install from File
ug: ھۆججەتتىن ئورنات

source: Select an .iso or .qcow2 file to install a virtual machine.
ug: مەۋھۇم ماشىنا ئورنىتىش ئۈچۈن .iso ياكى .qcow2 ھۆججىتى تاللىنىدۇ.

source: Download OS
ug: مەشغۇلات سىستېمىسى چۈشۈر

source: Browse and search for operating systems to install.
ug: ئورنىتىدىغان مەشغۇلات سىستېمىسىغا كۆز يۈگۈرتۈپ ئىزدەيدۇ.

source: Ready to Receive File
ug: ھۆججەت قوبۇللاشقا تەييار

source: You will find your file in the Downloads directory.
ug: ھۆججەتنى چۈشۈرۈش مۇندەرىجىسىدىن تاپقىلى بولىدۇ.

source: Actions
ug: مەشغۇلات

source: Keyboard shortcuts
ug: ھەرپتاختا تېزلەتمىسى

source: Fullscreen
ug: پۈتۈن ئېكران

source: Ready to install
ug: ئورنىتىشقا تەييارلاندى

# shortcut window
source: Overview
ug: ئىخچام كۆرۈنۈش

# shortcut window
source: Help
ug: ياردەم

# shortcut window
source: Open main menu
ug: ئاساسىي تىزىملىكنى ئاچ

# shortcut window
source: Create a new virtual machine
ug: يېڭى مەۋھۇم ماشىنا قۇرىدۇ

# shortcut window
source: Search
ug: ئىزدە

# shortcut window
source: Keyboard shortcuts
ug: ھەرپتاختا تېزلەتمىسى

# shortcut window
source: Close Window/Quit Boxes
ug: كۆزنەك ياپ/Boxes دىن چېكىن

# shortcut window
source: Box Creation and Properties
ug: Box قۇرۇش ۋە خاسلىق

# shortcut window
source: Switch to the next page
ug: كېيىنكى بەتكە ئالمىشىدۇ

# shortcut window
source: Switch to the previous page
ug: ئالدىنقى بەتكە ئالمىشىدۇ

# shortcut window
source: Box Display
ug: Box كۆرسىتىش

# shortcut window
source: Grab/Ungrab keyboard
ug: ھەرپتاختىنى تۇتۇش/قويۇۋېتىش

# shortcut window
source: Back to overview
ug: ئىخچام كۆرۈنۈشكە قايت

# shortcut window
source: Fullscreen/Restore from fullscreen
ug: تولۇق ئېكران/تولۇق ئېكراندىن ئەسلىگە كەلتۈر

source: Keyboard Shortcuts
ug: ھەرپتاختا تېزلەتمىسى

source: Help
ug: ياردەم

source: About Boxes
ug: Boxes ھەققىدە

source: No CDROM/DVD image
ug: CDROM/DVD تەسۋىر يوق

source: Select
ug: تاللا

source: Remove
ug: چىقىرىۋەت

source: Devices & Shares
ug: ئۈسكۈنە ۋە ھەمبەھىر

source: USB Devices
ug: USB ئۈسكۈنە

source: CDROM/DVD Drive
ug: CDROM/DVD قوزغاتقۇچ

source: IP Address
ug: ‍IP ئادرېس

source: CPUs
ug: CPU

source: 3D acceleration
ug: ‪3D‬ تېزلىتىش

source: Allow running in background
ug: ئارقا سۇپىدا ئىجرا قىلىنىشىغا يول قويىدۇ

source: Configuration
ug: سەپلىمە

source: Troubleshooting Logs
ug: مەسىلە ھەل قىلىش خاتىرىسى

source: Diagnose problems with your box using the log file.
ug: خاتىرە ھۆججىتى ئارقىلىق box تىكى مەسىلىگە دىياگنوز قويىدۇ.

source: Edit Configuration
ug: سەپلىمە تەھرىرلە

source: Edit the Libvirt domain configuration for this box.
ug: Box نىڭ Libvirt دائىرە ئىسمى سەپلىمىسىنى تەھرىرلەيدۇ.

source: Local Folder
ug: يەرلىك قىسقۇچ

source: Select Shared Folder
ug: ھەمبەھىر قىسقۇچ تاللىنىدۇ

source: Save
ug: ساقلا

source: Shared Folders
ug: ھەمبەھىرلەنگەن قىسقۇچ

source: Revert to snapshot
ug: تېز پەيتكە ئەسلىگە قايتۇر

source: Rename snapshot
ug: تېز پەيت ئاتىنى ئۆزگەرت

source: Delete snapshot
ug: تېز پەيتنى ئۆچۈر

source: Snapshots
ug: كەسمە سۈرەت

source: Creating new snapshot…
ug: يېڭى كەسمە سۈرەت قۇرۇۋاتىدۇ…

source: Search for a virtual machine…
ug: مەۋھۇم ماشىنا ئىزدە…

source: Undo
ug: يېنىۋال

source: Oops, something went wrong
ug: ئاپلا، خاتالىق كۆرۈلدى

source: Boxes cannot access the virtualization backend.
ug: Boxes مەۋھۇملاشتۇرۇلغان ئارقا ئۇچنى زىيارەت قىلالمايدۇ.

source: Welcome Tutorial
ug: دەرسلىككە خۇش كەپسىز

source: Boxes makes it easy to install and run virtual machines.
ug: Boxes مەۋھۇم ماشىنىنى ئورنىتىش ۋە ئىجرا قىلىشنى ئاسانلاشتۇرىدۇ.

source: With express installation, Boxes will set the install options for a new virtual machine. Just start the installation and everything will be taken care of for you.
ug: تېز ئورنىتىشتا، Boxes يېڭى مەۋھۇم ماشىنىغا ئورنىتىش تاللانمىسى تەڭشەيدۇ. ئورنىتىش باشلانسىلا، پىروگرامما قالغان ھەممە ئىشنى ئۆزى قىلىدۇ.

source: Easy Downloads
ug: ئاسان چۈشۈرۈش

source: With Boxes, you don't need to download an operating system to create a virtual machine. Instead, just pick the operating system you want to setup, and Boxes will automatically download it for you.
ug: Boxes تا مەۋھۇم كومپيۇتېر قۇرۇشتا مەشغۇلات سىستېمىسىنى چۈشۈرۈش ھاجەتسىز. ئۇنىڭ ئورنىغا ئورناتماقچى بولغان مەشغۇلات سىستېمىسى تاللانسا، Boxes ئۆزلۈكىدىن چۈشۈرىدۇ.

source: Drag and Drop
ug: سۆرەپ تاشلاش

source: Sharing files is as simple as dropping them onto your virtual machine. They will appear in your Downloads folder.
ug: ھۆججەت ھەمبەھىرلەش ئۇلارنى مەۋھۇم كومپيۇتېرغا سۆرەپ تاشلىغاندەكلا ئاددىي. ئۇلار چۈشۈرۈش مۇندەرىجىسىدە كۆرۈنىدۇ.

source: Box actions
ug: Box مەشغۇلاتى

source: Open in New Window
ug: يېڭى كۆزنەكتە ئاچ

source: Send File…
ug: ھۆججەت يوللا…

source: Take Screenshot
ug: ئېكران كۆرۈنۈشى تۇت

source: Force Shutdown
ug: مەجبۇرىي تاقا

source: Clone
ug: كۆپەيت

source: Delete
ug: ئۆچۈر

source: Restart
ug: قايتا قوزغات

source: Preferences
ug: مايىللىق

source: Screenshots
ug: ئېكران كۆرۈنۈشى

source: Screenshot from %s
ug: %s دىن ئېلىنغان ئېكران كۆرۈنۈشى

source: translator-credits
ug: تەرجىمان تۆھپىسى Gheyret Kenji <gheyret@gmail.com> Sahran<sahran@live.com> Muhemmed Erdem <misran_erdem@hotmail.com> ئابدۇقادىر ئابلىز <sahranbay@gmail.com>

source: A simple GNOME application to access virtual systems
ug: مەۋھۇم سىستېمىنى زىيارەت قىلىشقا ئىشلىتىدىغان ئاددىي GNOME پىروگراممىسى

source: Display version number
ug: نەشر ئۇچۇرىنى كۆرسەت

source: Show help
ug: ياردەمنى كۆرسەت

source: Open in full screen
ug: پۈتۈن ئېكراندا ئاچ

source: Check virtualization capabilities
ug: مەۋھۇملاشتۇرۇش ئىقتىدارىنى تەكشۈر

source: Open box with UUID
ug: قۇتىنى UUID بىلەن ئاچ

source: Search term
ug: ئىزدەش تۈرى

source: URL to display, broker or installer media
ug: كۆرسىتىش، مەۋھۇم كومپيۇتېر باشقۇرغۇچ ياكى ئورنىتىش ۋاسىتىسىنىڭ تور ئادرېسى

source: — A simple application to access virtual machines
ug: — مەۋھۇم كومپيۇتېرنى زىيارەت قىلىدىغان ئاددىي پىروگرامما

source: Too many command line arguments specified.
ug: بۇيرۇق قۇرىدىكى پارامېتىر بەك كۆپ.

source: Box “%s” installed and ready to use
ug: Box «%s» ئورنىتىلدى ۋە ئىشلىتىشكە تەييار

source: Launch
ug: قوزغات

source: “%s“ is running in the background
ug: «%s» ئارقا سۇپىدا ئىجرا قىلىنىۋاتىدۇ

source: Box “%s” has been deleted
ug: Box «%s» ئۆچۈرۈلگەن

source: %u box has been deleted
ug: %u Box ئۆچۈرۈلگەن

source: Boxes is doing something
ug: Box مەشغۇلات قىلىۋاتىدۇ

source: Select files to transfer
ug: يوللايدىغان ھۆججەت تاللىنىدۇ

source: _Cancel
ug: ۋاز كەچ(_C)

source: _Open
ug: ئاچ(_O)

source: Failed to prepare express installation: %s
ug: تېز ئورنىتىشنى تەييارلىيالمىدى: %s

source: Live
ug: بىۋاسىتە

source: 32-bit x86 system
ug: 32 بىتلىق x‫86‬ سىستېمىسى

source: 64-bit x86 system
ug: 64 بىتلىق ‪x86‬ سىستېمىسى

source: from %s
ug: %s دىن

source: Select a device or OS media file
ug: ئۈسكۈنە ياكى مەشغۇلات سىستېما ۋاسىتە ھۆججىتى تاللىنىدۇ

source: Open
ug: ئاچ

source: Press (left) Ctrl+Alt to ungrab
ug: (سول) Ctrl+Alt بېسىلسا قويۇپ بېرىدۇ

source: Press & release (left) Ctrl+Alt to ungrab keyboard.
ug: ھەرپتاختىنى قويۇپ بېرىشتە (سول) Ctrl+Alt بېسىلىپ ۋە قويۇۋېتىلىدۇ.

source: Exit fullscreen
ug: تولۇق ئېكراندىن چېكىن

source: Downloading media
ug: ۋاسىتە چۈشۈرۈۋاتىدۇ

source: “%s” download complete
ug: «%s» نى چۈشۈرۈش تامام

source: Install
ug: ئورنات

source: Failed to download: %s
ug: چۈشۈرەلمىدى: %s

source: Failed to download '%s': %s
ug: «%s» نى چۈشۈرەلمىدى: %s

source: Send key combinations
ug: بىرىكمە كۇنۇپكا يوللايدۇ

source: Restoring %s from disk
ug: دىسكىدىن %s نى ئەسلىگە كەلتۈرۈۋاتىدۇ

source: Starting %s
ug: قوزغىلىۋاتقىنى %s

source: Restart of “%s” is taking too long. Force it to shutdown?
ug: «%s» نى قايتا قوزغىتىشقا بەك كۆپ ۋاقىت كەتتى. مەجبۇرىي تاقىسۇنمۇ؟

source: Shutdown
ug: تاقا

source: Cloning “%s”…
ug: «%s» نى نۇسخىلاۋاتىدۇ…

source: Installing…
ug: ئورنىتىۋاتىدۇ…

source: Setting up clone…
ug: نۇسخىنى تەڭشەۋاتىدۇ…

source: Importing…
ug: ئەكىرىۋاتىدۇ…

source: Running
ug: ئىجرا قىلىنىۋاتىدۇ

source: Paused
ug: ۋاقىتلىق توختىدى

source: Powered Off
ug: توكنى ئۈزدى

source: Connecting to %s
ug: %s غا باغلىنىۋاتىدۇ

source: Connection to “%s” failed
ug: «%s» غا باغلىنالمىدى

source: Machine is under construction
ug: مەۋھۇم ماشىنىنى تەييارلاۋاتىدۇ

source: Saving…
ug: ساقلاۋاتىدۇ…

source: “%s” could not be restored from disk: %s
ug: «%s» نى دىسكىدىن ئەسلىگە كەلتۈرگىلى بولمىدى: %s

source: Failed to start “%s”
ug: «%s» نى قوزغىتالمىدى

source: Troubleshooting Log
ug: مەسىلە ھەل قىلىش خاتىرىسى

source: Connection to “%s” failed: %s
ug: «%s» غا باغلىنالمىدى: %s

source: • The CPU is capable of virtualization: %s
ug: • مەزكۇر CPU نىڭ مەۋھۇملاشتۇرۇش ئىقتىدارى بار ئىكەن: %s

source: • The KVM module is loaded: %s
ug: • KVM بۆلىكى يۈكلەندى: %s

source: • Libvirt KVM guest available: %s
ug: • Libvirt KVM مېھماننى ئىشلەتكىلى بولىدۇ: %s

source: • Boxes storage pool available: %s
ug: • Boxes ساقلىغۇچ كۆلچىكىنى ئىشلەتكىلى بولىدۇ: %s

source: • The SELinux context is default: %s
ug: • SELinux مەزمۇنى كۆڭۈلدىكى قىلىپ بەلگىلەنگەن: %s

source: Report bugs to <%s>.
ug: كەمتۈكنى <%s> غا مەلۇم قىلىڭ.

source: %s home page: <%s>.
ug: %s باش بېتى: <%s>.

source: Media is not supported
ug: ۋاسىتىنى قوللىمايدۇ

source: No CD/DVD image
ug: CD/DVD تەسۋىرى يوق

source: Select a device or ISO file
ug: ئۈسكۈنە ياكى ISO ھۆججىتى تاللىنىدۇ

source: The Flatpak version of GNOME Boxes does not support USB redirection.
ug: GNOME Boxes نىڭ Flatpak نەشرى USB قايتا نىشانلاشنى قوللىمايدۇ.

source: Turn on your box to see the USB devices available for redirection.
ug: Box نى قوزغىتىپ قايتا نىشانلاشقا ئىشلىتىدىغان USB ئۈسكۈنىنى كۆرگىلى بولىدۇ.

source: Recommended %s.
ug: %s تەۋسىيە قىلىنغان.

source: Boxes wants to run VM in background
ug: Box ئارقا سۇپىدا مەۋھۇم كومپيۇتېرنى ئىجرا قىلماقچى

source: Boxes is not authorized to run in background
ug: Box نىڭ ئارقا سۇپىدا ئىجرا قىلىنىشىغا ئىجازەت بېرىلمىگەن

source: Do you want to open Settings to manage application permissions?
ug: تەڭشەكنى ئېچىپ پىروگرامما ئىجازىتىنى باشقۇرامسىز؟

source: Editing your box configuration can cause issues to the operating system of your box. Would you like to create a snapshot to recover from your changes?
ug: Box سەپلىمىسى تەھرىرلەنسە ئىچىدىكى مەشغۇلات سىستېمىسىدا مەسىلە كۆرۈلۈشى مۇمكىن. تېز پەيت قۇرۇپ ئۆزگەرتىشىڭىزدىن ئەسلىگە كەلتۈرەمسىز؟

source: Failed to save domain configuration: %s
ug: دائىرە سەپلىمىسىنى ساقلىيالمىدى: %s

source: Changes to the settings below take effect after you restart your box.
ug: تۆۋەندىكى تەڭشەكنىڭ ئۆزگىرىشى Box نى قايتا قوزغاتقاندىن كېيىن كۈچكە ئىگە بولىدۇ.

source: Use the button below to add your first shared folder. For file sharing to work, the guest box needs to have <a href='%s'>spice-webdav</a> installed.
ug: تۆۋەندىكى توپچىنى ئىشلىتىپ تۇنجى ھەمبەھىر قىسقۇچنى قوشۇڭ. ھۆججەت ھەمبەھىرنىڭ ئىشلىشى ئۈچۈن، خېرىدار كومپيۇتېر Box قا <a href='%s'>spice-webdav</a> ئورنىتىلىشى كېرەك.

source: Failed to rename snapshot: %s
ug: تېز پەيتنىڭ ئاتىنى ئۆزگەرتەلمىدى: %s

source: Reverting to %s…
ug: %s غا ئەسلىگە كەلتۈرۈۋاتىدۇ…

source: Failed to revert to snapshot: %s
ug: تېز پەيتكە ئەسلىگە كەلتۈرەلمىدى: %s

source: Snapshot “%s” deleted.
ug: تېز پەيت «%s» ئۆچۈرۈلدى.

source: Failed to create snapshot of %s
ug: %s غا تېز پەيت قۇرالمىدى

source: Revert to a previous state of your box.
ug: Box نىڭ ئالدىنقى ھالىتىگە ئەسلىگە كەلتۈرىدۇ.

source: Use the button below to create your first snapshot.
ug: تۆۋەندىكى توپچىنى ئىشلىتىپ تۇنجى تېز پەيتنى قۇرغىلى بولىدۇ.

source: Used %s.
ug: %s نى ئىشلەتكەن.

source: There is not enough space on your machine to increase the maximum disk size.
ug: مەۋھۇم كومپيۇتېرنىڭ ئەڭ چوڭ دىسكا بوشلۇقىنى ئاشۇرۇش ئۈچۈن يېتەرلىك دىسكا بوشلۇقى يوق.

source: Storage disk
ug: ساقلاش دىسكىسى

source: Used %s
ug: %s ئىشلەتكەن

source: Unknown
ug: يوچۇن

source: Redirection of USB device “%s” for “%s” failed
ug: USB ئۈسكۈنىسى «%s» نى «%s» غا قايتا نىشانلىيالمىدى

source: Copying “%s” to “Downloads”
ug: «%s» نى «چۈشۈرۈش» كە كۆچۈرۈۋاتىدۇ

source: An error occurred during installation preparation. Express Install disabled.
ug: ئورنىتىشقا تەييارلىق قىلىۋاتقاندا خاتالىق كۆرۈلدى. «تېز ئورنىتىش» ئىناۋەتسىز قىلىندى.

source: Downloading device drivers…
ug: ئۈسكۈنە قوزغاتقۇلىرىنى چۈشۈرۈۋاتىدۇ…

source: Your SELinux context looks incorrect, you can try to fix it by running: %s
ug: نۆۋەتتىكى SELinux نىڭ مەزمۇنى توغرا ئەمەستەك قىلىدۇ. شۇڭا تۆۋەندىكى بۇيرۇقنى ئىجرا قىلىپ تۈزىتىڭ: %s

source: SELinux not installed?
ug: SELinux ئورنىتىلمىغانمۇ؟

source: Could not get “gnome-boxes” storage pool information from libvirt. Make sure “virsh -c qemu:///session pool-dumpxml gnome-boxes” is working.
ug: بۆلەك libvirt تىن «gnome-boxes» ساقلىغۇچ كۆلچىكى ئۇچۇرىغا ئېرىشەلمىدى. شۇڭا ھازىر «virsh -c qemu:///session pool-dumpxml gnome-boxes» ئىشلەۋاتامدۇ تەكشۈرۈڭ.

source: %s is known to libvirt as GNOME Boxes’s storage pool but this directory does not exist
ug: ھازىر %s نى libvirt دىكى GNOME Boxes نىڭ ساقلىغۇچ كۆلچىكى دەپ بىلىدۇ، بىراق مەزكۇر مۇندەرىجە مەۋجۇت ئەمەس ئىكەن.

source: %s is known to libvirt as GNOME Boxes’s storage pool but is not a directory
ug: ھازىر %s نى libvirt دىكى GNOME Boxes نىڭ ساقلىغۇچ كۆلچىكى دەپ بىلىدۇ، بىراق ئۇ مۇندەرىجە ئەمەس

source: %s is known to libvirt as GNOME Boxes’s storage pool but is not user-readable/writable
ug: ھازىر %s نى libvirt دىكى GNOME Boxes نىڭ ساقلىغۇچ كۆلچىكى دەپ بىلىدۇ، بىراق ئىشلەتكۈچى ئۇنىڭغا ئوقۇپ يازالمايدۇ

source: yes
ug: ھەئە

source: no
ug: ياق

source: Incapable host system
ug: ناباب كومپيۇتېر سىستېمىسى

source: Box import from file “%s” failed: %s
ug: Box ھۆججەت «%s» تىن ئەكىرەلمىدى: %s
