Repository: hekimoghlu/OpenSystem
Catalog: src/*/yelp-xsl/doc/yelp-xsl/*/*.po
Languages: de

source: Templates
de: Vorlagen

source: Index of XSLT Templates
de: Index der XSLT-Vorlagen

source: Stylesheets
de: Stilvorlagen

source: Index of XSLT Stylesheets
de: Index der XSLT-Stilvorlagen

source: Parameters
de: Parameter

source: Index of XSLT Parameters
de: Index der XSLT-Parameter

source: Yelp XSLT Stylesheets
de: Yelp XSLT-Stilvorlagen

source: Modes
de: Modi

source: Index of XSLT Modes
de: Index der XSLT-Modi

source: translator-credits
de: Mario Blättermann <mariobl@freenet.de>, 2009, 2011
