Repository: hekimoghlu/OpenSystem
Catalog: src/*/evolution-etesync/po/*.po
Languages: sk

source: For accessing EteSync servers using EteSync C API
sk: Na prístup k serverom služby EteSync použitím rozhrania API Etesync C.

source: Item not found
sk: Položka sa nenašla

source: EteSync secret not found
sk: Tajomstvo služby EteSync sa nenašlo

source: Failed to obtain access token for account “%s”
sk: Zlyhalo získanie prístupového tokenu pre účet „%s“

source: EteSync account authentication request
sk: Požiadavka na overenie totožnosti účtu služby EteSync

source: Please enter the correct credentials for account “%s”.
sk: Prosím, zadajte správne poverenia pre účet „%s“.

source: (host: %s)
sk: (hostiteľ: %s)

source: _Cancel
sk: _Zrušiť

source: _User Name:
sk: Meno po_užívateľa:

source: _Password:
sk: _Heslo:

source: _Add this password to your keyring
sk: _Pridať toto heslo do vašej kľúčenky

source: Credentials not found
sk: Poverenia sa nenašli

source: Look up for an EteSync account
sk: Hľadanie účtu služby EteSync

source: EteSync account
sk: Účet služby EteSync

source: EteSync end-to-end encrypts your contacts, calendars, memos and tasks.
sk: Služba EteSync šifruje spôsobom end-to-end vaše kontakty, kalendáre, poznámky a úlohy.

source: Etebase server not found.
sk: Server Etebase sa nenašiel.

source: Failed connecting to server.
sk: Zlyhalo pripájanie k serveru.

source: Requires password to continue.
sk: Na pokračovanie sa vyžaduje heslo.

source: Malformed server name, please make sure to enter a full url (e.g https://etesync.example.com).
sk: Poškodený názov servera. Prosím, uistite sa, že ste zadali celý odkaz URL (napr. https://etesync.priklad.sk).
