Repository: hekimoghlu/OpenSystem
Catalog: src/*/gnome-music/po/*.po
Languages: kab

source: Music
kab: Aẓawan

source: Play and organize your music collection
kab: Γeṛ neɣ suddes tafrayt-ik n uẓawan

source: An easy and pleasant way to play your music.
kab: D abrid fessusen, yessedhayen i tɣuri n uẓawan.

source: Find tracks in your local collection, use automatically generated playlists or curate a fresh one.
kab: Af tubbiyin deg tefrayt-ik tadigant, seqdec taggayin yettusirwen s wudem awurman neɣ rnu tamaynut.

source: The GNOME Music developers
kab: Ineflayen n uẓawan GNOME

source: Music Player
kab: Ameɣri n uẓawan

source: Music;Player;
kab: Aẓawan;Ameɣri;

source: Window size
kab: Teɣzi n usfaylu

source: Window size (width and height).
kab: Teɣzi n usfaylu (tehri d teɣzi).

source: Window maximized
kab: Asfaylu meqqren

source: Window maximized state.
kab: Addad n usfaylu meqqren.

source: Playback repeat mode
kab: Askar n wallus tɣuri

source: Value identifies whether to repeat or randomize playback through the collection. Allowed values are: “none” (repeat and shuffle are off), “song” (repeat current song), “all” (repeat playlist, no shuffle), “shuffle” (shuffle playlist, presumes repeat all).
kab: Azal yesbaduy ma yella ad yili wallus neɣ taɣuri tagacurant deg taggayt. Azalen yettusirgen d: "ulac" (allus d tɣuri tagacurant nsan), "tizlit" (ales i tezlit tamirant), "akk" (ales i taggayt, ulac taɣuri tagacurant), "tagacurant"(taɣuri tagacurant n taggayt, dmu allus n kullec).

source: Enable ReplayGain
kab: Rmed ReplayGain

source: Enables or disables ReplayGain for albums
kab: Iremmed neɣ isnusuy ReplayGain seg walbumen

source: Inhibit system suspend
kab: Agi anegzum n unagraw

source: Enables or disables inhibiting system suspend while playing music
kab: Iremmed neɣ isnusuy anegzum n unagraw mi ara d-yeqqar aẓawan

source: Albums
kab: Albumen

source: Play
kab: Taɣuri

source: _Play
kab: _Urar

source: Add to _Favorite Songs
kab: Rnu ɣer _Tizlatin i ḥemmleɣ

source: _Add to Playlist…
kab: _Rnu ɣer taggayt…

source: Artists
kab: Inaẓuren

source: Menu
kab: Umuɣ

source: Search
kab: Nadi

source: Preferences
kab: Isemenyifen

source: Keyboard Shortcuts
kab: Inegzumen n unasiw

source: Help
kab: Tallalt

source: About Music
kab: Γef uẓawan

# shortcut window
source: General
kab: Amatu

# shortcut window
source: Close window
kab: Mdel asfaylu

# shortcut window
source: Search
kab: Nadi

# shortcut window
source: Help
kab: Tallalt

# shortcut window
source: Shortcuts
kab: Inegzumen

# shortcut window
source: Playback
kab: Taɣuri

# shortcut window
source: Play/Pause
kab: Ɣer/Bedd

# shortcut window
source: Next song
kab: Tizlit tuḍfirt

# shortcut window
source: Previous song
kab: Tizlit tudfirt

# shortcut window
source: Toggle repeat
kab: Uɣal ɣer wallus

# shortcut window
source: Toggle shuffle
kab: Rmed taɣuri tagacurant

# shortcut window
source: Navigation
kab: Tunigin

# shortcut window
source: Go to Albums
kab: Ddu ɣer walbumen

# shortcut window
source: Go to Artists
kab: Ddu ɣer yinaẓuren

# shortcut window
source: Go to Songs
kab: Ddu ɣer tezlatin

# shortcut window
source: Go to Playlists
kab: Ddu ɣer taggayin

# shortcut window
source: Go back
kab: Uɣal ɣer deffir

source: Previous
kab: Udfir

source: Next
kab: Uḍfir

source: _Delete
kab: _Kkes

source: _Rename…
kab: _Beddel isem…

source: Playlist Name
kab: Isem n taggayt

source: _Done
kab: _Immed

source: Add to Playlist
kab: Rnu taggayt

source: _Cancel
kab: _Sefsex

source: _Add
kab: _Rnu

source: Enter a name for your first playlist
kab: Sekcem isem i taggayt-ik tamezwarut

source: C_reate
kab: Snulfu-d (_R)

source: New Playlist…
kab: Taggayt tamaynut…

source: Add
kab: Rnu

source: Player Settings
kab: Iɣewwaren n umeɣri

source: Repeat Mode
kab: Askar n wallus

source: None
kab: Ula yiwen

source: Song
kab: Tizlit

source: All
kab: Akk

source: Shuffle
kab: Sexleḍ

source: Balance loudness between songs if ReplayGain metadata is found
kab: Seεdel ableɣ gar tezlatin ma yella aɣefisefka ReplayGain ttwafen

source: Power Settings
kab: Iɣewwaren usečči

source: Inhibit Suspend
kab: Agi anegzum

source: Only while playing
kab: Slid lawan n tɣuri

source: View All
kab: Beqqeḍ kulec

source: Songs
kab: Tizlatin

source: _Remove from Playlist
kab: _Kkes seg taggayt

source: Welcome to Music
kab: Ansuf ɣer uẓawan

source: The GNOME Project
kab: Asenfar n GNOME

source: translator-credits
kab: amsuqqel-isemdan

source: © The GNOME Music Developers
kab: © Ineflayen n uẓawan GNOME

source: Most Played
kab: Tid yettwaɣran s waṭas

source: Never Played
kab: Urǧin tettwaɣra

source: Recently Played
kab: Tettwaɣra melmi kan

source: Recently Added
kab: Tettwarna melmi kan

source: Favorite Songs
kab: Tizlatin i ḥemmleɣ

source: Insufficiently Tagged
kab: Ur tettwacreḍ ara s tudet

source: Unable to play the file
kab: Yegguma ad iɣer afaylu

source: _Find in {}
kab: _Af deg {}

source: and
kab: akked

source: {} is required to play the file, but is not installed.
kab: {} yesra ad d-iɣer afaylu, maca ur yebdid ara.

source: Playing music
kab: Taɣuri n uẓawan

source: Shuffle/Repeat Off
kab: Seḥbes/Ales

source: Repeat Song
kab: Ales i tezlit

source: Repeat All
kab: Ales kullec

source: Playlist {} removed
kab: Taggayt {} tettwakkes

source: Undo
kab: Semmet

source: {} removed from {}
kab: {} tettwakkes seg {}

source: Unknown album
kab: Album arussin

source: Unknown Artist
kab: Anaẓur arussin

source: Playlists
kab: Taggayin

source: No Search Started
kab: Ulac anadi i yebdan

source: Use the searchbar to start searching for albums, artists or songs
kab: Seqdec afeggag n unadi i wakken ad tebduḍ anadi ɣef walbumen, inaẓuren d tezlatin

source: No Results Found
kab: Ulac igmad i yettwafen

source: Try a different search
kab: Ɛreḍ inadiyen yemgaraden

source: {} minute
kab: {} tasint

source: Disc {}
kab: Aḍebsi {}

source: Pause
kab: Seḥbes

source: {} Song
kab: {} tezlit

source: Search songs, artists and albums
kab: Nadi tizlatin, inaẓuren akked walbumen

source: _Open Location
kab: _Ldi adig

source: Unstar
kab: Kkes itri

source: Star
kab: Itri

source: Your XDG Music directory is not set.
kab: Akaram-ikn uẓawan XDG ur yettusbadu ara.

source: Music Folder
kab: Akaram n uẓawan

source: The contents of your {} will appear here.
kab: Igburen n {} inek ad d-iban dagi.

source: No Music Found
kab: Ulac aẓawan i yettwafen

source: Try a Different Search
kab: Ԑreḍ anadi niḍen

source: GNOME Music could not connect to Tracker.
kab: Aẓawan GNOME ur yezmir ara ad iqqen ɣer Tracker.

source: Your music files cannot be indexed without Tracker running.
kab: Ifuyla n uẓawan ur zmiren ara ad smitren war aselkem n Tracker.

source: Your system Tracker version seems outdated.
kab: Lqem n unagraw-ik n Tracker yettban d agbur.

source: Music needs Tracker version 3.0.0 or higher.
kab: Aẓawan yesra lqem Tracker 3.0.0 n Tracker neɣ ugar.
