Repository: hekimoghlu/OpenSystem
Catalog: src/*/libsoup/po/*.po
Languages: kab

source: Network stream unexpectedly closed
kab: Asuddem n uzeṭṭa s wudem ur yettwarǧan ara

source: Failed to completely cache the resource
kab: Yecceḍ uḥraz n uɣbalu s wudem yemmden

source: Output buffer is too small
kab: Aḥraz n unekcum d amecṭuḥ aṭas

source: Connection terminated unexpectedly
kab: Tekfa tuqqna s ubrid ur yettwarǧan ara

source: Invalid seek request
kab: Assuter n unadi d arameɣtu

source: Cannot truncate SoupBodyInputStream
kab: Ur yezmir ara ad yegzem SoupBodyInputStream

source: Operation would block
kab: TAmhelt ad tessewḥel

source: Could not parse HTTP response
kab: D awezɣi ad tettwasleḍ tririt HTTP

source: Unrecognized HTTP response encoding
kab: Asettengel n tririt HTTP ur yettwassen ara

source: Operation was cancelled
kab: Tamhelt tettwasefsex

source: Header too big
kab: Aqerru meqqer aṭas

source: Could not import existing socket:
kab: Yegguma ad yekter socket i yellan:

source: Can’t import unconnected socket
kab: Ur yezmir ara ad d-yekter socket ur neqqin ara

source: Can’t create a TLS server without a TLS certificate
kab: Ur yezmir ara ad yernu aqeddac TLS mebla aselkin TLS

source: Location header is missing or empty in response headers
kab: Aqerru n wadig ixuṣṣ neɣ d ilem deg yiqerra n tririyin

source: Invalid URI “%s” in Location response header
kab: URI "%s" d arameɣtu deg uqerru n tririt n wadig

source: Too many redirects
kab: Aṭas n ubeddel deg tnilwin

source: Message was restarted too many times
kab: Izen yettwasenker aṭas n tikkal

source: Message is already in session queue
kab: Izen yella yakan deg udras n tɣimit

source: The server did not accept the WebSocket handshake.
kab: Aqeddac ur iqebbel ara afus n WebSocket.

source: No public-suffix list available.
kab: Ulac tabdart n wuzwiren tazayazt i yellan.

source: Invalid hostname
kab: Isem asenneftaɣ d arameɣtu

source: Hostname is an IP address
kab: Asezdeɣ n yisem d tansa IP

source: Hostname has no base domain
kab: Asezdeɣ n yisem ur yesεi ara taɣult n taffa

source: Not enough domains
kab: Ulac ddeqs n talɣutin

source: Server requested unsupported extension
kab: Aqeddac yessuter asiɣzef ur yettusefraken ara

source: Incorrect WebSocket “%s” header
kab: Aqerru WebSocket "%s" d arameɣtu

source: Server returned incorrect “%s” key
kab: Aqeddac yerra-d tasarut "%s" d tarameɣtut

source: Duplicated parameter in “%s” WebSocket extension header
kab: Aɣawwar yettwasleg deg uqerru n usiɣzef WebSocket "%s"

source: Server returned a duplicated parameter in “%s” WebSocket extension header
kab: Aqeddac yerra-d aɣawwar yettwaselgen deg uqerru n usiɣzef WebSocket "%s"

source: WebSocket handshake expected
kab: Afus n WebSocket yetturaǧu

source: Unsupported WebSocket version
kab: Lqem WebSocket ur yettusefraken ara

source: Invalid WebSocket key
kab: Tasarut WebSocket d tarameɣtut

source: Unsupported WebSocket subprotocol
kab: Aneggaf arnaw n WebSocket ur yettwasefrak ara

source: Server rejected WebSocket handshake
kab: Aqeddac yugi afus n WebSocket

source: Server ignored WebSocket handshake
kab: Aqeddac yunef i ufus n WebSocket

source: Server requested unsupported protocol
kab: Aneggaf ur yettusefraken ara yesra-t uqeddac
