Repository: hekimoghlu/OpenSystem
Catalog: src/*/folks/po/*.po
Languages: ug

source: No BlueZ 5 object manager running, so the BlueZ backend will be inactive. Either your BlueZ installation is too old (only version 5 is supported) or the service can’t be started.
ug: ھېچقانداق BlueZ 5 جىسىم باشقۇرغۇچ ئىجرا قىلىنمايۋاتىدۇ شۇڭا BlueZ ئارقا ئۇچى پائالىيىتى توختىتىلىدۇ. سەۋەبى ئورنىتىلغان BlueZ بەك كونا (پەقەت 5 نەشرىنىلا قوللايدۇ) ياكى مۇلازىمەتنى قوزغىتالمايدۇ.

source: Error connecting to OBEX transfer daemon over D-Bus. Ensure BlueZ and obexd are installed.
ug: D-Bus ئارقىلىق OBEX يوللاش نازارەتچىسىگە باغلانغاندا خاتالىق كۆرۈلدى. BlueZ ۋە obexd نىڭ ئورنىتىلغانلىقىنى جەزملەڭ.

source: Error reading the transferred address book file: %s
ug: يوللانغان ئادرېس دەپتەر ھۆججىتىنى ئوقۇۋاتقاندا خاتالىق كۆرۈلدى: %s

source: Error during transfer of the address book ‘%s’ from Bluetooth device ‘%s’.
ug: كۆكچىش ئۈسكۈنىسى «%2$s» دىن ئادرېس دەپتىرى «%1$s» نى يەتكۈزۈۋاتقاندا خاتالىق كۆرۈلدى.

source: Permission to access the address book on Bluetooth device ‘%s’ was denied by the user.
ug: كۆكچىش ئۈسكۈنىسى «%s» دىكى ئادرېس دەپتىرىنى زىيارەت قىلغاندا ئىشلەتكۈچى رەت قىلدى.

source: An OBEX address book transfer from device ‘%s’ could not be started: %s
ug: «%s» ئۈسكۈنىدىن OBEX ئادرېس دەپتىرىنى يوللاشنى قوزغىتالمايدۇ: %s

source: The OBEX address book transfer from device ‘%s’ failed: %s
ug: «%s» ئۈسكۈنىدىن OBEX ئادرېس دەپتىرىنى يوللىيالمىدى: %s

source: Error during transfer of the address book from Bluetooth device ‘%s’: %s
ug: كۆكچىش ئۈسكۈنىسى «%s» دىن ئادرېس دەپتىرىنى يەتكۈزۈۋاتقاندا خاتالىق كۆرۈلدى: %s

source: Bluetooth device ‘%s’ disappeared during address book transfer.
ug: كۆكچىش ئۈسكۈنىسى «%s» ئادرېس دەپتىرىنى يوللاش جەريانىدا يوقاپ كاتتى.

source: Starred in Android
ug: Android تا يۇلتۇز قوشۇلغان

source: Address book ‘%s’ is offline, so contact ‘%s’ cannot be removed.
ug: ئادرېس دەپتىرى «%s» ھازىر توردا يوق، شۇڭا ئالاقەداش «%s» نى چىقىرىۋەتكىلى بولمايدۇ.

source: Permission denied to remove contact ‘%s’: %s
ug: ئالاقەداش «%s» نى چىقىرىۋېتىش ئىجازىتى يوق: %s

source: Removing contacts isn’t supported by this persona store: %s
ug: بۇ ئالاقە ئامبىرى ئالاقەداش چىقىرىۋېتىشنى قوللىمايدۇ: %s

source: Can’t remove contact ‘%s’: %s
ug: ئالاقەداش «%s» نى چىقىرىۋېتەلمەيدۇ: %s

source: Address book ‘%s’ is offline.
ug: ئادرېس دەپتىرى «%s» تورسىز.

source: Permission denied to open address book ‘%s’: %s
ug: ئادرېس دەپتىرى «%s» نى ئېچىشتا ئىجازەت رەت قىلىندى: %s

source: Couldn’t open address book ‘%s’: %s
ug: ئادرېس دەپتىرى «%s» نى ئاچالمايدۇ: %s

source: Couldn’t get address book capabilities: %s
ug: ئادرېس دەپتىرىنىڭ سىغىمىغا ئېرىشەلمەيدۇ: %s

source: Couldn’t get view for address book ‘%s’.
ug: ئادرېس دەپتىرى «%s» نىڭ كۆرۈنۈشىگە ئېرىشەلمەيدۇ.

source: Couldn’t get view for address book ‘%s’: %s
ug: ئادرېس دەپتىرى «%s» نىڭ كۆرۈنۈشىگە ئېرىشەلمەيدۇ: %s

source: Creating a new contact failed due to reaching the timeout.
ug: مۆھلەتتىن ئېشىپ كەتكەنلىكى ئۈچۈن يېڭى ئالاقەداش قۇرالمىدى.

source: Changing the ‘%s’ property failed due to reaching the timeout.
ug: مۆھلەتتىن ئېشىپ كەتكەنلىكى ئۈچۈن خاسلىق «%s» نى ئۆزگەرتەلمىدى.

source: Avatar is not writeable on this contact.
ug: سىمانى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Web service addresses are not writeable on this contact.
ug: تور مۇلازىمىتىنىڭ ئادرېسىنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: URLs are not writeable on this contact.
ug: تور ئادرېسىنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Local IDs are not writeable on this contact.
ug: يەرلىك كىملىكنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: The contact cannot be marked as favourite.
ug: بۇ ئالاقەداشقا ئامراق بەلگىسى قويۇشقا بولمىدى.

source: Can’t update avatar: %s
ug: سىمانى يېڭىلىيالمايدۇ: %s

source: E-mail addresses are not writeable on this contact.
ug: ئېلخەت ئادرېسنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Phone numbers are not writeable on this contact.
ug: تېلېفون نومۇرىنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Postal addresses are not writeable on this contact.
ug: پوچتا ئادرېسىنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Full name is not writeable on this contact.
ug: تولۇق ئاتنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Nickname is not writeable on this contact.
ug: تەخەللۇسنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Notes are not writeable on this contact.
ug: ئىزاھنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Birthday is not writeable on this contact.
ug: تۇغۇلغان كۈننى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Roles are not writeable on this contact.
ug: خىزمەتتىكى مەرتىۋىنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Structured name is not writeable on this contact.
ug: قۇرۇلمىلىق ئاتنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: IM addresses are not writeable on this contact.
ug: مۇڭداشقۇ ئادرېسىنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Groups are not writeable on this contact.
ug: گۇرۇپپىلارنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: My Contacts is only available for Google Contacts
ug: ئالاقەداشلىرىمنى پەقەت «گۇگىل ئالاقەداشلىرى» دىلا ئىشلەتكىلى بولىدۇ

source: Gender is not writeable on this contact.
ug: جىنسىنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Anti-links are not writeable on this contact.
ug: Anti-links نى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Location is not writeable on this contact.
ug: ئورۇننى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Permission denied when creating new contact: %s
ug: يېڭى ئالاقەداش قۇرۇۋاتقاندا ئىجازەت رەت قىلىندى: %s

source: Address book is offline and a new contact cannot be created: %s
ug: ئادرېس دەپتىرى تورسىز ھالەتتە بولغاچقا يېڭى ئالاقەداش قۇرالمايدۇ: %s

source: New contact is not writeable: %s
ug: يېڭى ئالاقەداشقا يازغىلى بولمايدۇ: %s

source: Invalid value in contact: %s
ug: ئالاقەداش ئۇچۇرىدا ئىناۋەتسىز قىممەت بار: %s

source: Unknown error adding contact: %s
ug: ئالاقەداش قوشۇۋاتقاندا يوچۇن خاتالىق كۆرۈلدى: %s

source: Property ‘%s’ is not writeable: %s
ug: خاسلىق «%s» نى يازغىلى بولمايدۇ: %s

source: Invalid value for property ‘%s’: %s
ug: خاسلىق «%s» نىڭ قىممىتى توغرا ئەمەس: %s

source: Unknown error setting property ‘%s’: %s
ug: خاسلىق «%s» نى تەڭشەۋاتقاندا نامەلۇم خاتالىق كۆرۈلدى: %s

source: The relationship key file ‘%s’ could not be loaded: %s
ug: مۇناسىۋەت ئاچقۇچ ھۆججىتى «%s» نى يۈكلىيەلمەيدۇ: %s

source: The relationship key file directory ‘%s’ could not be created: %s
ug: مۇناسىۋەت ئاچقۇچ ھۆججىتىڭ مۇندەرىجىسى «%s» نى قۇرغىلى بولمىدى: %s

source: The relationship key file ‘%s’ could not be created: %s
ug: مۇناسىۋەت ئاچقۇچ ھۆججىتى «%s» نى قۇرغىلى بولمىدى: %s

source: Could not write updated key file ‘%s’: %s
ug: يېڭىلانغان ئاچقۇچ ھۆججىتى «%s» نى يازغىلى بولمىدى: %s

source: Invalid IM address ‘%s’ for protocol ‘%s’: %s
ug: مۇڭداشقۇ ئادرېسى «%s» كېلىشىم «%s» غا نىسبەتەن توغرا ئەمەس: %s

source: Couldn’t load data from key file: %s
ug: ئاچقۇچ ھۆججىتىدىن سانلىق مەلۇماتنى يۈكلىيەلمەيدۇ: %s

source: No oFono object manager running, so the oFono backend will be inactive. Either oFono isn’t installed or the service can’t be started.
ug: ھېچقانداق oFono جىسىم باشقۇرغۇچ ئىجرا قىلىنمايۋاتىدۇ شۇڭا oFono ئارقا ئۇچى پائالىيىتى توختىتىلىدۇ. سەۋەبى oFono ئورنىتىلمىغان ياكى مۇلازىمەتنى قوزغىتالمايدۇ.

source: Telepathy contacts representing the local user may not be removed.
ug: يەرلىك ئىشلەتكۈچنىڭ Telepathy ھېساباتلىرىنى كۆرسىتىشنى ئۆچۈرگىلى بولمايدۇ.

source: Failed to remove a persona from store: %s
ug: ئامباردىن بىر persona نى چىقىرىۋېتەلمىدى: %s

source: Persona store (%s, %s) requires the following details: contact (provided: ‘%s’)
ug: Persona ئامبىرى (%s، %s) تۆۋەندىكى تەپسىلاتنى تەلەپ قىلدى: ئالاقەداش(تەمىنلەنگەن: «%s»)

source: Cannot create a new Telepathy contact while offline.
ug: تورسىز ھالەتتە يېڭى Telepathy ئالاقەداشنى قۇرغىلى بولمايدۇ.

source: Failed to add a persona from details: %s
ug: تەپسىلاتلاردىن بىر persona قوشۇش مەغلۇپ بولدى: %s

source: Failed to change favorite without a connection to the telepathy-logger service.
ug: مۇلازىمەت telepathy-logger غا باغلىنالمىغانلىقى ئۈچۈن، يىغقۇچنى ئۆزگەرتەلمىدى.

source: Failed to change favorite status of Telepathy Persona because it has no attached TpContact.
ug: قېتىلغان TpContact بولمىغانلىقى ئۈچۈن، Telepathy Persona نىڭ ئامراق ھالىتىنى ئۆزگەرتەلمىدى.

source: Failed to change favorite status for Telepathy contact ‘%s’.
ug: Telepathy ئالاقەداش «%s» نىڭ ئامراق ھالىتىنى ئۆزگەرتەلمىدى.

source: Failed to change contact’s alias: %s
ug: ئالاقەداشنىڭ تەخەللۇسىنى ئۆزگەرتەلمىدى: %s

source: Extended information may only be set on the user’s Telepathy contact.
ug: كېڭەيتىلگەن ئۇچۇرنى ئىشلەتكۈچىنىڭ Telepathy ئالاقەداشىغىلا تەڭشىگىلى بولىدۇ.

source: Extended information cannot be written because the store is disconnected.
ug: ئامبار بىلەن بولغان باغلىنىش ئۈزۈلگەنلىكى ئۈچۈن كېڭەيتىلگەن ئۇچۇرلارنى يازغىلى بولمايدۇ.

source: Failed to change group membership: %s
ug: گۇرۇپپىنىڭ ئەزالىقىنى ئۆزگەرتەلمىدى: %s

source: Account is offline.
ug: ھېسابات توردا يوق.

source: Alias is not writeable on this contact.
ug: لەقەمنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Error listing contents of folder ‘%s’: %s
ug: قىسقۇچ «%s» دىكى مەزمۇننى كۆرسىتىۋاتقاندا خاتالىق كۆرۈلدى: %s

source: Error querying info for target ‘%s’ of symlink ‘%s’: %s
ug: سىمۋوللۇق ئۇلانما «%2$s» نىڭ «%1$s» نىشانىنىڭ ئۇچۇرىنى سۈرۈشتۈرۈۋاتقاندا خاتالىق كۆرۈلدى: %3$s

source: File or directory ‘%s’ does not exist.
ug: ھۆججەت ياكى قىسقۇچ «%s» مەۋجۇت ئەمەس.

source: Failed to get content type for ‘%s’.
ug: «%s» نىڭ مەزمۇن تۈرىگە ئېرىشەلمىدى.

source: Birthday event ID is not writeable on this contact.
ug: تۇغۇلغان كۈن ھادىسە كىملىكىنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Extended fields are not writeable on this contact.
ug: كېڭەيتىلگەن بۆلەكنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: Favorite status is not writeable on this contact.
ug: ئامراق ھالەتنى بۇ ئالاقەداشقا يازغىلى بولمايدۇ.

source: The IM address ‘%s’ could not be understood.
ug: مۇڭداشقۇ ئادرېسى «%s» نى بىلگىلى بولمىدى.

source: Error preparing persona store ‘%s’: %s
ug: persona ئامبىرى «%s» نى تەييارلاۋاتقاندا خاتالىق كۆرۈلدى: %s

source: Unknown property ‘%s’ in linkable property list.
ug: نامەلۇم خاسلىق «%s» ئۇلىنىشچان خاسلىق تىزىمىدا بار.

source: Failed to add contact for persona store ID ‘%s’: %s
ug: persona ئامبار كىملىكى «%s» نى ئالاقەداشقا قوشالمىدى: %s

source: Anti-links can’t be removed between personas being linked.
ug: ئۇلانغان persona ئارىسىدا Anti-links نى ئۆچۈرگىلى بولمايدۇ.

source: Can’t add personas with no primary store.
ug: دەسلەپكى دۇكىنى بولمىغان persona لارنى قوشقىلى بولمايدۇ.

source: Persona store ‘%s:%s’ is configured as primary, but could not be found or failed to load.
ug: دۇكان ‹%s:%s› دەسلەپكى دۇكان قىلىنىپ بەلگىلىنىپتىكەن، بىراق ئۇنى تاپقىلى ياكى ئوقۇغىلى بولمىدى.

source: Check the relevant service is running, or change the default store in that service or using the ‘%s’ GSettings key.
ug: مۇناسىۋەتلىك مۇلازىمەت ئىجرا بولۇۋېتىپتىمۇ تەكشۈرۈڭ. ياكى شۇ مۇلازىمەتتىكى كۆڭۈلدىكى دۇكاننى ئۆزگەرتىڭ. ياكى «%s» دېگەن GSettings ئاچقۇچىنى ئىشلىتىڭ.

source: Can’t write to requested property (‘%s’) of the writeable store.
ug: يازغىلى بولىدىغان ئامبارنىڭ ئىلتىماس قىلىنغان خاسلىقى («%s») غا يازغىلى بولمىدى.

source: Failed to change property ‘%s’: No suitable personas were found.
ug: خاسلىق «%s» نى ئۆزگەرتەلمىدى: مۇۋاپىق persona تېپىلمىدى.

source: Unnamed Person
ug: ئاتسىز ئادەم

source: Primary store ID
ug: ئاساسىي ئامبار كىملىكى

source: The ID of the persona store which folks should use as primary (i.e. to store linking data in). The type ID of the store may optionally be prepended, separated by a colon. For example: ‘eds:system-address-book’ or ‘key-file’.
ug: folks ئاساسىي (مەسىلەن، ئۇلانما سانلىق مەلۇماتىنى ساقلايدىغان ئامبار) ئامبار كىملىكى قىلىپ ئىشلىتىدىغان persona ئامبىرىنىڭ كىملىكى. ئالدىغا ئامبارنىڭ كىملىك تۈرىنى قوشۇشقا بولىدۇ، بۇ كىملىكىنى قوش چېكىت بىلەن ئايرىپ يېزىشقىمۇ بولىدۇ. مەسىلەن: «eds:system-address-book» ياكى «key-file» دېگەندەك.

source: Unknown status
ug: نامەلۇم ھالەت

source: Offline
ug: تورسىز

source: Error
ug: خاتالىق

source: Available
ug: ئىشلىتىلىشچان

source: Away
ug: يوق

source: Extended away
ug: ئۇزۇن مەزگىل يوق

source: Busy
ug: ئالدىراش

source: Hidden
ug: يوشۇرۇن

source: Title: %s, Organisation: %s, Role: %s
ug: ئەمىلى: %s، تەشكىلات: %s، ۋەزىپىسى: %s

source: File %s does not exist.
ug: ھۆججەت %s مەۋجۇت ئەمەس.

source: Failed to get information about file %s: %s
ug: ھۆججەت %s نىڭ ئۇچۇرىنى ئوقۇش مەغلۇپ بولدى: %s

source: File %s is not readable.
ug: ھۆججەت %s نى ئوقۇشقا بولمايدۇ.

source: The Pidgin buddy list file ‘%s’ could not be loaded.
ug: Pidgin بۇرادەرلىرى تىزىم ھۆججىتى «%s» نى يۈكلىيەلمىدى.

source: The Pidgin buddy list file ‘%s’ could not be loaded: the root element could not be found or was not recognized.
ug: Pidgin بۇرادەرلىرى تىزىم ھۆججىتى «%s» نى يۈكلىيەلمىدى: غول ئېلېمېنت تېپىلمىدى ياكى تونۇغىلى بولمىدى.

source: Imported %u buddy from ‘%s’.
ug: «%2$s» دىن %1$u‎‏ بۇرادەرنى ئەكىردى.

source: Error changing group of contact ‘%s’: %s
ug: ئالاقەداش «%s» نىڭ گۇرۇپپىسىنى ئۆزگەرتىشتە خاتالىق كۆرۈلدى: %s

source: Ignoring buddy with no alias and only one IM address: %s
ug: لەقىمى يوق ۋە بىرلا مۇڭداشقۇ ئادرېسى بار بۇرادەرلەرگە پەرۋا قىلمىدى: %s

source: Failed to create new contact for buddy with alias ‘%s’ and IM addresses: %s Error: %s
ug: لەقىمى «%s» بولغان يېڭى ئالاقەداش قۇرالمىدى. مۇڭداشقۇ ئادرېسلىرى: %s خاتالىق: %s

source: Created contact ‘%s’ for buddy with alias ‘%s’ and IM addresses: %s
ug: ئالاقەداش «%s» قۇرۇلدى. لەقىمى «%s» ۋە مۇڭداشقۇ ئادرېسلىرى: %s

source: Source backend name (default: ‘pidgin’)
ug: مەنبەنىڭ ئارقا ئۇچ ئاتى (كۆڭۈلدىكى: «pidgin»)

source: Source filename (default: specific to source backend)
ug: مەنبە ھۆججەت ئاتى (كۆڭۈلدىكى: مەنبە ئارقا ئۇچتا كۆرسىتىلىدۇ)

source: — import meta-contact information to libfolks
ug: — تەپسىلىي ئالاقە ئۇچۇرىنى libfolks دىن ئەكىرىدۇ

source: Couldn’t parse command line options: %s
ug: بۇيرۇق قۇرى تاللانمىسىنى تەھلىل قىلالمىدى: %s

source: Couldn’t load the backends: %s
ug: ئارقا ئۇچنى يۈكلىيەلمەيدۇ: %s

source: Couldn’t load the ‘%s’ backend.
ug: ئارقا ئۇچ «%s» نى يۈكلىيەلمەيدۇ.

source: Couldn’t prepare the ‘%s’ backend: %s
ug: ئارقا ئۇچ «%s» نى تەييار قىلغىلى بولمىدى: %s

source: Couldn’t load the ‘%s’ backend’s persona store.
ug: ئارقا ئۇچ «%s» نىڭ persona ئامبىرىنى يۈكلىيەلمەيدۇ.

source: Couldn’t prepare the ‘%s’ backend’s persona store: %s
ug: ئارقا ئۇچ «%s» نىڭ persona ئامبىرىنى تەييارلىيالمايدۇ: %s

source: Error importing contacts: %s
ug: ئالاقەداشلارنى ئىمپورت قىلىشتا خاتالىق كۆرۈلدى: %s

source: Unrecognized source backend name ‘%s’. ‘%s’ is currently the only supported source backend.
ug: مەنبەنىڭ ئارقا ئۇچ ئاتىنى «%s» نى بىلگىلى بولمىدى. نۆۋەتتە پەقەت «%s» ئارقا ئۇچنىلا قوللايدۇ.
