Repository: hekimoghlu/OpenSystem
Catalog: src/*/systemuserland-browser-extension/po/*.po
Languages: az, hi, ja, sl, uk, zh_tw

source: Close
az: Bağla
hi: बंद करे
ja: 閉じる
sl: Zapri
uk: Закрити
zh_tw: 關閉

source: Wrong connector response received
az: Yanlış birləşdirici cavabı alındı
hi: गलत कनेक्टर प्रतिक्रिया प्राप्त हुई
sl: Prejet je napačen odziv povezovalnika
uk: Отримано помилкову відповідь від засобу з'єднання
zh_tw: 接收到錯誤的介面回應

source: Enabled
az: Aktivdir
hi: सक्षम
ja: 有効
sl: Omogočeno
uk: Увімкнено
zh_tw: 已啟用

source: Installed
az: Quraşdırılıb
hi: स्थापित
ja: インストール
sl: Nameščeno
uk: Встановлено
zh_tw: 已安裝

source: Extension
az: Əlavə
hi: एक्सटेंशन
ja: 拡張機能
sl: Razširitev
uk: Розширення
zh_tw: 附加元件

source: must be downgraded
az: köhnələşdirilməlidir
hi: पदावनत किया जाना चाहिए
ja: はダウングレードされます
sl: je treba ponižati na starejšo različico.
uk: має бути повернуто до попередньої версії
zh_tw: 必須降級

source: can be upgraded
az: yenilənə bilər
hi: उन्नत किया जा सकता है
ja: はアップグレードできます
sl: je mogoče posodobiti.
uk: може бути оновлено
zh_tw: 可以升級

source: Synchronized
az: Sinxronlaşdırılıb
hi: समन्वयित
ja: 同期
sl: Usklajeno
uk: Синхронізовано
zh_tw: 已同步

source: GNOME Shell integration
az: GNOME Shell inteqrasiyası
hi: GNOME शैल एकीकरण
sl: Razširitev lupine GNOME
uk: Інтеграція із GNOME Shell
zh_tw: GNOME Shell 整合

source: hours
hi: घंटे
ja: 時間
zh_tw: 小時

source: This extension provides integration with GNOME Shell and the corresponding extensions repository https://extensions.gnome.org
az: Bu əlavə GNOME Shell ilə və müvafiq əlavələr anbarı https://extensions.gnome.org ilə inteqrasiyanı təmin edir
hi: यह एक्सटेंशन GNOME शैल और संबंधित एक्सटेंशन रिपॉजिटरी https://extensions.gnome.org के साथ एकीकरण प्रदान करता है
ja: GNOME Shell とその拡張機能リポジトリ https://extensions.gnome.org を統合するブラウザー拡張機能です
sl: Razširitev omogoča povezovanje z okoljem Lupine GNOME in ustrezno shrambo razširitev https://extensions.gnome.org
uk: Це розширення забезпечує інтеграцію між GNOME Shell та відповідним сховищем розширень https://extensions.gnome.org
zh_tw: 這個附加元件提供了與 GNOME Shell 的整合，和對應的附加元件庫 https://extensions.gnome.org

source: «$REQUEST$» native request failed
az: «$REQUEST$» yerli sorğu uğursuz oldu
hi: «$REQUEST$» मूल अनुरोध विफल रहा
sl: Izvorna zahteva «$REQUEST$» je spodletela
uk: Помилка під час спроби виконати запит щодо «$REQUEST$»
zh_tw: «$REQUEST$» 原生請求失敗

source: never
az: heç vaxt
hi: कभी नहीं
ja: しない
sl: nikoli
uk: ніколи
zh_tw: 永不

source: No
az: Xeyr
hi: नहीं
ja: いいえ
sl: Ne
uk: Ні
zh_tw: 否

source: Unable to locate GNOME Shell settings or version. Make sure it is installed and running.
az: GNOME Shell parametrləri və ya versiyası tapıla bilmədi. Onun quraşdırıldığından və işlədiyindən əmin olun.
hi: GNOME शैल सेटिंग्स या संस्करण का पता लगाने में असमर्थ। सुनिश्चित करें कि यह स्थापित है और चल रहा है।
sl: Ni mogoče najti nastavitev in podatkov različice okolja Lupine GNOME. Prepričajte se, da je lupina nameščena in zagnana.
uk: Не вдалося визначити параметри GNOME Shell або версію. Переконайтеся, що оболонку встановлено і запущено.
zh_tw: 無法取得 GNOME Shell 的設定或版本。確保其已經安裝且為執行狀態。

source: Although GNOME Shell integration extension is running, native host connector is not detected. Refer <a href='https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation'>documentation</a> for instructions about installing connector.
hi: हालांकि GNOME शैल एकीकरण एक्सटेंशन चल रहा है, लेकिन मूल होस्ट कनेक्टर का पता नहीं चला है। कनेक्टर स्थापित करने के बारे में निर्देशों के लिए <a href='https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation'>दस्तावेज़ीकरण</a> देखें।
ja: GNOME Shell integration 拡張機能は実行されているものの、ネイティブホストコネクタが検出されません。コネクタのインストール手順については<a href='https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation'>ドキュメント</a>を参照してください。
zh_tw: 雖然 GNOME Shell 整合附加元件為執行狀態，但未偵測到原生主機介面。請參考<a href='https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation'>文件</a>取得安裝介面的指引說明。

source: No host response
az: Ev sahibi cavabı yoxdur
hi: कोई होस्ट प्रतिक्रिया नहीं
ja: ホストの反応がありません
sl: Ni odziva gostitelja
uk: Немає відповіді від вузла
zh_tw: 無主機回應

source: Open GNOME Shell extensions website
az: GNOME Shell əlavələri veb-saytını aç
hi: GNOME शैल एक्सटेंशन वेबसाइट खोलें
ja: GNOME Shell 拡張機能のウェブサイトを開く
sl: Odprite spletišče razširitev Lupine GNOME
uk: Відкрити сайт розширень GNOME Shell
zh_tw: 開啟 GNOME Shell 附加元件網頁

source: Update check period
hi: अद्यतन जांच अवधि
ja: 更新確認間隔
zh_tw: 檢查更新週期

source: Last check
hi: अंतिम जांच
ja: 最終確認
zh_tw: 上次檢查

source: Options
az: Seçimlər
hi: विकल्प
ja: オプション
sl: Možnosti
uk: Параметри
zh_tw: 選項

source: Next check
hi: अगली जांच
ja: 次の確認
zh_tw: 下次檢查

source: Options saved.
az: Seçimlər saxlanıldı.
hi: विकल्प सहेजे गए।
ja: オプションを保存しました。
sl: Možnosti so shranjene.
uk: Параметри збережено.
zh_tw: 已儲存選項。

source: Show release notes when browser extension updated
az: Brauzer əlavəsi yenilənərkən buraxılış qeydlərini göstər
hi: ब्राउज़र एक्सटेंशन अद्यतन होने पर विज्ञप्ति टिप्पणी दिखाएं
ja: ブラウザー拡張機能の更新時にリリースノートを表示
sl: Pokaži opombe k izdaji ko je razširitev brskalnika posodobljena
uk: Показувати нотатки щодо випуску при оновленні розширень браузера
zh_tw: 當更新瀏覽器附加元件時顯示發布紀錄

source: Synchronize GNOME Shell extensions list
az: GNOME Shell əlavələr siyahısını sinxronlaşdır
hi: GNOME शैल एक्सटेंशन सूची को समन्वयित करें
ja: GNOME Shell 拡張機能一覧を同期
sl: Uskladi seznam razširitev lupine GNOME
uk: Синхронізувати список розширень GNOME Shell
zh_tw: 同步 GNOME Shell 附加元件列表

source: If enabled, your GNOME Shell extensions list will be synchronized with your Google account.
az: Aktiv edilərsə, GNOME Shell əlavələr siyahınız Google hesabınızla sinxronlaşdırılacaq.
hi: सक्षम होने पर, आपकी GNOME शैल एक्सटेंशन सूची आपके Google खाते के साथ समन्वयित हो जाएगी।
ja: 有効にすると、GNOME Shell 拡張機能一覧を Google アカウントで同期します。
sl: Izbrana možnost omogoča, da bo seznam razširitev lupine GNOME usklajen s povezanim računom Google.
uk: Якщо увімкнено, ваш список розширень GNOME Shell буде синхронізовано з вашим обліковим записом Google.
zh_tw: 若啟用則同步 GNOME Shell 附加元件列表到 Google 帳號。

source: $GS_CHROME$ options
az: $GS_CHROME$ seçimləri
hi: $GS_CHROME$ विकल्प
ja: $GS_CHROME$ オプション
sl: Možnosti $GS_CHROME$
uk: Параметри $GS_CHROME$
zh_tw: $GS_CHROME$ 選項

source: Check for GNOME Shell extensions update
hi: GNOME शैल एक्सटेंशन अद्यतन की जांच करें
ja: GNOME Shell 拡張機能の更新を確認
zh_tw: 檢查 GNOME Shell 附加元件的更新

source: Check update of enabled GNOME Shell extensions only
hi: केवल सक्षम GNOME शैल एक्सटेंशन का अद्यतन जांचें
ja: 有効化された GNOME Shell 拡張機能のみ更新を確認
zh_tw: 只檢查啟用的 GNOME Shell 附加元件更新

source: Your native host connector does not support updates check for enabled GNOME Shell extensions only. Consider update.
hi: आपका मूल होस्ट कनेक्टर केवल सक्षम GNOME शैल एक्सटेंशन के लिए अपडेट जांच का समर्थन नहीं करता है। अद्यतन पर विचार करें।
zh_tw: 您的原生主機介面不支援「只檢查啟用的 GNOME Shell 附加元件更新」功能。請考慮更新。

source: Your native host connector does not support check for GNOME Shell extensions updates. Probably python-requests package is missing.
hi: आपका मूल होस्ट कनेक्टर GNOME शैल एक्सटेंशन अद्यतन की जांच का समर्थन नहीं करता है। संभवतः python-requests पैकेज गायब है।
ja: ネイティブホストコネクタが GNOME Shell 拡張機能の更新確認をサポートしていません。おそらく python-requests パッケージがありません。
zh_tw: 您的原生主機介面不支援檢查 GNOME Shell 附加元件的更新。可能缺少 python-requests 軟體包。

source: Use light icon (dark theme)
az: Açıq işarəni istifadə et (qaranlıq tema)
hi: हल्के आइकन (गहरी थीम) का उपयोग करें
ja: 明るいアイコンを使用 (ダークテーマ)
sl: Uporabi svetlo ikono (za temne teme)
uk: Світла піктограма (темна тема)
zh_tw: 使用亮色圖示 (在暗色主題下)

source: Native host connector is not supported for your platform.
az: Yerli birləşdirici sizin platformanız üçün dəstəklənmir.
hi: आपके प्लेटफार्म के लिए मूल होस्ट कनेक्टर समर्थित नहीं है।
ja: ネイティブホストコネクタが現在のプラットフォームをサポートしていません。
sl: Privzeti povezovalnik na tem sistemu ni podprt.
uk: Підтримки природного з'єднувача вузлів для вашої платформи не передбачено.
zh_tw: 原生主機介面不支援您的平台。

source: Retry
az: Yenidən cəhd et
hi: पुन: प्रयास करें
ja: 再試行
sl: Poskusi znova
uk: Повторити
zh_tw: 重試

source: Save
az: Saxla
hi: सहेजें
ja: 保存
sl: Shrani
uk: Зберегти
zh_tw: 儲存

source: Synchronization
az: Sinxronizasiya
hi: समन्वयन
ja: 同期
sl: Usklajevanje
uk: Синхронізація
zh_tw: 同步

source: Do not enable synchronization.
az: Sinxronizasiyanı aktivləşdirmə.
hi: समन्वयन सक्षम न करें।
sl: Ne omogoči usklajevanja.
uk: Не вмикати синхронізацію.
zh_tw: 請不要啟用同步功能。

source: Failed to synchronize extensions: $CAUSE$
az: Əlavələri sinxronlaşdırmaq alınmadı: $CAUSE$
hi: एक्सटेंशन समन्वयित करने में विफल: $CAUSE$
ja: 拡張機能の同期に失敗しました: $CAUSE$
sl: Usklajevanje razširitev je spodletelo: $CAUSE$
uk: Не вдалося синхронізувати розширення: $CAUSE$
zh_tw: 無法同步附加元件：$CAUSE$

source: Your remote synchronization storage already contains extensions list.
az: Uzaq sinxronizasiya yaddaşınız artıq əlavələr siyahısını ehtiva edir.
hi: आपके दूरस्थ समन्वयन संग्रहण में पहले से ही एक्सटेंशन सूची मौजूद है।
sl: V oddaljeni shrambi je že seznam razširitev.
uk: Ваше віддалене сховище синхронізації вже містить список розширень.
zh_tw: 您的遠端同步儲存空間已經包含附加元件列表。

source: Use local extensions list, overwrite remote.
az: Yerli əlavələr siyahısını istifadə et, uzaq olanı üzərinə yaz.
hi: स्थानीय एक्सटेंशन सूची का उपयोग करें, दूरस्थ को अधिलेखित करें।
sl: Uporabi krajevni seznam razširitev in prepiši oddaljenega.
uk: Використати локальний список розширень. Перезаписати віддалений.
zh_tw: 使用本機附加元件列表，覆寫遠端列表。

source: Use remote extensions list, overwrite local.
az: Uzaq əlavələr siyahısını istifadə et, yerli olanı üzərinə yaz.
hi: दूरस्थ एक्सटेंशन सूची का उपयोग करें, स्थानीय को अधिलेखित करें।
sl: Uporabi oddaljeni seznam razširitev in prepiši krajevnega.
uk: Використати віддалений список розширень. Перезаписати локальний.
zh_tw: 使用遠端附加元件列表，覆寫本機列表。

source: translation_credits
az: Tərcümə: Ramal Rəhimov <jhonaluman@gmail.com>
hi: Scrambled777 <weblate.scrambled777@simplelogin.com>
sl: Matej Urbančič <mateju@src.gnome.org> Martin Srebotnjak <miles@filmsi.net>
uk: Юрій Чорноіван <yurchor@ukr.net>
zh_tw: pan93412 <pan93412@gmail.com>, 2018.

source: About translation
az: Tərcümə haqqında
hi: अनुवाद के बारे में
ja: 翻訳について
sl: O prevodu
uk: Про переклад
zh_tw: 關於翻譯

source: unknown error
az: naməlum xəta
hi: अज्ञात त्रुटि
ja: 不明なエラー
sl: neznana napaka
uk: невідома помилка
zh_tw: 未知錯誤

source: An update for GNOME Shell extensions available
hi: GNOME शैल एक्सटेंशन के लिए एक अद्यतन उपलब्ध है
ja: GNOME Shell 拡張機能の更新が利用可能です
zh_tw: 有可用的 GNOME Shell 附加元件更新

source: Failed to check GNOME Shell extensions updates: $CAUSE$
hi: GNOME शैल एक्सटेंशन अद्यतनों की जाँच करने में विफल: $CAUSE$
ja: GNOME Shell 拡張機能の更新確認に失敗しました: $CAUSE$
zh_tw: 嘗試檢查 GNOME Shell 附加元件更新時出錯：$CAUSE$

source: Your native host connector do not support following APIs: $$1. Probably you should upgrade native host connector or install plugins for missing APIs. Refer <a href='https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation'>documentation</a> for instructions.
hi: आपका मूल होस्ट कनेक्टर निम्नलिखित API का समर्थन नहीं करता: $$1। संभवतः आपको मूल होस्ट कनेक्टर को उन्नत करना चाहिए या गुम API के लिए प्लगइन्स स्थापित करना चाहिए। निर्देशों के लिए <a href='https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation'>दस्तावेज़</a> देखें।
zh_tw: 您的原生主機介面不支援以下 API：$$1。可能你需要升級原生主機介面、或安裝遺失 API 的附加元件。參考<a href='https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation'>文件</a>取得指引。

source: Yes
az: Bəli
hi: हाँ
ja: はい
sl: Da
uk: Так
zh_tw: 是

source: You MUST install native connector for this extension to work. For Arch Linux, Debian, Fedora, Gentoo and Ubuntu you can install package named "chrome-gnome-shell". You also can install connector manually. See https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation for install instructions.
hi: इस एक्सटेंशन को काम करने के लिए आपको मूल कनेक्टर स्थापित करना होगा। Arch Linux, Debian, Fedora, Gentoo और Ubuntu के लिए आप "chrome-gnome-shell" नामक पैकेज स्थापित कर सकते हैं। आप कनेक्टर को मैन्युअल रूप से भी स्थापित कर सकते हैं। स्थापना निर्देशों के लिए https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation देखें।
ja: この拡張機能は、システムにコネクタがインストールされていないと動作しません。 Arch Linux、Debian、Fedora、Gentoo、Ubuntu では、"chrome-gnome-shell" というパッケージ名でコネクタが用意されています。 コネクタは手動インストールも可能です。手順については、https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation をご覧ください。
zh_tw: 您必須安裝此附加元件的原生介面才能運作。 Arch Linux、Debian、Fedora、Gentoo 和 Ubuntu 能直接安裝名為「chrome-gnome-shell」的軟體包。 你也可以手動安裝連接器。請參閱 https://wiki.gnome.org/Projects/GnomeShellIntegrationForChrome/Installation 的安裝指引。

source: Although GNOME Shell integration extension is running, native host connector is not detected. Refer <a href='https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html'>documentation</a> for instructions about installing connector.
az: GNOME Shell inteqrasiya əlavəsi işləsə də, yerli birləşdirici aşkar edilmir. Birləşdiricinin quraşdırılması haqqında təlimatlar üçün <a href='https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html'>sənədlərə</a> baxın.

source: Your native host connector do not support following APIs: $$1. Probably you should upgrade native host connector or install plugins for missing APIs. Refer <a href='https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html'>documentation</a> for instructions.
az: Yerli birləşdiriciniz aşağıdakı API-ləri dəstəkləmir: $$1. Ehtimal ki, yerli birləşdiricini yeniləməli və ya çatışmayan API-lər üçün plaginlər quraşdırmalısınız. Təlimatlar üçün <a href='https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html'>sənədlərə</a> baxın.

source: You MUST install native connector for this extension to work. For Arch Linux, Debian, Fedora, Gentoo and Ubuntu you can install package named "chrome-gnome-shell". You also can install connector manually. See https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html for install instructions.
az: Bu əlavənin işləməsi üçün yerli birləşdiricini quraşdırmalısınız. Arch Linux, Debian, Fedora, Gentoo və Ubuntu üçün "chrome-gnome-shell" adlı paketi quraşdıra bilərsiniz. Birləşdiricini əl ilə də quraşdıra bilərsiniz. Quraşdırma təlimatları üçün https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html səhifəsinə baxın.
sl: Za namestitev razširitve je NUJNO namestiti izvorni povezovalnik. Za okolja Arch Linux, Debian, Fedora, Gentoo in Ubuntu je na voljo v paketu »chrome-gnome-shell«. Povezovalnik je mogoče namestiti tudi ročno. Navodila za namestitev so na voljo na povezavi https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html
uk: Вам СЛІД встановити з'єднувач із основною системою, щоб це розширення запрацювало. У Arch Linux, Debian, Fedora, Gentoo та Ubuntu ви можете встановити пакунок із назвою «chrome-gnome-shell». Ви також можете встановити з'єднувач вручну. Див. настанови щодо встановлення тут: https://gnome.pages.gitlab.gnome.org/gnome-browser-integration/pages/installation-guide.html

source: Although GNOME Shell integration extension is running, native host connector is not detected. Refer <a href='$url$'>documentation</a> for instructions about installing connector.
sl: Čeprav je razširitev za povezovanja z Lupino GNOME zagnana, povezovalnika ni mogoče zaznati. V <a href='$url$'>dokumentaciji</a> si oglejte navodila za namestitev.
uk: Хоча запущено розширення для інтеграції із GNOME Shell, не виявлено з'єднувача із основною системою. Зверніться до <a href='$url$'>документації</a>, щоб дізнатися про те, як встановити з'єднувач.

source: Your native host connector do not support following APIs: $$1. Probably you should upgrade native host connector or install plugins for missing APIs. Refer <a href='$$2'>documentation</a> for instructions.
sl: Izvorni gostiteljski povezovalnik ne podpira vmesnikov API: $$1. Najverjetneje je treba povezovalnik posodobiti ali pa namestiti manjkajoče pakete. Več podrobnosti je zapisanih v <a href='$$2'>dokumentaciji</a>.
uk: У вашому з'єднувачі із основною системою не передбачено підтримки таких програмних інтерфейсів: $$1. Ймовірно, вам слід оновити з'єднувач із основною системою або встановити додатки для реалізації відповідних програмних інтерфейсів. Зверніться до <a href='$$2'>документації</a>, щоб дізнатися більше.
