Repository: hekimoghlu/OpenSystem
Catalog: src/*/gcab/po/*.po
Languages: bg

source: Dumping data to:
bg: Извличане на данните в:

source: Print program version
bg: Извеждане на версията на програмата

source: Be verbose
bg: Извеждане на допълнителна информация

source: Create archive
bg: Създаване на архив

source: Extract all files
bg: Извличане на всички файлове

source: Dump reserved and extra data
bg: Извличане на запазени и допълнителни данни

source: List content
bg: Изписване на съдържанието

source: List content with file details
bg: Изписване на съдържанието с подробности за файловете

source: Change to directory DIR
bg: Променяне към папката ПАПКА

source: DIR
bg: ПАПКА

source: Use zip compression
bg: Използване на компресиране със ZIP

source: Do not include path
bg: Без включване на местоположението

source: Reserve space in cabinet for signing (e.g. -s 6144 reserves 6K bytes)
bg: Запазване на пространство в cabinet архива за подписване (например -s 6144 запазва 6K байта)

source: FILE INPUT_FILES...
bg: ФАЙЛ ВХОДНИ_ФАЙЛОВЕ...

source: - create a Cabinet file
bg: — създаване на cabinet файл

source: Report bugs to:
bg: Докладвайте за грешки на:

source: gcab saves many files together into a cabinet archive, and can restore individual files from the archive.
bg: gcab запазва много файлове заедно в архив, и може да възстанови отделни файлове от архива.

source: Option parsing failed
bg: Опцията не може да бъде разчетена

source: Please specify a single operation
bg: Посочете една операция

source: Cabinet file must be specified
bg: Cabinet файл трябва да бъде посочен

source: Cannot open file for reading
bg: Файлът не може да бъде отворен за четене

source: Error reading
bg: Грешка при четенето

source: <unknown-date>
bg: <неизвестна-дата>

source: Error during extraction
bg: Грешка при извличането

source: Error while reading signature
bg: Грешка при четене на подписа

source: No input files specified
bg: Няма посочени входни файлове

source: Cannot add file
bg: Файлът не може да бъде добавен

source: No files to be archived
bg: Няма файлове за архивиране

source: Cannot create cab file
bg: Cab файлът не може да бъде създаден

source: Cannot add folder to cab file
bg: Не може да бъде добавена папка към cab файла

source: Cannot write cab file
bg: Cab файлът не може да бъде записан
