Repository: hekimoghlu/OpenSystem
Catalog: src/*/gnome-klotski/po/*.po
Languages: ka

# shortcut window
source: Puzzle-related
ka: თავსატეხის-მსგავსი

# shortcut window
source: Toggle game menu
ka: თამაშის მენიუს ჩართ/გამორთ

# shortcut window
source: Restart
ka: გადატვრთვა

# shortcut window
source: Change Puzzle popover
ka: თავსატეხის შეცვლის მხტუნარა

# shortcut window
source: Select new puzzle
ka: აირჩიეთ ახალი პაზლი

# shortcut window
source: Previous puzzle
ka: წინა პაზლი

# shortcut window
source: Next puzzle
ka: შემდეგი პაზლი

# shortcut window
source: Previous puzzles group
ka: წინა პაზლის ჯგუფი

# shortcut window
source: Next puzzles group
ka: შემდეგი პაზლის ჯგუფი

# shortcut window
source: Scores
ka: ქულები

# shortcut window
source: Scores dialog
ka: ქულების დიალოგი

# shortcut window
source: Generic
ka: ზოგადი

# shortcut window
source: Keyboard shortcuts
ka: კლავიატურის მალსახმობები

# shortcut window
source: Help
ka: დახმარება

# shortcut window
source: About
ka: შესახებ

# shortcut window
source: Quit
ka: გასვლა

source: _Scores
ka: _ქულები

source: _Keyboard Shortcuts
ka: _კლავიატურის მალსახმობები

source: _Help
ka: დახმარება

source: _About Klotski
ka: Klotski-ის შეს_ახებ

source: _Start Over
ka: თ_ავიდან დაწყება

source: Huarong Trail
ka: ჰუარონგის კვალი

source: Challenge Pack
ka: გამოწვევის პაკეტი

source: Skill Pack
ka: ნაკრები გამოცდილებისთვის

source: Previous
ka: წინა

source: Next
ka: შემდეგი

source: _Change Puzzle
ka: _პაზლის შეცვლა

source: Choose an other puzzle
ka: აირჩიეთ სხვა პაზლი

source: Moves counter
ka: სვლების მთვლელი

source: Slide blocks to solve the puzzle
ka: გადაათრიეთ ბლოკები პაზლის ამოსახსნელად

source: GNOME Klotski is a set of block sliding puzzles. The objective is to move the patterned block to the area bordered by green markers. To do so, you’ll need to slide other blocks out of the way. Complete each puzzle in as few moves as possible!
ka: GNOME Klotski ბლოკების სასრიალო თავსატეხების ნაკრებია. მიზანია, რომ დახატული ბლოკები გადააადგილოთ მწვანედ მონიშნულ ადგილზე. იმისათვის, რომ ეს ქნათ, სხვა ბლოკები გზიდან უნდა მოიცილოთ. დაასრულეთ თავსატეხები რაც შეიძლება ნაკლებ სვლაში!

source: GNOME Klotski comes with nearly thirty different puzzle layouts of varying difficulty. Some of the layouts are similar and only the size of one or more blocks differ. Other layouts have more variety.
ka: GNOME Klotski-ის 30-მდე სხვადასხვა პაზლის განლაგება მოჰყვება სხვადასხვა სიძნელით. ზოგიერთი განლაგება ერთმანეთის მსგავსია და სხვებისგან ერთი ან რამდენიმე ბლოკით განსხვავდება. სხვა განლაგებები უფრო სხვანაირია.

source: The GNOME Project
ka: პროექტი "GNOME"

source: game;strategy;logic;move;
ka: game;strategy;logic;move;თამაში;სტრატეგია;ლოგიკა;

source: The puzzle in play
ka: თავსატეხი თამაშში

source: The number of the puzzle being played.
ka: თავსატეხის ნომერი, რომელსაც თამაშობთ.

source: The width of the window
ka: ფანჯრის სიგანე

source: Width of the window in pixels
ka: ფანჯრის სიგანე, პიქსელებში

source: The height of the window
ka: მთავარი ფანჯრის სიმაღლე

source: Height of the window in pixels
ka: ფანჯრის სიმაღლე, პიქსელებში

source: A flag to enable maximized mode
ka: გაშლილობის რეჟიმის ჩართვის ალამი

source: If “true”, the main window starts in maximized mode.
ka: თუ ჩართულია, ფანჯარა გაშლილი გაიხსნება.

source: Print release version and exit
ka: რელიზის ვერსიის გამოტანა და გასვლა

source: Only 18 Steps
ka: მხოლოდ 18 ბიჯი

source: Daisy
ka: გვირილა

source: Violet
ka: იისფერი

source: Poppy
ka: ყაყაჩო

source: Pansy
ka: იაჟუჟუნა

source: Snowdrop
ka: ენძელა

source: Red Donkey
ka: წითელი ვირი

source: Trail
ka: კვალი

source: Ambush
ka: ჩასაფრება

source: Agatka
ka: აგატკა

source: Success
ka: წარმატება

source: Bone
ka: ძვალი

source: Fortune
ka: იღბალი

source: Fool
ka: სულელი

source: Solomon
ka: სოლომონი

source: Cleopatra
ka: კლეოპატრა

source: Shark
ka: ზვიგენი

source: Rome
ka: რომი

source: Pennant Puzzle
ka: ვიმპელი

source: Ithaca
ka: ითაკა

source: Pelopones
ka: პელოპონესი

source: Transeuropa
ka: ტრანსევროპა

source: Lodzianka
ka: ლოძიანკა

source: Polonaise
ka: პოლონეზი

source: Baltic Sea
ka: ბალტიის ზღვა

source: American Pie
ka: ამერიკული ღვეზელი

source: Traffic Jam
ka: საცობი

source: Sunshine
ka: მზის ნათება

source: Puzzle
ka: პაზლი

source: Level completed.
ka: დონე დასრულდა.

source: Lars Rydlinge (original author)
ka: ლარს რაიდლინგი (საწყისი ავტორი)

source: Robert Ancell (port to vala)
ka: რობერტ ანსელი (გადაყვანა vala-ზე)

source: John Cheetham (port to vala)
ka: ჯონ ჩიტემი (გადაყვანა vala-ზე)

source: Andrew Sobala
ka: ენდრიუ სობალა

source: Sliding block puzzles
ka: თავსატეხები მოსრიალე ბლოკებით

source: Copyright © 1999-2008 – Lars Rydlinge
ka: © 1999-2008 – Lars Rydlinge - ყველა უფლება დაცულია

source: Copyright © %u-%u – Michael Catanzaro
ka: © %u-%u – Michael Catanzaro - ყველა უფლება დაცულია

source: Copyright © %u-%u – Arnaud Bonatti
ka: © %u-%u – Arnaud Bonatti - ყველა უფლება დაცულია

source: translator-credits
ka: თარგმანი-შესრულებულია
