Repository: hekimoghlu/OpenSystem
Catalog: src/*/calls/po/*.po
Languages: hi

source: Calls
hi: कॉल

source: Phone
hi: फोन

source: A phone dialer and call handler
hi: एक फोन डायलर और कॉल नियंत्रक

source: Telephone;Call;Phone;Dial;Dialer;PSTN;
hi: टेलीफोन;कॉल;फोन;डायल;डायलर;PSTN;

source: Calls (daemon)
hi: कॉल (डेमॉन))

source: A phone dialer and call handler (daemon mode)
hi: एक फोन डायलर और कॉल नियंत्रक (डेमॉन मोड)

source: Make phone and SIP calls
hi: फोन और SIP कॉल करें

source: Calls is a simple, elegant phone dialer and call handler for GNOME. It can be used with a cellular modem for plain old telephone calls as well as VoIP calls using the SIP protocol.
hi: कॉल गनोम के लिए एक सरल, सुंदर फोन डायलर और कॉल नियंत्रक है। इसका उपयोग सेलुलर मॉडेम के साथ सादे पुराने टेलीफोन कॉल करने और उसके अतिरिक्त SIP प्रोटोकॉल का उपयोग करके VoIP कॉल के लिए किया जा सकता है।

source: Julian Sparber, Evangelos Ribeiro Tzaras
hi: जूलियन स्पार्बर, इवेंजेलोस रिबेरो तज़ारस

source: Placing a call
hi: कॉल लगाना

source: The call history
hi: कॉल इतिहास

source: Whether calls should automatically use the default origin
hi: क्या कॉल को स्वचालित रूप से तयशुदा मूल का उपयोग करना चाहिए

source: The country code as reported by the modem
hi: मॉडेम द्वारा बयान किया गया देश कोड

source: The country code is used for contact name lookup
hi: देश कोड का उपयोग संपर्क नाम खोजने के लिए किया जाता है

source: The plugins to load automatically
hi: प्लगिन जो स्वचालित रूप से लोड हो जाने चाहिएं

source: These plugins will be automatically loaded on application startup.
hi: ये प्लगिन स्वचालित रूप से अनुप्रयोग के शुरू होने पर लोड हो जाएंगे।

source: Audio codecs to use for VoIP calls in order of preference
hi: प्राथमिकता के क्रम में VoIP कॉल के लिए उपयोग किए जाने वाले ऑडियो कोडेक्स

source: The preferred audio codecs to use for VoIP calls (if available)
hi: VoIP कॉल के लिए उपयोग करने के लिए वरीय ऑडियो कोडेक्स (यदि उपलब्ध हों)

source: Allow insecure crypto key exchange for encrypted media.
hi: कूटलेखित मीडिया के लिए असुरक्षित क्रिप्टो कुंजी विनिमय की अनुमति दें।

source: Set to true if you want to allow keys to be exchangable in cleartext, otherwise you must set the TLS transport.
hi: यदि आप कुंजियों को क्लियरटेक्स्ट में विनिमय योग्य बनाना चाहते हैं तो इसे चयनित पर तय करें, अन्यथा आपको TLS ट्रांसपोर्ट तय करना होगा।

source: Default (uninitialized) state
hi: तयशुदा (अप्रारंभीकृत) स्थिति

source: Initializing account…
hi: खाता प्रारंभित किया जा रहा है…

source: Uninitializing account…
hi: खाता अप्रारंभीकृत किया जा रहा है…

source: Connecting to server…
hi: सर्वर से जुड़ रहें हैं…

source: Account is online
hi: खाता ऑनलाइन है

source: Disconnecting from server…
hi: सर्वर से वियोजित हो रहा है…

source: Account is offline
hi: खाता ऑफलाइन है

source: Account encountered an error
hi: खाते में त्रुटि आई

source: No reason given
hi: कोई कारण नहीं दिया गया

source: Initialization started
hi: प्रारंभिकरण शुरू हुआ

source: Initialization complete
hi: प्रारंभिकरण पूर्ण

source: Uninitialization started
hi: अप्रारंभीकरण शुरू हुआ

source: Uninitialization complete
hi: अप्रारंभीकरण पूर्ण

source: No credentials set
hi: कोई प्रत्यय-पत्र निर्धारित नहीं

source: Starting to connect
hi: जुड़ना शुरू हो रहा है

source: Connection timed out
hi: कनेक्शन का समय समाप्त

source: Domain name could not be resolved
hi: डोमेन नाम का समाधान नहीं किया जा सका

source: Server did not accept username or password
hi: सर्वर ने उपयोक्ता नाम या पासवर्ड स्वीकार नहीं किया

source: Connecting complete
hi: जुड़ना पूर्ण

source: Starting to disconnect
hi: वियोग शुरू हो रहा है

source: Disconnecting complete
hi: वियोग पूर्ण

source: Internal error occurred
hi: आंतरिक त्रुटि हुई

source: Edit account: %s
hi: खाता संपादित करें: %s

source: Add new account
hi: नया खाता जोड़ें

source: VoIP Accounts
hi: VoIP खाते

source: Tried dialing invalid tel URI `%s'
hi: अमान्य टेली URI `%s' डायल करने का प्रयास किया गया

source: Don't know how to open `%s'
hi: पता नहीं `%s' कैसे खोलें

source: The name of the plugins to load
hi: लोड करने के लिए प्लगइन्स का नाम

source: PLUGIN
hi: प्लगइन

source: Whether to present the main window on startup
hi: क्या शुरुआत पर मुख्य विंडो प्रस्तुत करनी है

source: Dial a telephone number
hi: एक टेलीफोन नंबर डायल करें

source: NUMBER
hi: नंबर

source: Enable verbose debug messages
hi: वाचाल डिबग संदेशों को सक्षम करें

source: Print current version
hi: वर्तमान संस्करण छापें

source: Anonymous caller
hi: गुमनाम कॉलर

source: %s yesterday
hi: %s बिता कल

source: Police
hi: पुलिस

source: Ambulance
hi: एम्बुलेंस

source: Fire Brigade
hi: अग्निशामक दल

source: Mountain Rescue
hi: पर्वतीय बचाव

source: translator-credits
hi: Hemish (हेमिश) <hemish04082005@gmail.com> Scrambled777 <weblate.scrambled777@simplelogin.com>

source: Can't place calls: No modem or VoIP account available
hi: कॉल नहीं कर सकते: कोई मॉडेम या VoIP खाता उपलब्ध नहीं है

source: Can't place calls: No plugin loaded
hi: कॉल नहीं कर सकते: कोई प्लगइन लोड नहीं हुआ

source: Recent
hi: हालिया

source: Contacts
hi: संपर्क

source: Dial Pad
hi: डायल पैड

source: Missed call
hi: छूटी कॉल

source: Missed call from <b>%s</b>
hi: <b>%s</b> से कॉल छूटी

source: Missed call from %s
hi: %s से कॉल छूटी

source: Missed call from unknown caller
hi: अज्ञात कॉलर से कॉल छूटी

source: Call back
hi: वापस कॉल करें

source: Add VoIP Accounts
hi: VoIP खाते जोङें

source: You can add VoIP account here. It will allow you to place and receive VoIP calls using the SIP protocol. This feature is still relatively new and not yet feature complete (i.e. no encrypted media).
hi: आप यहां VoIP खाता जोड़ सकते हैं। यह आपको SIP प्रोटोकॉल का उपयोग करके VoIP कॉल करने और प्राप्त करने की अनुमति देगा। यह सुविधा अभी भी अपेक्षाकृत नई है और अभी तक पूर्ण नहीं हुई है (अर्थात कोई कूटलेखित मीडिया नहीं है)।

source: _Add Account
hi: खाता जोड़ें (_A)

source: _Delete Call
hi: कॉल मिटाएं (_D)

source: _Copy number
hi: नंबर कॉपी करें (_C)

source: _Add contact
hi: संपर्क जोड़ें (_A)

source: _Send SMS
hi: SMS भेजें (_S)

source: On hold
hi: होल्ड पर

source: No Contacts Found
hi: कोई संपर्क नहीं मिला

source: No Recent Calls
hi: कोई हालिया कॉल नहीं

source: _Cancel
hi: रद्द करें (_C)

source: _Close
hi: बंद करें (_C)

source: _Send
hi: भेजें (_S)

source: _VoIP Accounts
hi: _VoIP खाते

source: _About Calls
hi: कॉल के बारे में (_A)

source: Enter a VoIP address
hi: VoIP पता दर्ज करें

source: SIP Account
hi: SIP खाता

source: New Call
hi: नई कॉल

source: Back
hi: पीछे

source: Unknown reason
hi: अज्ञात कारण

source: Outgoing call started
hi: जावक कॉल प्रारंभ हुई

source: New incoming call
hi: नई आवक कॉल

source: Call accepted
hi: कॉल स्वीकृत

source: Call ended
hi: कॉल समाप्त

source: Call disconnected (busy or call refused)
hi: कॉल वियोजित (व्यस्त या कॉल अस्वीकृत)

source: Call disconnected (wrong id or network problem)
hi: कॉल वियोजित (गलत ID या नेटवर्क समस्या)

source: Call disconnected (error setting up audio channel)
hi: कॉल वियोजित (ऑडियो चैनल तय करने में त्रुटि)

source: Call transferred
hi: कॉल स्थानांतरित हो गई

source: Call deflected
hi: कॉल विक्षेपित

source: Call disconnected (unknown reason code %i)
hi: कॉल विक्षेपित (अज्ञात कारण कोड %i)

source: ModemManager unavailable
hi: ModemManager अनुपलब्ध

source: No voice-capable modem available
hi: कोई आवाज-सक्षम मॉडेम उपलब्ध नहीं है

source: Normal
hi: साधारण

source: Initialized
hi: आरंभीकृत

source: DBus unavailable
hi: डीबस अनुपलब्ध

source: No encryption
hi: कोई कूटलेखन नहीं

source: Force encryption
hi: बलपूर्वक कूटलेखन

source: Cryptographic key exchange unsuccessful
hi: गूढ़लेखन कुंजी विनिमय असफल

source: _Log In
hi: लॉगिन (_L)

source: _Apply
hi: लागू करें (_A)

source: _Delete
hi: मिटाएं (_D)

source: Server
hi: सर्वर

source: Display Name (Optional)
hi: प्रदर्शन नाम (वैकल्पिक)

source: User ID
hi: उपयोक्ता ID

source: Password
hi: पासवर्ड

source: Port
hi: पोर्ट

source: Transport
hi: परिवहन

source: Media Encryption
hi: मीडिया कूटलेखन

source: Use for Phone Calls
hi: फोन कॉल के लिए प्रयोग करें

source: Automatically Connect
hi: स्वत: जुड़ें
