Repository: hekimoghlu/OpenSystem
Catalog: src/*/pitivi/help/*/*.po
Languages: ru

source: When zoomed in, frames are visually represented as alternating light and dark areas in the bottom part of the ruler. Hovering the mouse cursor over the ruler in this state will reveal an information tooltip with frame number. The amount of time the individual frames take up is based on the project framerate settings.
ru: При увеличении масштаба рамки визуально показываются как чередующиеся светлые и тёмные области в нижней части линейки. При наведении курсора мыши на линейку в этом состоянии будет показана всплывающая подсказка с номером кадра. Количество времени, которое занимают отдельные кадры, зависит от параметров частоты кадров проекта.

source: The timeline is the core user interface component that you will use for editing. Vertically, it is divided into layers that can be filled with audio and video clips. Horizontally, it constitutes a time-proportional representation of your project's chronology. Various levels of zoom can be applied to the timeline. However, these apply only to the horizontal (chronological) dimension of the timeline.
ru: Монтажный стол — это важный компонент интерфейса для редактирования. Вертикально он поделён на два слоя, которые можно заполнить аудио- и видеоклипами. По горизонтали — пропорциональное по времени представление хронологии редактируемого проекта. К монтажному столу можно применять различные уровни масштабирования, однако они применимы только к горизонтальному (хронологическому) расширению монтажного стола.

source: See the <link xref="layers">Understanding layers</link> and <link xref="movearoundtimeline">Moving around the timeline</link> pages for more information on how to work with the timeline.
ru: Для получения более подробной информации о работе на монтажном столе обратитесь к разделам <link xref="layers">Основная информация о слоях</link> и <link xref="movearoundtimeline">Перемещение по монтажному столу</link>.

source: Timeline toolbar
ru: Панель инструментов монтажного стола

source: The timeline toolbar is located at the right edge of the timeline. It contains basic actions for editing in timeline:
ru: Панель инструментов монтажного стола расположена в правой части монтажного стола. Она содержит основные функции для редактирования:

source: Split clip at playhead position
ru: Разрезать клип в позиции воспроизведения

source: Delete selected
ru: Удалить выбранное

source: Group clips
ru: Сгруппировать клипы

source: Ungroup clips
ru: Разгруппировать клипы

source: Copy
ru: Копировать

source: Paste
ru: Вставить

source: Toggle gapless mode
ru: Переключить на бесшовный режим

source: Note that most of the actions become available only once a clip is selected (see <link xref="selectiongrouping">Selection and grouping</link> for more details). When there is no subject for the action to be performed on, it remains shaded (indicating its unavailability).
ru: Обратите внимание, что большинство действий доступно только при выделенном клипе (более подробная информация содержится в разделе <link xref="selectiongrouping">Выделение и группировка</link> ). Когда нет объекта, над которым можно произвести действие, соответствующее действие будет выделено серым (что будет говорить о том, что его нельзя использовать).

source: Playback toolbar
ru: Панель инструментов воспроизведения

source: This toolbar, located below the previewer, contains buttons controlling the playback of the timeline. Options provided by the toolbar are the following:
ru: Эта панель инструментов, расположенная под средством предварительного просмотра, содержит кнопки, позволяющие управлять воспроизведением на монтажном столе. Доступны следующие функции:

source: Play/Pause
ru: Воспроизведение/пауза

source: Go forward one second
ru: Вперёд на одну секунду

source: Go back one second
ru: Назад на одну секунду

source: Go to the end of the timeline
ru: В конец монтажного стола

source: Go to the beginning of the timeline
ru: В начало монтажного стола

source: For more information on how to move on the timeline, see the <em>Moving the playhead</em> and <em>Scrubbing</em> sections on the <link xref="movearoundtimeline">Moving around the timeline</link> page.
ru: Более подробная информация о навигации на монтажном столе представлена в разделах <em>Перемещение позиции воспроизведения</em> и <em>Перемотка</em> на странице <link xref="movearoundtimeline">Перемещение по монтажному столу</link>.

source: Previewer
ru: Просмотр

source: The previewer displays:
ru: Средство предварительного просмотра показывает:

source: The video frame at the current position of the playhead.
ru: Видеокадр в текущей позиции воспроизведения.

source: Your project's video when playing back.
ru: Видео проекта при воспроизведении.

source: A <em>live preview</em> when trimming a clip's beginning/end point.
ru: <em>Предварительный просмотр</em> при обрезке начальной/конечной точки клипа.

source: Detaching the previewer into a separate window
ru: Открепление средства предварительного просмотра в отдельное окно

source: You can detach the previewer into a separate window by clicking the <gui>Detach the viewer</gui> button in the <gui>Playback toolbar</gui>. From the separate window, you can play the preview in fullscreen. This will also allow other parts of the main window to take up the space the previewer occupied. You can attach the previewer back by closing the separate window.
ru: Окно предварительного просмотра можно открепить от основного окна с помощью кнопки <gui>Открепить окно просмотра</gui> на <gui>Панели инструментов воспроизведения</gui>. В отдельном окне предварительный просмотр можно развернуть на весь экран. Открепление окна просмотра также освободит место для других частей главного окна. Чтобы прикрепить окно предварительного просмотра обратно, закройте его.

source: <app>Pitivi</app> inhibits the screensaver while playing the video preview.
ru: <app>Pitivi</app> отключает заставку во время предварительного просмотра видео.

source: Left pane
ru: Левая панель

source: The left pane contains media and effect libraries. You can switch between them by selecting the appropriate tab. The <gui>Media Library</gui> displays the imported media files in your project and allows you to manage them. The <gui>Effect library</gui> contains number of audio and video effects applicable to clips.
ru: На левой панели содержатся библиотеки медиафайлов и эффектов. Чтобы переключиться между ними, выберите соответствующую вкладку. Вкладка <gui>Библиотека медиафайлов</gui> показывает импортированные в проект медиафайлы, а также позволяет работать с ними. Вкладка <gui>Библиотека эффектов</gui> содержит набор аудио и видео эффектов, которые можно применить к клипам.

source: You can search the libraries by using the text box in the header of each library.
ru: Можно произвести поиск по библиотекам с помощью текстового поля в заголовке каждой библиотеки.

source: Middle pane
ru: Средняя панель

source: The middle pane contains <gui>Clip configuration</gui>, <gui>Transitions</gui> and <gui>Title editor</gui>. You can switch between them by selecting the appropriate tab. The <gui>Clip configuration</gui> allows you to activate, deactivate or configure settings of effects applied to a selected clip. <gui>Transitions</gui> let you pick and configure the transition type when two clips overlap in the timeline. With <gui>Title editor</gui> you can create new clips with titles or add titles to existing ones.
ru: Средняя панель содержит такие панели как <gui>Настройка клипа</gui>, <gui>Переходы</gui> и <gui>Редактор титров</gui>. Переключаться между ними можно с помощью соответствующих вкладок. <gui>Настройка клипа</gui> позволяет включить, выключить или настроить параметры эффектов, применённым к выбранному клипу. Панель <gui>Переходы</gui> позволяет выбрать и настроить тип перехода между двумя накладывающимися друг на друга клипами на монтажном столе. На панели <gui>Редактор титров</gui> можно создавать новые клипы с титрами или добавлять титры к уже существующим клипам.

source: Managing your imported clips with the Media Library
ru: Управление импортированными клипами в библиотеке медиафайлов

source: Using the Media Library
ru: Использование библиотеки медиафайлов

source: Importing a file to the <gui>Media Library</gui>
ru: Импорт файла в <gui>Библиотеку медиафайлов</gui>

source: There are two ways to import files into the <gui>Media Library</gui>. The first way is to click on the <gui>Import</gui> button in the upper left corner. This will open a file chooser in which you can preview selected files or select multiple files (by holding <key>Shift</key> or <key>Control</key> while selecting them). The second way is to drag and drop the files from a file browser to the <gui>Media Library</gui>. <em>Files</em> imported into the <gui>Media Library</gui> are called <em>clips</em>.
ru: Есть два способа импорта файлов в <gui>Библиотеку медиафайлов</gui>. Первый способ — это нажать на кнопку <gui>Импорт</gui> в верхнем левом углу. Откроется окно с выбором файлов, позволяющее просмотреть выбранные файлы или выбрать их (удерживая нажатой клавишу <key>Shift</key> или <key>Ctrl</key> при их выделении). Второй способ — это перетащить файлы из диспетчера файлов в <gui>Библиотеку медиафайлов</gui>. <em>Файлы</em>, импортированные в <gui>Библиотеку медиафайлов</gui>, называются <em>клипами</em>.

source: The clips in the <gui>Media Library</gui> are sorted alphabetically.
ru: Клипы в <gui>Библиотеке медиафайлов</gui> отсортированы по алфавиту.

source: Previewing a clip from the <gui>Media Library</gui>
ru: Предварительный просмотр клипа из <gui>Библиотеки медиафайлов</gui>

source: To preview a clip before placing it on the timeline, you can double-click on it in the <gui>Media Library</gui>. This will open the clip in a window that automatically closes whenever you click outside the window.
ru: Чтобы просмотреть клип перед помещением его на монтажный стол, дважды щёлкните по нему левой кнопкой мыши в <gui>Библиотеке медиафайлов</gui>. Клип откроется в отдельном окне, которое автоматически закроется при щелчке левой кнопкой мыши в любой области вне этого окна.

source: Filtering search
ru: Фильтрация поиска

source: A search bar is shown at the top of the <gui>Media Library</gui>. Typing into the search entry filters the contents of the <gui>Media Library</gui> to show only clips whose filenames match your search terms. To reset the search entry, click the "cleanup" icon in the search entry.
ru: В верхней части <gui>Библиотеки медиафайлов</gui> показывается панель поиска. При вводе текста в строку поиска содержимое <gui>Библиотеки медиафайлов</gui> будет отфильтровано так, чтобы показывались только клипы, имена файлов которые соответствуют условиям поиска. Чтобы сбросить поисковой запрос, нажмите кнопку «Очистить» в поле ввода текста для поиска.

source: View modes
ru: Режимы просмотра

source: The <gui>Media Library</gui> can display your clips in a list or in an icon view. The default mode is icon view because it display more clips without needing to scroll down. However, the list view mode shows more details about each clip. To activate/deactivate it, click on the <gui>Show clips as a detailed list</gui> button to the left of search bar.
ru: <gui>Библиотека медиафайлов</gui> может отображать все клипы в качестве списка, либо в виде миниатюр. Режимом по умолчанию являются миниатюры, потому что в таком случае показывается больше клипов без необходимости их прокручивания. Режим просмотра в виде списка отображает больше подробностей о каждом клипе. Чтобы переключить режим, нажмите кнопку <gui>Показывать клипы в виде списка</gui> в левой части панели поиска.

source: Selecting unused clips
ru: Выбор неиспользуемых клипов

source: You may sometimes find that you have imported more clips that you needed in your project. <app>Pitivi</app> allows you to select clips that are present in the media library but not in the timeline. There are various reasons to do this:
ru: Иногда может случиться такое, что было импортировано больше клипов, чем нужно в проекте. <app>Pitivi</app> позволяет выбирать клипы, присутствующие в библиотеке медиафайлов, но отсутствующие на монтажном столе. Для существования этой функции есть несколько причин:

source: Improving performance when loading the project
ru: Улучшение производительности при загрузке проекта

source: Simplifying your editing workflow
ru: Упрощение рабочего процесса редактирования

source: Check which clips you may have forgot to use in your movie
ru: Проверка, какие клипы ещё не были использованы в создаваемом фильме

source: Backup or share your project more easily
ru: Лёгкое сохранение резервной копии проекта и возможность поделиться им с другими

source: To identify which clips are not being used in your project, use the <gui>Select clips that have not been used in the project</gui> button at the left side of the search bar. Unused clips will then be selected in the media library.
ru: Чтобы определить, какие клипы не были использованы в проекте, нажмите кнопку <gui>Выбрать неиспользованные в проекте клипы</gui> в левой части панели поиска. Неиспользованные клипы будут выбраны в библиотеке медиафайлов.

source: If there are no unused clips in your project, nothing will be selected in the media library.
ru: Если в проекте нет неиспользуемых клипов, в библиотеке медиафайлов ничего не будет выбрано.

source: Other actions
ru: Другие действия

source: There are three further actions you can perform with clips. Each is represented by a button in the upper right part of the <gui>Media Library</gui>:
ru: Есть ещё три действия, которые можно выполнить с клипами. Каждое представлено кнопкой в верхней правой части <gui>Библиотеки медиафайлов</gui>:

source: <gui>Remove selected clips from the project</gui> (this can also be performed by pressing <keyseq><key>Control</key><key>Delete</key></keyseq>).
ru: <gui>Удалить выбранные клипы из проекта</gui> (этой функцией также можно воспользоваться с помощью комбинации клавиш <keyseq><key>Ctrl</key><key>Delete</key></keyseq>).

source: <gui>Clip properties...</gui> opens a new window with information on <em>video size</em>, <em>frame rate</em> and <em>aspect ratio</em>. Clicking the <gui>Apply to project</gui> button adjusts the project settings to the clip properties. You can select which properties to apply by leaving them ticked/unticked.
ru: Параметр <gui>Свойства клипа...</gui> позволяет открыть новое окно с информацией о <em>размерах видео</em>, <em>частоте кадров</em> и <em>соотношении сторон</em>. Кнопка <gui>Применить к проекту</gui> изменяет параметры проекта на свойства клипа. Можно выбрать свойства, которые должны быть применены, устанавливая и снимая соответствующие флажки.

source: <gui>Insert selected clips at the end of the timeline</gui> inserts the selected clips one after another into the longest layer of the timeline where the last clip on that layer ends.
ru: Кнопка <gui>Вставить выбранные клипы в конце монтажного стола</gui> позволяет последовательно вставить выбранные клипы на самый длинный слой на монтажном столе, где заканчивается последний клип.

source: In order for these actions to become available, one or more clips must be selected.
ru: Чтобы эти действия стали доступными, необходимо выбрать один или несколько клипов.

source: Moving the playhead, using the zoom feature, scrolling and scrubbing.
ru: Перемещение позиции воспроизведения, функция масштабирования, прокрутка и перемотка.

source: Moving around the timeline
ru: Перемещение по монтажному столу

source: Activating the timeline toolbar
ru: Включение панели инструментов монтажного стола

source: The timeline toolbar contains many tools, which become active once a clip is selected in the timeline. To select a clip, simply click on the desired clip in the timeline. When selected, the clip will become darker and the timeline toolbar items will now be clickable.
ru: Панель инструментов монтажного стола содержит множество инструментов, которые становятся доступными, когда на монтажном столе выбирается клип. Чтобы выбрать клип, просто нажмите на него на монтажном столе. После выделения клип станет темнее, а с элементами на панели инструментов монтажного стола можно будет взаимодействовать.

source: Scrolling
ru: Прокрутка

source: You can scroll by:
ru: Прокручивать можно:

source: Using the mouse wheel anywhere over the timeline to scroll horizontally, or hold down the <key>Shift</key> key while using the mouse wheel to scroll the timeline layers vertically
ru: С помощью колеса мыши в любом месте монтажного стола для горизонтальной прокрутки, либо удерживая нажатой клавишу <key>Shift</key> и прокручивая колесом мыши для вертикальной прокрутки.

source: Clicking anywhere over the timeline with the middle button and dragging the timeline
ru: Щелчком в любом месте монтажного стола средней кнопкой мыши и перетаскиванием монтажного стола

source: Using the scrollbars located on the right and bottom of the timeline
ru: С помощью полос прокрутки, расположенных в правой и нижней частях монтажного стола

source: Zooming
ru: Масштабирование

source: Zooming directly affects your editing accuracy and your ability to move quickly along the timeline:
ru: Масштабирование напрямую влияет на точность редактирования и способность быстро перемещаться по монтажному столу:

source: When zooming in, video clips display more thumbnails and audio clips display increasingly detailed waveforms, allowing you to do precise edits.
ru: При увеличении масштаба видеоклипы показывают больше миниатюр, а аудиоклипы показывают более подробные формы волн, что позволяет выполнять точное редактирование.

source: Zooming out allows you to scroll faster along the timeline. Zoom can thus be used in conjunction with scrolling to move quickly between distant points of your project's chronology.
ru: Уменьшение масштаба позволяет быстрее перемещаться по монтажному столу. Масштабирование можно использовать вместе с прокруткой для быстрого перемещения между удалёнными точками на хронологии проекта.

source: You can zoom in and out by:
ru: Масштабировать можно следующими способами:

source: Holding the <key>Ctrl</key> key while using the mousewheel over the timeline, to keep the timeline point where the mouse cursor is in place if possible
ru: Удерживая клавишу <key>Ctrl</key> при использовании колёсика мыши над монтажным столом, при этом сохраняя точку монтажного стола, в которой находится курсор, если это возможно.

source: Holding the <key>Alt</key> key while using the mousewheel over the timeline, to keep the playhead in view
ru: Удерживая нажатой клавишу <key>Alt</key> при прокрутке колеса мыши на монтажном столе и держа в фокусе позицию воспроизведения

source: Dragging the zoom slider on the left of the ruler
ru: Перетаскивая ползунок масштаба по линейке влево

source: Using keyboard shortcuts such as <keyseq><key>Ctrl</key><key>-</key></keyseq> to zoom out or <keyseq><key>Ctrl</key><key>=</key></keyseq> (<keyseq><key>Ctrl</key><key>+</key></keyseq> on the numeric keypad) to zoom in
ru: Используя такие комбинации клавиш как <keyseq><key>Ctrl</key><key>-</key></keyseq> для уменьшения масштаба или <keyseq><key>Ctrl</key><key>=</key></keyseq> (<keyseq><key>Ctrl</key><key>+</key></keyseq> на цифровой клавиатуре) для увеличения масштаба

source: To get a global overview of your timeline, you may click the <gui>Zoom</gui> button on the left of the zoom slider. Another way to do this is by pressing <keyseq><key>Ctrl</key><key>0</key></keyseq>.
ru: Чтобы получить общий вид временной шкалы, нажмите кнопку <gui>Масштаб</gui> в левой части ползунка масштаба. Другой способ сделать это — воспользоваться комбинацией клавиш <keyseq><key>Ctrl</key><key>0</key></keyseq>.

source: <em>Warping</em> between zoom levels
ru: <em>Перемещение</em> между уровнями масштабирования

source: Using your mouse, you can also <em>warp</em> instantly from any zoom level to another in a single click. To do that, click anywhere on the zoom slider.
ru: С помощью мыши также можно мгновенно <em>перемещаться</em> от одного уровня масштабирования до другого всего по одному щелчку кнопки. Чтобы сделать это, просто щёлкните левой кнопкой мыши в любом месте на ползунке масштаба.

source: Moving the playhead
ru: Перемещение позиции воспроизведения

source: You can change the position of the playhead by clicking with the right mouse button anywhere on the ruler or on the timeline.
ru: Чтобы изменить позицию воспроизведения, щёлкните правой кнопкой мыши в любой области линейки на монтажном столе.

source: Jumping to an exact position
ru: Переход к точной позиции

source: You can jump to an exact position in the timeline by editing the time value shown in the playback toolbar (see description of <link xref="mainwindow">The main window</link>). To edit it, simply click on the widget, overwrite the value and hit <key>enter</key>. The value can represent either timecode or a frame number. Timecode has the following form: <em>hh:mm:ss.milisec</em> where hours are optional. To insert a frame number, overwrite the timecode with a plain number of the desired frame.
ru: Можно перейти к точной позиции на временной шкале, изменив значение времени, показываемое на панели инструментов воспроизведения (подробнее — в описании <link xref="mainwindow">главного окна</link>). Чтобы изменить его, нажмите на виджет, измените значение и нажмите клавишу <key>Enter</key>. Значением может быть либо временной код, либо номер кадра. Временной код должен иметь следующий вид: <em>чч:мм:сс.милисек</em>, час указывать не обязательно. Чтобы вставить номер кадра, просто введите соответствующую цифру.

source: Scrubbing
ru: Перемотка

source: <em>Scrubbing</em> is a way of moving the playhead that allows you to:
ru: <em>Перемотка</em> — это способ перемещения позиции воспроизведения, позволяющий:

source: Search for a specific position in time by approximation/trial and error.
ru: Находить правильную позицию времени методом проб и ошибок.

source: Review repeatedly the visual motion in a scene by moving back and forth in time.
ru: Несколько раз просматривать один фрагмент, передвигаясь вперёд и назад по временной шкале.

source: To scrub, click on the ruler with the right mouse button and move the mouse with the button still held down.
ru: Чтобы перемотать, щёлкните правой кнопкой мыши по линейке и, удерживая кнопку нажатой, перетащите курсор.

source: Using presets in rendering and project settings.
ru: Использовать предустановки в сборке и параметрах проекта.

source: Presets
ru: Предустановки

source: Both the <gui>Project settings</gui> dialog and the <gui>Rendering</gui> dialog allow you to save presets for later use. If you often deal with the same kind of project settings, with different cameras or target devices for rendering, you may want to create custom presets.
ru: Диалоги <gui>Параметры проекта</gui> и <gui>Сборка</gui> позволяют сохранить предустановки для последующего использования. Если часто приходится иметь дело с одним и тем же видом параметров проекта, но с разными камерами или целевыми устройствами для сборки, можно создать собственные предустановки.

source: In project settings, video presets and audio presets are independent of each other.
ru: В параметрах проекта предустановки видео и предустановки аудио не зависят друг от друга.

source: Creating and editing presets
ru: Создание и изменение предустановок

source: To create a preset:
ru: Чтобы создать предустановку:

source: Change the settings to your liking.
ru: Измените параметры на своё усмотрение.

source: At the right of the presets combobox click <guiseq><gui>Menu button</gui><gui>New</gui></guiseq>. If this option is deactivated, skip to the next step.
ru: Справа от раскрывающегося списка с предустановками нажмите <guiseq><gui>Кнопку меню</gui><gui>Новая предустановка</gui></guiseq>. Если эта функция неактивна, переходите к следующему шагу.
