Repository: hekimoghlu/OpenSystem
Catalog: src/*/pitivi/help/*/*.po
Languages: ru

# _
source: translator-credits
ru: Мария Шикунова

source: Current state of this user manual and call for participation.
ru: Текущее состояние данного руководства пользователя и призыв к участию в его развитии.

source: About this manual
ru: Об этом руководстве

source: This user manual is written and maintained by Jean-François Fortin Tam.
ru: Это руководство пользователя написано и поддерживается Jean-François Fortin Tam.

source: Work in progress
ru: Работа в процессе

source: You may encounter unwritten portions due to features that have not yet been implemented in Pitivi at the time of writing.
ru: Некоторые функции Pitivi могут быть не задокументированы на момент написания этого руководства.

source: You may also encounter smaller areas which have been documented in this manual but have not been implemented in Pitivi – those are areas where the design and expected user interaction are quite narrow/certain.
ru: Может возникнуть и обратная ситуация: может встретиться описание некоторых функций Pitivi, которые ещё не реализованы — это области, внешний вид которых или механизм их работы уже определены.

source: Patches welcome
ru: Исправления приветствуются

source: If you happen to find errors, missing information or unclear passages in this manual, please feel free to submit corrections. You can find contact information on <link href="http://jeff.ecchi.ca/">my personal website</link>. You can also <link href="https://gitlab.gnome.org/GNOME/pitivi/issues?label_name%5B%5D=8.+User+Docs">file bugs in our bug tracker</link>.
ru: Если вы обнаружите ошибки, отсутствующую информацию или непонятные разъяснения, не стесняйтесь присылать исправления и вопросы. Контактная информация содержится на <link href="http://jeff.ecchi.ca/">личном веб-сайте автора</link>. Также можно <link href="https://gitlab.gnome.org/GNOME/pitivi/issues?label_name%5B%5D=8.+User+Docs">сообщать об ошибках в системе отслеживания ошибок</link>.

source: Keyboard shortcuts and cheatsheet
ru: Комбинации клавиш и шпаргалка

source: This page is a list of important shortcuts to access commonly used or hidden features. Take the time to get familiar with them as they will improve your productivity tremendously.
ru: Эта страница представляет собой список важных комбинаций клавиш для получения доступа к наиболее часто используемым или скрытым функциям. Рекомендуется ознакомиться с этим списком, так как он сможет помочь значительно улучшить эффективность работы с приложением.

source: General
ru: Общие

source: <keyseq><key>Ctrl</key><key>N</key></keyseq>: Create a new project
ru: <keyseq><key>Ctrl</key><key>N</key></keyseq>: Создать новый проект

source: <keyseq><key>Ctrl</key><key>O</key></keyseq>: Open a project file
ru: <keyseq><key>Ctrl</key><key>O</key></keyseq>: Открыть файл проекта

source: <keyseq><key>Ctrl</key><key>S</key></keyseq>: Save the current project
ru: <keyseq><key>Ctrl</key><key>S</key></keyseq>: Сохранить текущий проект

source: <keyseq><key>Ctrl</key><key>Q</key></keyseq>: Quit the application
ru: <keyseq><key>Ctrl</key><key>Q</key></keyseq>: Выйти из приложения

source: <keyseq><key>Ctrl</key><key>Z</key></keyseq>: Undo
ru: <keyseq><key>Ctrl</key><key>Z</key></keyseq>: Отменить действие

source: <keyseq><key>Ctrl</key><key>Shift</key><key>Z</key></keyseq>: Redo
ru: <keyseq><key>Ctrl</key><key>Shift</key><key>Z</key></keyseq>: Повторить действие

source: <key>F11</key>: Toggle fullscreen mode
ru: <key>F11</key>: Переключить полноэкранный режим

source: <key>F1</key>: Show the user manual
ru: <key>F1</key>: Открыть руководство пользователя

source: Media Library
ru: Библиотека медиафайлов

source: <key>Enter</key>: Preview (playback) the selected clip
ru: <key>Enter</key>: Предварительный просмотр (воспроизведение) выбранного клипа

source: <key>Insert</key>: Insert the selected clips into the timeline
ru: <key>Insert</key>: Вставить выбранные клипы на монтажный стол

source: <keyseq><key>Ctrl</key><key>Delete</key></keyseq>: Remove the selected clips from the project
ru: <keyseq><key>Ctrl</key><key>Delete</key></keyseq>: Удалить выбранные клипы из проекта

source: Timeline
ru: Монтажный стол

source: <key>Spacebar</key>: Toggle playback.
ru: <key>Пробел</key>: Переключить воспроизведение.

source: <key>S</key>: Split the clips at the current playhead position. If there are selected clips, only those will be split.
ru: <key>S</key>: Разрезать клип в позиции воспроизведения. Если в этот момент будут выбраны клипы, разрезаны будут только они.

source: <key>Delete</key>: Remove selected clips from the timeline.
ru: <key>Delete</key>: Удалить выбранные клипы с монтажного стола

source: <key>←</key> and <key>→</key>: Seek one frame backwards or forwards. This depends on your project framerate.
ru: <key>←</key> и <key>→</key>: Перейти вперёд или назад на один кадр. Зависит от кадровой частоты проекта.

source: <keyseq><key>Shift</key><key>←</key></keyseq> and <keyseq><key>Shift</key><key>→</key></keyseq>: Seek one second backwards or forwards.
ru: <keyseq><key>Shift</key><key>←</key></keyseq> и <keyseq><key>Shift</key><key>→</key></keyseq>: Перейти вперёд или назад на одну секунду.

source: <keyseq><key>Ctrl</key><key>+</key></keyseq> and <keyseq><key>Ctrl</key><key>-</key></keyseq>: Zoom in or zoom out. You can also use <key>Ctrl</key> with the mouse wheel to control the zoom more efficiently.
ru: <keyseq><key>Ctrl</key><key>+</key></keyseq> и <keyseq><key>Ctrl</key><key>-</key></keyseq>: Увеличить или уменьшить масштаб. Также можно использовать прокрутку колесом мыши при зажатой клавише <key>Ctrl</key>, что позволит изменять масштаб более эффективно.

source: <keyseq><key>Ctrl</key><key>0</key></keyseq>: Adjust the zoom to fit the timeline.
ru: <keyseq><key>Ctrl</key><key>0</key></keyseq>: Масштабировать по размеру монтажного стола.

source: <key>Shift</key>+drag: Ripple edit.
ru: <key>Shift</key>+перетаскивание: Монтаж со сдвигом.

source: <key>Ctrl</key>+drag: Roll edit.
ru: <key>Ctrl</key>+перетаскивание: Монтаж со смещением.

source: Viewer
ru: Просмотрщик

source: <key>'</key>: Toggle the safe areas
ru: <key>'</key>: Переключить границы отображения

source: What is the difference between OGG and Vorbis? AVI and DivX? x264 and H.264? Learn about codecs and container formats here.
ru: В чём разница между OGG и Vorbis? AVI и DivX? x264 и H.264? Информацию о кодеках и форматах контейнеров можно найти далее в этом руководстве.

source: Understanding codecs and containers
ru: Основная информация о кодеках и контейнерах

source: The distinction between codecs and container file formats is often ambiguous. This is in part due to the general lack of standardization, confusing marketing terms and filename extensions. This page attempts to clarify this distinction briefly and without going into technical details. If you want to learn more about containers and codecs, you should probably look at Wikipedia's page on <link href="http://en.wikipedia.org/wiki/Digital_container_format">containers</link> and <link href="http://en.wikipedia.org/wiki/Codec">codecs</link>.
ru: Разница между кодеками и форматами файлов-контейнеров часто неоднозначна. Отчасти это связано с отсутствием стандартов, сложными маркетинговыми терминами и расширениями файлов. Эта страница вкратце объясняет различия без углубления в технические детали. Чтобы узнать больше о контейнерах и кодеках, рекомендуется ознакомиться со статьями Википедии о <link href="http://en.wikipedia.org/wiki/Digital_container_format">контейнерах (англ.)</link> и <link href="https://ru.wikipedia.org/wiki/Кодек">кодеках</link>.

source: <em>Container</em> is what we typically associate with the file format. Containers "contain" the various components of a video: the stream of images, the sound, and anything else. For example, you could have multiple soundtracks and subtitles included in a video file, if the container format allows it. Example of popular containers are OGG, Matroska, AVI, MPEG.
ru: <em>Контейнер</em> — это то, что пользователи привыкли называть форматом файла. Контейнеры содержат различные компоненты видео: поток изображений, звук и что-нибудь ещё. Например, в видеофайле может содержаться несколько звуковых дорожек и встроенные субтитры, если формат контейнера это позволяет. Примерами подобных контейнеров являются OGG, Matroska, AVI, MPEG.

source: <em>Codecs</em> are ways of "coding" and "decoding" streams. Their job is typically to compress data (and decompress it when playing it back) so that you can store and transmit files with a smaller filesize. There are many codecs available out there, each with their strengths, weaknesses and peculiarities, and choosing the right codec with the right settings for the right situation is close to be a form of art in itself.
ru: <em>Кодеки</em> — это способ «кодирования» и «расшифровки» потоков. Они предназначены в основном для сжатия данных (и распаковывания при воспроизведении), чтобы можно было хранить и передавать файлы с меньшим размером. Доступно множество кодеков, каждый имеет свои сильные и слабые стороны, и выбор правильного кодека с правильными параметрами в определённой ситуации — это нечто подобное искусству.

source: The relationship between containers and codecs
ru: Связь между контейнерами и кодеками

source: Adding special effects to your video and audio clips
ru: Добавление спецэффектов к видео- и аудиоклипам

source: Introduction to effects
ru: Введение в эффекты

source: <app>Pitivi</app> offers a wide variety of video and audio effects to spice up your movies. Available effects depend on the software installed on your computer. If you don't see anything (or only a handful of effects) in the effect library, make sure that the <app>gnome-video-effects</app> package is installed on your system. Alternatively, you can look for packages containing GStreamer or frei0r effect plugins that are available in the repositories of your distribution.
ru: <app>Pitivi</app> предлагает большое количество аудио- и видеоэффектов, позволяющих улучшить создаваемые видео. Доступность тех или иных эффектов зависит от программного обеспечения, установленного на компьютере. Если в библиотеке эффектов ничего нет (или эффектов очень мало), убедитесь, что в системе установлен пакет <app>gnome-video-effects</app>. Помимо этого также можно найти пакеты, содержащие модули эффектов GStreamer или frei0r, доступные в репозиториях установленного дистрибутива.

source: Effects are non-destructive: they are only applied to the resulting rendered movie and do not affect your source files.
ru: Эффекты безобидны: они применяются только на уже обработанное видео и не влияют на исходные файлы.

source: Adding and removing effects to clips
ru: Добавление и удаление эффектов на клипах

source: To add an effect:
ru: Чтобы добавить эффект:

source: Select an existing clip on the timeline
ru: Выберите существующий клип на монтажном столе

source: Double-click an effect in the effect library
ru: Дважды щёлкните левой кнопкой мыши по эффекту в библиотеке

source: To remove an effect:
ru: Чтобы удалить эффект:

source: Select the effect you want to remove in the <guiseq><gui>middle pane</gui><gui>Clip</gui><gui>Effects</gui></guiseq>
ru: Выберите эффект, который необходимо удалить, на <guiseq><gui>средней панели</gui><gui>Клип</gui><gui>Эффекты</gui></guiseq>

source: Click the <gui>Remove effect</gui> button
ru: Нажмите кнопку <gui>Удалить эффект</gui>

source: Toggling effects
ru: Переключение эффектов

source: If you want to temporarily disable an effect (to compare with and without the effect, or for performance reasons), click the corresponding checkbox in the <guiseq><gui>middle pane</gui><gui>Clip</gui><gui>Effects</gui></guiseq>.
ru: Чтобы временно отключить эффект (чтобы сравнить, как видео будет выглядеть без эффектов, либо в целях улучшения производительности), установите соответствующий флажок на <guiseq><gui>средней панели</gui><gui>Клип</gui><gui>Эффекты</gui></guiseq>.

source: Ensuring you have the proper multimedia codecs and plugins installed for maximum compatibility.
ru: Убедитесь, что у вас установлены правильные мультимедийные кодеки и плагины для максимальной совместимости.

source: Gstreamer and compatibility
ru: Gstreamer и совместимость

source: A great strength of <app>Pitivi</app> lies in the fact that it uses the <app>GStreamer</app> multimedia framework. <app>GStreamer</app> is used by dozens of multimedia applications across desktop environments, operating systems and architectures.
ru: Большая сила <app>Pitivi</app> состоит в том, что он использует мультимедийную структуру <app>GStreamer</app>. <app>GStreamer</app> используется множеством мультимедийных приложений в различных окружениях рабочего стола, операционных системах и архитектурах.

source: For <app>Pitivi</app> users, this essentially means two things:
ru: Для пользователей <app>Pitivi</app> это значит две вещи:

source: You can, in theory, import pretty much any media file supported by <app>GStreamer</app> (see the sections below for more details).
ru: Теоретически можно импортировать практически любой медиафайл, поддерживаемый <app>GStreamer</app> (более подробная информация об этом будет представлена далее).

source: You can render your projects using any supported container and codec combination from <app>GStreamer</app>.
ru: Можно собирать проекты с использованием комбинаций кодека и контейнера от <app>GStreamer</app>.

source: To maximize <app>Pitivi</app>'s capabilities and reduce the possibilities of bugs, a very recent version of <app>GStreamer</app> is recommended. This is because <app>Pitivi</app> developers work hard on fixing problems directly in <app>GStreamer</app> instead of putting temporary workarounds inside <app>Pitivi</app>.
ru: Чтобы максимально использовать возможности <app>Pitivi</app> и уменьшить вероятность появления ошибок, рекомендуется использовать наиболее свежую версию <app>GStreamer</app>, потому что разработчики <app>Pitivi</app> исправляют ошибки напрямую в <app>GStreamer</app>, а не ставят временные заплатки в <app>Pitivi</app>.

source: A word about editing-friendly codecs
ru: Немного о кодеках, которые можно редактировать

source: Some formats, like <em>MPEG</em>, are oriented towards playback only, and do not compress each frame independently. While it is the goal of <app>Pitivi</app> to support working with these files, certain operations (like rapid seeking) will not perform as well as they would with frame-independent compressed video (such as <em>MJPEG</em> or <em>DV</em>).
ru: Некоторые форматы, такие как <em>MPEG</em>, предназначены только для воспроизведения, они не сжимают независимо каждый кадр. Хотя целью <app>Pitivi</app> является поддержка работы с этими файлами, определённые операции (наподобие быстрого перехода) не будут функционировать так же хорошо, как это происходит при работе с видеофайлами, сжатыми независимо от кадров (такими как <em>MJPEG</em> или <em>DV</em>).

source: The Good, the Bad and the Ugly
ru: Хороший, плохой, злой

source: <app>GStreamer</app> plugins come into three categories: good, bad and ugly. You may need to install plugins from any category to ensure compatibility with your media files. Whether or not you install them is up to you, and may depend on your country's jurisdiction regarding software patents. An overview of gstreamer plugins and their classification into categories can be found on the <link href="http://gstreamer.freedesktop.org/documentation/plugins.html">Gstreamer website</link>.
ru: Плагины <app>GStreamer</app> разделяются на три категории: «хорошие», «плохие», «злые». Может потребоваться установка плагинов из любой категории, чтобы обеспечить совместимость с используемыми медиафайлами. Решение, устанавливать их или нет, может зависеть как от конкретного пользователя, так и от юрисдикции страны в отношении патентов на программное обеспечение. Обзор плагинов Gstreamer и их классификация по категориям представлен на <link href="http://gstreamer.freedesktop.org/documentation/plugins.html">сайте Gstreamer</link>.

source: The "Good" plugins are high quality plugins under the LGPL license. These plugins are considered safe and recommended at any time. To install them, search for packages containing gstreamer plugins good in your distribution's repositories.
ru: «Хорошие» плагины — это плагины высокого качества, действующие по лицензии LGPL. Они считаются безопасными и всегда рекомендуются к установке. Чтобы установить их, найдите пакеты с плагинами «good» gstreamer в составе в репозиториях используемого дистрибутива.

source: The "Bad" plugins are plugins whose code quality is not good enough, or are not considered tested well enough. The licensing may or may not be LGPL. To install them, search for packages containing gstreamer plugins bad in your distribution's repositories.
ru: «Плохие» плагины — это плагины с не очень хорошим качеством кода, либо они не были должным образом проверены и, скорей всего, не лицензированы LGPL. Чтобы установить их, найдите пакеты с плагинами «bad» gstreamer в составе в репозиториях используемого дистрибутива.

source: The "Ugly" plugins are good quality plugins whose license is not LGPL or with licensing issues. To install them, search for packages containing containing gstreamer plugins ugly in your distribution's repositories.
ru: «Злые» плагины — это плагины хорошего качества, но не имеющие лицензию LGPL или в целом имеют проблемы с лицензированием. Чтобы установить их, найдите пакеты с плагинами «ugly» gstreamer в составе в репозиториях используемого дистрибутива.

source: In addition to the Good, Bad and Ugly plugins, you may want to install the <em>gstreamer-ffmpeg</em> package to have access to ffmpeg's set of codecs.
ru: Помимо «хороших», «плохих» и «злых» плагинов можно установить пакет <em>gstreamer-ffmpeg</em>, предоставляющий доступ к набору кодеков ffmpeg.

source: Image file formats
ru: Форматы файлов изображений

source: While it is not feasible to list every possible combination of supported video or audio formats, it is however possible to list the static image formats that can be imported: JPEG, PNG, JPEG 2000, PNM and SVG.
ru: Хотя невозможно перечислить все возможные комбинации поддерживаемых видео- или аудиоформатов, возможно представить список форматов статических изображений, которые можно импортировать: JPEG, PNG, JPEG 2000, PNM и SVG.

source: How to convert .mts and .m2ts files to a format that can be parsed by GStreamer and Pitivi.
ru: Как преобразовать файлы .mts и .m2ts в формат, который поддерживается GStreamer и Pitivi.

source: Dealing with AVCHD / MPEG-TS files
ru: Работа с файлами AVCHD / MPEG-TS

source: At the time being, MPEG Transport Stream files (usually with file extensions such as .mts, .m2ts and sometimes .mpg or .mpeg), such as those used by some HD camcorders, cannot be played reliably with <app>GStreamer</app>. As such, you may want to remux them in a different container format by using <app>ffmpeg</app>. To convert losslessly to an MPEG4 container, you can use the following command:
ru: В настоящее время файлы MPEG Transport Stream (обычно с такими расширениями как .mts, .m2ts и иногда .mpg или .mpeg), например файлы, используемые некоторыми HD-видеокамерами, невозможно надёжно воспроизвести с помощью <app>GStreamer</app>. В таком случае можно преобразовать их в другой формат контейнера с помощью <app>ffmpeg</app>. Чтобы преобразовать без потерь в контейнер MPEG4, можно использовать следующую команду:

source: Importing files into your project as clips.
ru: Импорт файлов в проект в качестве клипов.

source: Getting media
ru: Получение медиафайлов

source: Pitivi allows importing media files from your computer's hard drive.
ru: Pitivi позволяет импортировать медиафайлы с жёсткого диска используемого компьютера.

source: When you create a new project and import the first video file, its properties are transposed to the <link xref="workwithprojects#projectsettings">project settings</link>, unless you changed them yourself already. An infobar appears when this happens. Click the <gui>Project Settings</gui> button in the infobar for details.
ru: При создании нового проекта и импорте первого видеофайла его свойства переносятся в <link xref="workwithprojects#projectsettings">параметры проекта</link>, если пользователь не изменил их значения самостоятельно. При этом появляется информационная панель. Для получения боле подробной информации нажмите кнопку<gui>Параметры проекта</gui> на информационной панели.

source: Due to our limited resources and the rapid evolution of filmmaking hardware in the past few years, and to ensure <app>Pitivi</app> remains robust and simple to use, we do not attempt to support every possible hardware device out there. As a result, you currently cannot use <app>Pitivi</app> to capture directly from a camcorder; specialized applications are better suited for this task. For example, for DV/HDV camcorders using an IEEE 1394 connection, you may use <app>Kino</app> or <app>dvgrab</app> to capture footage.
ru: Из-за ограниченности ресурсов и быстрого развития оборудования для кинопроизводства, а также для того, чтобы приложение <app>Pitivi</app> оставалось надёжным и простым в использовании, разработчики не пытаются обеспечить поддержку всего существующего в мире оборудования. Поэтому в данный момент нельзя использовать <app>Pitivi</app> напрямую для захвата видео через видеокамеру; для этого больше подходят специальные приложения, например, для DV-/HDV-видеокамер, использующих соединение IEEE 1394, рекомендуется использовать <app>Kino</app> или <app>dvgrab</app> для захвата отснятого материала.

source: Importing files using the file chooser
ru: Импорт файлов с помощью диалога выбора файлов

source: You can import media into the <gui>Media Library</gui> by using the file chooser dialog, which has the advantage of letting you preview the files you want to import. To do so, use the <gui>Import</gui> button in the <gui>Media Library</gui> header.
ru: Можно импортировать медиафайлы в <gui>библиотеку медиафайлов</gui> с помощью диалога выбора файлов, преимущество которого заключается в возможности предварительного просмотра импортируемых файлов. Чтобы произвести импорт таким образом, нажмите кнопку <gui>Импорт</gui> на панели <gui>Библиотеки медиафайлов</gui>.

source: A file chooser dialog window will appear. You can press <key>Ctrl</key> or <key>Shift</key> to select multiple files at the same time.
ru: Появится диалог выбора файлов. Чтобы одновременно выбрать несколько файлов, выделяйте их, удерживая нажатой клавишу <key>Ctrl</key> или <key>Shift</key>.

source: How to work with unsupported media
ru: Как работать с неподдерживаемым типом медиафайлов

source: The following media containers and formats are officially supported:
ru: Официально поддерживаются следующие контейнеры и форматы медиафайлов:

source: Containers: MJPEG, Matroska, Ogg, QuickTime, WebM
ru: Контейнеры: MJPEG, Matroska, Ogg, QuickTime, WebM

source: Audio formats: FLAC, MPEG, Raw, Vorbis, WAV
ru: Форматы аудио: FLAC, MPEG, Raw, Vorbis, WAV

source: Video formats: H.264, JPEG, Raw, Theora, VP8
ru: Форматы видео: H.264, JPEG, Raw, Theora, VP8
