Repository: hekimoghlu/OpenSystem
Catalog: src/*/pitivi/help/*/*.po
Languages: ru

source: The project settings define mainly how the video appears while you edit the project. The video resolution affects how much detail the previewer can show. If the resolution of the project does not match that of your footage, the video may look letterboxed. These settings can be changed at any time by using <guiseq><gui>App menu</gui><gui>Project Settings</gui></guiseq>.
ru: Параметры проекта в основном позволяют определить, как выглядит видео при редактировании проекта. Разрешение видео определяет, как много деталей сможет показать средство просмотра. Если разрешение проекта не соответствует разрешению используемых видеоматериалов, видео может иметь черные полосы. Эти параметры можно в любое время изменить с помощью <guiseq><gui>Меню приложения</gui><gui>Параметры проекта</gui></guiseq>.

source: When you import the first video file the project settings are automatically changed to match. See <link xref="importing">Getting media</link> for details.
ru: При импорте первого видеофайла параметры проекта автоматически устанавливаются в соответствии с данными этого файла. Более подробная информация содержится в разделе <link xref="importing">Получение медиафайлов</link>.

source: Preventing cropping of essential content on television screens
ru: Предотвращение обрезки основного содержимого на экранах телевизоров

source: Depending on how a television is built, the video may be cropped when being displayed on its screen. The essential content can be placed in the <em>action-safe area</em>, which is a centered rectangular area safe from cropping. Similarly, titles can be placed in the smaller <em>title-safe area</em> to prevent the text sticking to the screen edges.
ru: В зависимости от типа экрана телевизора, видео может быть обрезано при отображении. Важное содержимое видеоряда можно поместить в <em>границы отображения</em>, которые находится в центре прямоугольника, защищённого от обрезки. Таким же образом субтитры можно поместить в соответствующие <em>границы отображения</em>, чтобы они не оказались обрезаны по краям экрана.

source: The safe areas are displayed on the <gui>viewer</gui> as an overlay and will not affect the video of a project. The size of the action-safe area and the title-safe area can be specified in the <link xref="#projectsettings">Project Settings</link>. For example, a size of 90% vertical × 80% horizontal corresponds to a 5% margin at the top and bottom and a 10% horizontal margin at the left and right of the video. Producers use their own guidelines since no television standard defines the <link href="https://en.wikipedia.org/wiki/Safe_area_(television)">safe areas</link>.
ru: Границы отображения показаны в <gui>средстве просмотра</gui> в качестве наложения, и они не будут влиять на видео в проекте. Размер границ отображения для видео и для субтитров можно указать в <link xref="#projectsettings">Параметрах проекта</link>. Например, размер 90% по вертикали × 80% по горизонтали соответствует отступу в 5% от верхней и нижней границы и 10% горизонтальному отступу слева и справа от видео. Продюсеры используют собственные рекомендации, потому что телевизионных стандартов, указывающих <link href="https://ru.wikipedia.org/wiki/Границы_отображения">границы отображения</link>, не существует.

source: To toggle Safe Areas on and off, press <key>'</key>.
ru: Чтобы переключить границы отображения, нажмите клавишу <key>'</key>.
