Repository: hekimoghlu/OpenSystem
Catalog: src/*/pitivi/help/*/*.po
Languages: ru

source: Give your preset a unique name: click on the combobox to edit the name. When you're done, press <key>Enter</key>.
ru: Задайте предустановке уникальное имя: для этого нажмите на текстовое поле. После этого нажмите клавишу <key>Enter</key>.

source: To edit a preset:
ru: Чтобы изменить предустановку:

source: Select your preset in the presets combobox.
ru: Выберите свою предустановку в соответствующем раскрывающемся списке.

source: Click at the right of the presets combobox <guiseq><gui>Menu button</gui><gui>Save</gui></guiseq>.
ru: Нажмите на <guiseq><gui>Кнопку меню</gui><gui>Сохранить</gui></guiseq> справа от раскрывающегося списка предустановок.

source: To remove a preset, simply select it in the presets combobox and click <guiseq><gui>Menu button</gui><gui>Remove</gui></guiseq>.
ru: Чтобы удалить предустановку, выберите её в раскрывающемся списке предустановок и нажмите <guiseq><gui>Кнопку меню</gui><gui>Удалить</gui></guiseq>.

source: Limiting the resolution of a rendering preset
ru: Ограничение разрешения при сборке предустановки

source: If you want to make a preset with a fixed maximum resolution, you need to edit the preset file with a text editor. Presets files are typically stored in ~/.local/share/pitivi/ ; since many devices don't have a maximum resolution, the width/height are set to 0 (unlimited) by default. You can change these values to the maximum resolution of your target device.
ru: Чтобы сделать предустановку с фиксированным максимальным разрешением, необходимо изменить файл предустановки в текстовом редакторе. Обычно предустановки хранятся в каталоге ~/.local/share/pitivi/; так как у большого количества устройств нет ограничений по максимальному разрешению, значения высоты и ширины по умолчанию соответствуют 0. Эти значения можно изменить для целевого устройства.

source: Learn the difference between saving a project and exporting a rendered movie.
ru: Разница между сохранением проекта и экспортом собранного фильма.

source: Understanding rendering
ru: Основная информация о сборке

source: Rendering is the process of exporting your project into a new, finalized media file. Rendering only creates a new “rendered” video file, and does not affect the project itself; you can still make edits to your project and render again as many times as needed.
ru: Сборка — это процесс экспорта проекта в новый финальный медиафайл. Сборка позволяет создать новый «обработанный» видеофайл, и она не влияет на сам файл проекта; всё так же можно вносить изменения в проект и запускать процесс сборки столько раз, сколько требуется.

source: Click <guiseq><gui>Headerbar</gui><gui>Render</gui></guiseq>.
ru: Нажмите <guiseq><gui>Панель заголовка</gui><gui>Сборка</gui></guiseq>.

source: Choose the location and name of the exported file.
ru: Выберите расположение и имя экспортированного файла.

source: Optionally choose a preset.
ru: Выберите предустановку (необязательно).

source: Choose a container. See the <link xref="codecscontainers">codecs and containers</link> page for details.
ru: Выберите контейнер. Более подробная информация представлена на странице <link xref="codecscontainers">«кодеки и контейнеры»</link>.

source: Adjust the various encoding settings.
ru: Отрегулируйте различные параметры кодировки.

source: Click the <gui>Render</gui> button.
ru: Нажмите кнопку <gui>Сборка</gui>.

source: While rendering, you can pause the process by clicking the <gui>Pause</gui> button and unpause it by clicking it again. You can also stop rendering either by clicking the <gui>Cancel</gui> button or by pressing <key>Esc</key>. If you stop the rendering process, the already rendered part of the project will be saved at the specified location. You might be able to use a partially rendered file, depending on the specified container format. A new render operation cannot resume from a partially rendered file.
ru: При сборке можно приостановить процесс нажатием кнопки <gui>Пауза</gui> и возобновить повторным нажатием. Также можно остановить сборку с помощью кнопки <gui>Отмена</gui> или клавиши <key>Esc</key>. При остановке процесса сборки уже обработанная часть проекта будет сохранена в отдельном месте. В зависимости от указанного формата контейнера, такой файл, возможно, удастся использовать в работе. Продолжить сборку частично собранного файла нельзя.

source: If your computer is set to suspend or hibernate automatically, <app>Pitivi</app> will automatically inhibit the power saving features during the render process.
ru: Если компьютер настроен на автоматический переход в ждущий или спящий режим, <app>Pitivi</app> автоматически отключит функции энергосбережения при сборке.

source: Project settings and the rendering dialog
ru: Параметры проекта и диалог сборки

source: The <gui>Project Settings</gui> are a base on which the <gui>Rendering dialog</gui> settings are applied when performing a render. The <gui>Project Settings</gui> are kept separate because they also determine how you preview the project while editing it. The values specified in the <gui>Rendering dialog</gui> are temporary and used only at render time. Because they are so closely related, the <gui>Rendering dialog</gui> has a button which opens the <gui>Project Settings</gui>.
ru: <gui>Параметры проекта</gui> — это основа, на основании которой применяются параметры <gui>диалога сборки</gui> при непосредственной сборке. <gui>Параметры проекта</gui> хранятся отдельно, потому что они позволяют просмотреть, как выглядит проект при его редактировании. Значения, указанные в <gui>диалоге сборки</gui>, временные и используются только во время самой сборки. Так как они очень тесно связаны между собой, <gui>диалог сборки</gui> имеет кнопку, которая открывает <gui>Параметры проекта</gui>.

source: Saving a snapshot of the current frame
ru: Сохранение снимка текущего кадра

source: You can use <guiseq><gui>Menu button</gui><gui>Export current frame...</gui></guiseq> to save a copy of the current frame as an image file.
ru: <guiseq><gui>Кнопка меню</gui><gui>Экспортировать текущий кадр...</gui></guiseq> позволяет сохранить копию текущего кадра в виде файла изображения.

source: Currently, PNG and JPEG are supported as file formats. The image resolution will match the project settings and any effect or transformation will also be applied to the resulting image.
ru: В текущей версии в качестве форматов файлов поддерживаются PNG и JPEG. Разрешение изображения будет соответствовать параметрам проекта, и к полученному изображению также будут применены любые эффекты или преобразования.

source: Making selections and grouping clips in timeline.
ru: Выделение и группировка клипов на монтажном столе.

source: Selection and grouping
ru: Выделение и группирование

source: Making selections
ru: Выделение

source: By selecting a clip, you specify what item should the subsequent actions be applied to. Selecting multiple clips allows you to apply actions (dragging, deleting, grouping, etc.) to all of them at once. To select an individual clip, simply click it.
ru: При выборе клипа определяется, к какому элементу следует применять последующие действия. Выделение нескольких клипов позволяет применять действия (перетаскивание, удаление, группировка и так далее) ко всем выбранным одновременно. Чтобы выбрать отдельный клип, нажмите на него.

source: To select multiple adjacent clips you can click the timeline anywhere in an empty region and drag. Alternatively, you can:
ru: Чтобы выбрать несколько соседних клипов, щёлкните левой кнопкой мыши в любой пустой области монтажного стола и перетащите курсор. Либо воспользуйтесь следующими способами:

source: Click the first clip.
ru: Нажмите на первый клип.

source: Hold the <key>Shift</key> key.
ru: Нажмите и удерживайте клавишу <key>Shift</key>.

source: Click the last clip.
ru: Нажмите на последний клип.

source: When selecting a clip by clicking or when selecting multiple adjacent clips, the selection is reset. The rest of the clips become deselected if they were previously selected. Selecting or deselecting specific clips without resetting the selection can be done by toggling individually a clip's selection:
ru: При выборе клипа щелчком левой кнопкой мыши или при выборе нескольких соседних клипов выделение сбрасывается. Выбранные ранее клипы становятся невыделенными. Выделение или отмену выделения определённых клипов без сброса выбора можно произвести с помощью переключения выделения клипа:

source: Hold down the <key>Ctrl</key> key.
ru: Нажмите и удерживайте клавишу <key>Ctrl</key>.

source: Click on each clip you want to toggle the selection.
ru: Нажимайте на каждый клип, чьё выделение необходимо переключить.

source: To clear the selection, click anywhere on the timeline in an empty region.
ru: Чтобы очистить выделение, щёлкните левой кнопкой мыши в любом пустом месте монтажного стола.

source: By default, clicking in the timeline changes the selection and also moves the playhead. To have a better control of the playhead you can disable seeking when left-clicking. This way left-clicking only changes the selection and the playhead position won't be lost when you make selections. This can be specified at <guiseq><gui>Menu button</gui><gui>Preferences</gui><gui>Left click also seeks</gui></guiseq>. You can still use right-click to move the playhead, as before, see <link xref="movearoundtimeline#movingplayhead"/> for details.
ru: По умолчанию щелчок левой кнопкой мыши внутри монтажного стола меняет выделение и перемещает позицию воспроизведения. Чтобы лучше работать с позицией воспроизведения, можно отключить перемотку по щелчку левой кнопкой мыши. В таком случае щелчок левой кнопкой мыши только изменит выделение, и при выделении позиция воспроизведения изменяться не будет. Такое поведение можно настроить через <guiseq><gui>Кнопку меню</gui><gui>Параметры</gui><gui>Тоже щелчком левой кнопки мыши</gui></guiseq>. При этом позицию воспроизведения можно перемещать с помощью правой кнопки мыши, подробнее: <link xref="movearoundtimeline#movingplayhead"/>.

source: Grouping and ungrouping clips
ru: Группировка и разгруппировка клипов

source: Pitivi allows you to combine
ru: Pitivi позволяет объединять

source: audio and video into clips, and
ru: аудио и видео в клипы, а также

source: multiple clips into groups.
ru: различные клипы в группы.

source: This means you can edit multiple pieces of media together, such as moving them along the timeline together. This section shows you how to group and ungroup audio and video tracks within clips, and also how to group and ungroup multiple clips together.
ru: Это означает, что можно одновременно редактировать несколько фрагментов мультимедиа, например, одновременно перемещать их по монтажному столу. В этом разделе представлена информация о том, как группировать и разгруппировать аудио- и видеодорожки в клипах или сами клипы вместе.

source: Grouping clips in timeline:
ru: Группировка клипов на монтажном столе:

source: Select multiple clips in the timeline.
ru: Выберите несколько клипов на монтажном столе.

source: Click the <gui>Group clips</gui> button on the timeline toolbar, or press <keyseq><key>Ctrl</key><key>G</key></keyseq>.
ru: Нажмите кнопку <gui>Группировать клипы</gui> на панели инструментов монтажного стола, либо воспользуйтесь комбинацией клавиш <keyseq><key>Ctrl</key><key>G</key></keyseq>.

source: You can now select, edit and move the clips all at once.
ru: Теперь можно выделять, редактировать и перемещать сразу несколько клипов.

source: Ungrouping clips in timeline:
ru: Разгруппировка клипов на монтажном столе:

source: Select a group of clips in the timeline.
ru: Выберите группу клипов на монтажном столе.

source: Click the <gui>Ungroup clips</gui> button on the timeline toolbar, or press <keyseq><key>Ctrl</key><key>Shift</key><key>G</key></keyseq>.
ru: Нажмите кнопку <gui>Разгруппировать клипы</gui> на панели инструментов монтажного стола, либо воспользуйтесь комбинацией клавиш <keyseq><key>Ctrl</key><key>Shift</key><key>G</key></keyseq>.

source: You can now select, edit and move the clips independently.
ru: Теперь можно выделять, изменять и перемещать клипы независимо друг от друга.

source: Dividing clips in two parts.
ru: Разделение клипов на две части.

source: Splitting
ru: Разделение

source: As the name implies, splitting a clip divides it into two adjacent clips, with new beginning/end points being created accordingly.
ru: Как очевидно из названия, разделение клипа делит его на две соседние части, при этом соответственно создаются новые точки начала и конца.

source: In <app>Pitivi</app>, splitting is a “non-modal” operation; this means that you do not have to “activate” a particular tool before doing the split action. Splitting occurs where the playhead is currently located (see also <link xref="movearoundtimeline">Moving the playhead</link>). Combined with zooming, frame-by-frame seeking with the keyboard or scrubbing, modeless splitting is not only fast and efficient, it is also very accurate.
ru: В <app>Pitivi</app> разделение является «немодальным» действием; это значит, что перед разделением не требуется использовать определённый инструмент. Разделение производится в том месте, где находится позиция воспроизведения (также изучите раздел <link xref="movearoundtimeline">Перемещение позиции воспроизведения</link>). В сочетании с масштабированием, покадровым поиском с помощью клавиатуры или прокруткой немодальное разделение является не только быстрым и эффективным инструментом, но и очень точным.

source: For example, to split a single clip:
ru: Пример разделения одного клипа:

source: Click on the clip to select it.
ru: Нажмите на клип, чтобы его выбрать.

source: Reposition the playhead where you want to split (if needed).
ru: Переместите позицию воспроизведения туда, где нужно разделить клип (при необходимости).

source: Click on the <gui>Split</gui> button on the timeline toolbar or press <key>S</key>.
ru: Нажмите на кнопку <gui>Разделить</gui> на панели инструментов монтажного стола или нажмите клавишу <key>S</key>.

source: Only the clips under the playhead can be split, depending on the current selection:
ru: Клипы можно разделить только в позиции воспроизведения в зависимости от текущего выделения:

source: If clips are selected, only the selected clips under the playhead are split.
ru: Если есть выделенные клипы, будут разделены клипы только на позиции воспроизведения.

source: If the selection is empty, all the clips under the playhead are split.
ru: Если нет выделенных клипов, разделены будут все клипы на позиции воспроизведения.

source: See how to select clips in <link xref="selectiongrouping#selection">Selection and grouping</link>.
ru: Информация о том, как выделять клипы, содержится в разделе <link xref="selectiongrouping#selection">Выделение и группировка</link>.

source: Cutting out the middle
ru: Вырезание средней части

source: When you want to cut out a middle section of a clip, split the clip twice on the positions where the part you want to remove begins and ends. Select the middle part and hit <key>Delete</key>. Now, eliminate the empty space between the remaining two parts by moving one of them towards the other until they snap.
ru: Чтобы вырезать среднюю часть клипа, дважды разделите клип на позиции, где начинается и заканчивается часть, которую нужно удалить. Выделите среднюю часть и нажмите клавишу <key>Удалить</key>. Соедините оставшиеся части клипа вместе, чтобы избавиться от пустого места, образовавшегося после вырезания.

source: What kind of hardware is needed to do video editing?
ru: Какое оборудование требуется для редактирования видеозаписей?

source: System requirements
ru: Системные требования

source: In terms of hardware, video editing typically requires a powerful computer, depending on the type of video you are editing. While the processing power of computers has increased tremendously over the years, so has demand for higher quality video. Editing HD (High Definition) video usually requires (at the time of this writing) state of the art hardware (depending on the codec used), while SD (Standard Definition) video editing can be done on modest hardware configurations. It is up to you to make sure that your equipment is adequate. It should at least be able to playback your media in <app>Totem</app> without lagging.
ru: Что касается оборудования, для монтажа видео обычно требуется мощный компьютер, в зависимости от типа редактируемого видео. Как вычислительная мощность компьютеров значительно возросла за последние годы, так и вырос спрос на видео более высокого качества. Для монтажа видео HD-качества обычно требуется самое современное оборудование (в зависимости от используемого кодека), а монтаж видео SD-качества можно осуществлять на более скромной конфигурации оборудования. Рекомендуется убедиться, что оборудование соответствует требованиям. Как минимум оно должно воспроизводить медиафайлы в <app>Totem</app> без ошибок.

source: Here are some general hardware recommendations:
ru: Далее представлены рекомендуемые требования к оборудованию:

source: Modern quad core CPU
ru: Современный четырёхъядерный процессор

source: Solid state drive
ru: Твердотельный накопитель

source: Intel graphic cards tend to work without problems
ru: Графические карты Intel, как правило, работают без проблем

source: Full HD (1920x1080) capable monitor (resolutions below 1024x768 are not supported)
ru: Монитор с поддержкой Full HD (1920x1080) (разрешения ниже 1024x768 не поддерживаются)

source: It is possible, however, to use low-quality versions of your footage during editing and use the high-quality versions when rendering the final output, thus allowing to bypass hardware limitations to some extent. This is called <em>proxy editing</em>. This feature, however, is not yet available in <app>Pitivi</app>.
ru: Можно использовать низкокачественные версии материалов во время монтажа и использовать высококачественные версии при сборке конечной версии, что позволяет в некоторой степени обойти аппаратные ограничения. Это называется <em>прокси-редактированием</em>. Однако эта функция пока недоступна в <app>Pitivi</app>.

source: You can track the state of proxy editing in <app>Pitivi</app> through <link href="https://gitlab.gnome.org/GNOME/pitivi/issues/743">task 743</link>.
ru: Отслеживать состояние реализации редактирования промежуточных клипов в <app>Pitivi</app> можно в <link href="https://gitlab.gnome.org/GNOME/pitivi/issues/743">задании 743</link>.

source: Software requirements are covered in <link xref="gstreamer">Gstreamer and compatibility</link> and <link xref="effects">Introduction to effects</link>.
ru: Требования к оборудованию описаны в разделах <link xref="gstreamer">Gstreamer и совместимость</link> и <link xref="effects">Введение в эффекты</link>.

source: Applying crossfades, fade-ins, fade-outs and other types of transitions.
ru: Использование переходов со звуком, нарастания, затухания и других типов переходов.

source: Transitions
ru: Переходы

source: Crossfading clips
ru: Клипы со звуковым переходом

source: To do a crossfade between two clips on the same layer, simply drag one of the clips onto the other so that it overlaps. The overlapping region will be used as a space for transition between the two clips. You can adjust the length of the transition either by moving the clips or by trimming them. If you want to apply other types of transitions than the default (crossfade), see the <em>Other types of transitions</em> section on this page.
ru: Чтобы сделать звуковой переход между двумя клипами на одном слое, перетащите один из клипов на другой, чтобы они наложились друг на друга. Область наложения будет использоваться как область для перехода между двумя клипами. Можно отрегулировать длину перехода, перемещая клипы или обрезая их. Чтобы узнать, как использовать другие типы переходов, отличные от стандартного, ознакомьтесь с разделом <em>Другие типы переходов</em> на этой странице.

source: Crossfades are achieved using <app>Pitivi</app>'s video mixing features, which use keyframes to control the opacity of clips. This means that if you set opacity keyframes for a clip, they will be taken into account for the crossfade.
ru: Переходы со звуком достигаются с помощью возможности <app>Pitivi</app> смешивать видео, которая использует ключевые кадры для управления непрозрачностью клипов. Это значит, что непрозрачность ключевых кадров клипа учитывается при добавлении стандартного перехода.

source: Other types of transitions
ru: Другие типы переходов

source: Assuming that you have two overlapping clips in your timeline, you can achieve other types of transitions by following these steps:
ru: Предполагая, что на монтажном столе есть два накладывающихся друг на друга клипа, можно добиться других типов переходов, выполнив следующие действия:

source: Select the overlapping region by clicking on it.
ru: Выберите область с наложением, щёлкнув по ней левой кнопкой мыши.

source: Select the <gui>Transition</gui> tab in the middle pane.
ru: Выберите вкладку <gui>Переход</gui> на средней панели.

source: Select one of the offered transitions.
ru: Выберите один из предлагаемых переходов.

source: The transitions can be further adjusted with the following options from the bottom of the <gui>Transition</gui> tab:
ru: Переходы далее можно настроить с помощью следующих функций вкладки <gui>Переход</gui>:

source: <em>Normal mode</em> will apply the transition in a linear fashion over the whole overlapping region. When in normal mode, you can adjust the degree of sharpness/smoothness of the transition.
ru: <em>Обычный режим</em> позволяет применить переход в линейном режиме на всей накладывающейся области. В обычном режиме можно регулировать степень резкости/плавности перехода.

source: <em>Loop</em> mode will apply the transition in a circular manner. When in loop mode, you can adjust the speed with which the transition will repeat itself.
ru: <em>Цикличный</em> режим позволяет применить переход в циклическом варианте. В этом режиме можно отрегулировать скорость, с которой переход будет повторяться.

source: In both modes, you can apply the transition in <em>reverse direction</em> by ticking the corresponding checkbox.
ru: В обоих режимах можно применить переход в <em>обратном направлении</em>, установив соответствующий флажок.

source: Each transition has its name and description. They are displayed when you hover the cursor over the transition icon. You can also filter the transitions by typing into the search entry at the top of the <gui>Transition</gui> tab. This will show only transitions whose name or description match your search terms.
ru: Каждый переход имеет своё имя и описание. Они показываются при наведении курсора мыши на значок перехода. Отфильтровать переходы можно посредством ввода текста в строку поиска в верхней части вкладки <gui>Переход</gui>. Фильтр покажет только те переходы, название или описание которых соответствуют условиям поиска.

source: Fade-ins and fade-outs
ru: Нарастание и затухание
