Repository: hekimoghlu/OpenSystem
Catalog: src/*/pitivi/help/*/*.po
Languages: ru

source: You can create fade-in and fade-out transitions in single clips by specifying their duration in the <gui>Compositing</gui> section of the <gui>Clip Properties</gui> panel. These can be fine-tuned by interacting with the <link xref="keyframecurves">Keyframe curve</link> controlling the clip's opacity. To understand opacity, see <link xref="layers">Understanding layers</link>. The following images illustrate how to fade a clip to black by editing the clip's keyframes:
ru: Чтобы создать переходы с нарастанием и затуханием в одиночных клипах, укажите длительность этих переходов в разделе <gui>Композитинг</gui> на панели <gui>Свойства клипа</gui>. Эти значения можно настроить с помощью <link xref="keyframecurves">кривой ключевого кадра</link>, определяющей непрозрачность клипа. Более подробная информация о непрозрачности представлена в разделе <link xref="layers">Основная информация о слоях</link>. Следующие изображения показывают, как сделать затухание клипа чёрным с помощью изменения ключевых кадров клипа:

source: Keyframe curves controlling the video opacity
ru: Кривые ключевых кадров, управляющие непрозрачностью видео

source: The default curve is flat indicating the same opacity at any position within the clip.
ru: Стандартная кривая представляет собой горизонтальную прямую, которая показывает одинаковый уровень непрозрачности во всех позициях клипа.

source: Adding a new keyframe
ru: Добавление ключевого кадра

source: Create a new keyframe by clicking the curve in a position where you want to start the fade-out.
ru: Чтобы создать ключевой кадр, нажмите на кривую в том месте, где необходимо включить затухание.

source: Moving the keyframe
ru: Перемещение ключевого кадра

source: Click and drag the last keyframe downwards.
ru: Нажмите и перетащите последний ключевой кадр вниз.

source: To achieve a fade-in, simply create a mirroring keyframe curve (new keyframe in a position where the fade-in should end and the first keyframe dragged down) at the beginning of the clip.
ru: Чтобы добавить нарастание, создайте отражённую зеркально кривую ключевого кадра (новый ключевой кадр в положении, где должно заканчиваться нарастание и обнуляться значение первого ключевого кадра) в начале клипа.

source: Fades and crossfading as described here can be applied to both audio and video clips.
ru: Переходы с нарастанием/затуханием и со звуком можно применить как к аудио-, так и к видеоклипам.

source: Shortening clips by changing the beginning and ending points. Also covers ripple and roll editing.
ru: Сокращение клипов путём обрезки начальных и конечных точек. Также рассматривается монтаж со сдвигом и со смещением.

source: Trimming
ru: Обрезка

source: <em>Trimming</em> is the act of changing the length of a clip by moving its beginning or end point in the timeline. Move the mouse cursor over the edge of a clip and a trimming handle will appear. Drag the trimming handle in an appropriate direction to either reduce or increase the length of the clip.
ru: <em>Обрезка</em> — это способ изменения длины клипа посредством перемещения его начальной или конечной точки на монтажном столе. Наведите курсор мыши на край клипа, чтобы появился элемент управления обрезкой. Перетащите элемент управления обрезкой в соответствующем направлении для уменьшения или увеличения продолжительности воспроизведения клипа.

source: Trimming handle
ru: Управление обрезкой

source: The mouse cursor transforms into trimming handle when hovering over the edge of a clip.
ru: Курсор мыши преобразовывается в курсор для обрезки при наведении на край клипа.

source: Clips that are grouped together, such as corresponding audio and video clips, will trim in unison when you drag the trimming handle. To trim only the audio or only the video clip, you need to ungroup them first (see the <link xref="selectiongrouping">Selection and grouping</link> page for instructions on how to do that).
ru: Сгруппированные клипы, например, сведённые аудио- и видеоклипы будут одновременно обрезаны при перетаскивании ползунка обрезки. Чтобы обрезать только аудио- или видеоклип, сначала необходимо их разгруппировать (более подробная информация о разгруппировке содержится в разделе <link xref="selectiongrouping">Выделение и группировка</link>).

source: Ripple editing
ru: Монтаж со сдвигом

source: Ripple editing is a variant of basic trimming which, in addition to trimming a clip, also moves the following clips (the clips that start after the one you're directly editing) so that their relative position to the edited clip stays the same.
ru: Монтаж со сдвигом — это вариант обрезки, при котором вместе с обрезкой одного клипа сдвигаются следующие клипы (те клипы, которые идут после редактируемого клипа), и таким образом их позиция относительно редактируемого клипа остаётся той же.

source: Before
ru: До

source: Relative position of two adjacent clips before ripple editing
ru: Относительная позиция двух соседних клипов до монтажа со сдвигом

source: After
ru: После

source: Relative position of two adjacent clips after ripple editing
ru: Относительная позиция двух соседних клипов после монтажа со сдвигом

source: Note that if there is a gap between the clips, the following clip moves toward the edited so that the gap length stays the same.
ru: Обратите внимание, что если между клипами есть промежутки, следующий клип будет перемещаться ближе к редактируемому таким образом, чтобы длина промежутка оставалась неизменной.

source: Ripple editing affects all following clips, regardless of whether or not they are on the same layer.
ru: Монтаж со сдвигом взаимодействует со всеми последующими клипами вне зависимости от того, находятся ли они на одном слое или нет.

source: To do a ripple edit:
ru: Чтобы произвести монтаж со сдвигом:

source: Place the mouse cursor on a trimming handle.
ru: Поместите курсор мыши на маркер обрезки.

source: Press and hold <key>Shift</key>.
ru: Нажмите и удерживайте клавишу <key>Shift</key>.

source: Drag the trimming handle.
ru: Перетащите ползунок обрезки.

source: Ripple editing can also be used when moving clips around in the timeline. For detailed explanations on how to do this, see the section <link xref="usingclips#ripple">Using ripple editing while moving clips</link>.
ru: Монтаж со сдвигом также можно использовать при перемещении клипов по монтажному столу. Более подробная информация об этом содержится в разделе <link xref="usingclips#ripple">Монтаж со сдвигом при перемещении клипов</link>.

source: Roll editing
ru: Монтаж со смещением

source: Roll editing is a variant of basic trimming which, in addition to trimming a clip, <em>trims</em> the adjacent clips in a complementary way to prevent creating gaps.
ru: Монтаж со смещением — это вариант обычной обрезки, которая, помимо обрезки клипа, <em>обрезает</em> соседние клипы, предотвращая образование промежутков.

source: Relative position of two adjacent clips before roll editing
ru: Относительная позиция двух соседних клипов до монтажа со смещением

source: Relative position of two adjacent clips after roll editing
ru: Относительная позиция двух соседних клипов после монтажа со смещением

source: Roll editing affects all adjacent clips, regardless of whether or not they are on the same layer.
ru: Монтаж со смещением применяется ко всем соседним клипам, независимо от того, находятся они на одном слое или нет.

source: To do a roll edit:
ru: Чтобы произвести монтаж со смещением:

source: Place the mouse cursor on a trimming handle between two adjacent clips.
ru: Поместите курсор мыши на маркер обрезки между двумя соседними клипами.

source: Press and hold <key>Ctrl</key>.
ru: Нажмите и удерживайте <key>Ctrl</key>.

source: Learn the difference between clips and files and how to do basic operations on clips in the timeline.
ru: Разница между клипами и файлами и как произвести основные операции на клипах на монтажном столе.

source: Using clips
ru: Использование клипов

source: Clips vs files
ru: Клипы и файлы

source: <em>Files</em> are data on your hard disk (videos, music, pictures, etc.) that can be accessed by <app>Pitivi</app> and incorporated in your video editing project.
ru: <em>Файлы</em> — это данные на жёстком диске (видео, музыка, картинки и так далее), к которым <app>Pitivi</app> может иметь доступ и которые используются в монтаже видео для проекта.

source: <em>Clips</em> are a visual representation of your files on the timeline. They represent the period of time they consume on the timeline and can be edited independently: each time you drag a file from the <gui>Media Library</gui> to the timeline, a new clip is created. As such, a file can be reused as much as you want to create any amount of different clips.
ru: <em>Клипы</em> — визуальное представление файлов на монтажном столе. Они представляют период времени, который файлы занимают на монтажном столе, и их можно редактировать независимо от оригинала: каждый раз при перетаскивании файла из <gui>Библиотеки медиафайлов</gui> на монтажный стол создаётся новый клип. Таким образом, файл можно повторно использовать столько раз, сколько необходимо, что позволяет создать любое количество различных клипов.

source: Since Pitivi is a non-destructive editor, clips are edited, not files. As such, your files stay intact.
ru: Так как Pitivi — безопасный редактор, редактируются клипы, а не файлы. Таким образом, сами файлы остаются нетронутыми.

source: Inserting clips
ru: Вставка клипов

source: From the <gui>Media Library</gui>, you can insert one or more clips by selecting them (use the <key>Ctrl</key> or <key>Shift</key> keys to select multiple clips) and doing one of the following:
ru: Один или несколько клипов можно вставить, выделив их из <gui>Библиотеки медиафайлов</gui> (для выделения нескольких клипов воспользуйтесь клавишами <key>Ctrl</key> или <key>Shift</key>) и выполнив одно из следующих действий:

source: Dragging and dropping them onto a place in the timeline.
ru: Перетащив клипы на монтажный стол.

source: Clicking the <gui>Insert the selected clips at the end of the timeline</gui> button in the <gui>Media Library</gui> header.
ru: Нажав кнопку <gui>Вставить выбранные клипы в конце монтажного стола</gui> в заголовке <gui>Библиотеки медиафайлов</gui>.

source: Pressing the <key>Insert</key> key.
ru: Нажав клавишу <key>Insert</key>.

source: When following the second and third options (clicking or pressing insert), the new clips will be inserted one after another on the longest layer of the timeline where the last clip ends.
ru: При использовании второго или третьего варианта (щелчок левой кнопкой мыши или нажатие кнопки «Вставить») новые клипы будут вставлены последовательно на самый длинный слой монтажного стола, где заканчивается последний клип.

source: Moving clips along the timeline
ru: Перемещение клипов по монтажному столу

source: You can move a clip within a layer or move it to a different layer.
ru: Можно переместить клип внутри слоя или переместить его на другой слой.

source: Click and drag a single clip to move it, and release the mouse button to place it. Dragging horizontally keeps the clip on the same layer, but dragging it vertically moves the clip to a different layer (see <link xref="layers">Understanding layers</link> for more information).
ru: Чтобы переместить клип, просто перетащите его на нужное место. При горизонтальном перетаскивании клип останется на том же слое, при вертикальном — переместится на соответствующий слой (более подробная информация об этом содержится в разделе <link xref="layers">Основная информация о слоях</link>).

source: To move a clip to an existing layer, drag it on the layer at the desired position and release it. To move a clip to a new layer, drag it to the middle space between two existing layers. Once the space between the respective layers is highlighted, release it.
ru: Чтобы переместить клип на существующий слой, перетащите его на нужный слой на желаемую позицию. Чтобы перетащить клип на новый слой, перетащите его в пространство между двумя существующими слоями. Как только область между соответствующими слоями окажется подсвечена, отпустите клип.

source: To move multiple clips at the same time, use the <key>Ctrl</key> or <key>Shift</key> keys to select multiple clips (see <link xref="selectiongrouping">Selection and grouping</link> for more details). Selected clips do not need to be on the same layer. Then, drag the clips just as you would do for a single clip; their position relative to each other will be preserved.
ru: Чтобы переместить несколько клипов одновременно, воспользуйтесь клавишами <key>Ctrl</key> или <key>Shift</key> для выделения нескольких клипов (более подробная информация об этом содержится в разделе <link xref="selectiongrouping">Выделение и группировка</link>). Выбранные клипы не обязательно должны находиться на одном слое. Затем перетащите клипы так же, как перетаскивается один клип; их положение относительно друг друга будет сохранено.

source: Using ripple editing while moving clips
ru: Монтаж со сдвигом при перемещении клипов

source: While dragging clips around in the timeline, you can use the <link xref="trimming#ripple">ripple technique</link> to move the <em>following</em> clips (the clips that start after the one you're directly editing) in sync with the moved clip.
ru: При перетаскивании клипов по монтажному столу можно использовать <link xref="trimming#ripple">технику монтажа со сдвигом</link> для перемещения <em>следующих</em> клипов (клипы, которые следуют за редактируемым клипом) синхронно с перемещённым клипом.

source: Click and drag the clip you want to move, with the mouse button held down
ru: Нажмите и удерживайте левую кнопку мыши на клипе, который необходимо перетащить, и начните само действие перетаскивания

source: During the drag, hold down <key>Shift</key> on the keyboard
ru: При перетаскивании нажмите и удерживайте клавишу <key>Shift</key>

source: Release the mouse button to end the drag operation, then release the <key>Shift</key> key.
ru: Отпустите кнопку мыши, чтобы закончить процедуру перетаскивания, а затем отпустите клавишу <key>Shift</key>.

source: You can release and press <key>Shift</key> at any time during the drag operation to disable or enable ripple editing.
ru: Чтобы включить или отключить монтаж со сдвигом, в любой момент операции с перетаскиванием нажмите или отпустите клавишу <key>Shift</key>.

source: Using Color Clips
ru: Использование цветовых клипов

source: You can create custom color clips using the <gui>Create a color clip</gui> button located in the <guiseq><gui>middle pane</gui><gui>Clip</gui></guiseq> tab. The button is available when no clip is <link xref="selectiongrouping#selection">selected</link>.
ru: Можно создать клипы с собственным цветом с помощью кнопки <gui>Создайте цветной ролик</gui>, расположенной на вкладке <guiseq><gui>средней панели</gui><gui>Клип</gui></guiseq>. Кнопка доступна, если не <link xref="selectiongrouping#selection">выбрано</link> ни одного клипа.

source: Select a color clip to change its color. When a new color clip is created, it is automatically selected. The color can be changed using the <guiseq><gui>middle pane</gui><gui>Clip</gui><gui>Color</gui></guiseq> expander. The <gui>color</gui> button opens a dialog for selecting a color or entering a hexadecimal color value. Alternatively, any color on the screen can be picked by using the <gui>color picker</gui> button.
ru: Выберите цветной клип, чтобы изменить его цвет. При создании нового цветного клипа он выделяется автоматически. Чтобы изменить цвет, воспользуйтесь пунктом меню <guiseq><gui>средней панели</gui><gui>Клип</gui><gui>Цвет</gui></guiseq>. Кнопка <gui>цвет</gui> открывает диалог для выбора цвета или ввода шестнадцатеричного цветового значения. Либо можно указать любой цвет с экрана, выделив его <gui>пипеткой</gui>.

source: Configuring effects and using Effect Library.
ru: Настройка эффектов и использование библиотеки эффектов.

source: Using effects
ru: Использование эффектов

source: Effect Library
ru: Библиотека эффектов

source: The <gui>Effect Library</gui> contains all audio and video effects available on the system. The library shows either audio or video effects depending on which button (<gui>Show video effects</gui> or <gui>Show audio effects</gui>) in its upper left corner is activated. Once you choose audio or video effects you can further sort them by choosing one of the categories from the drop down list next to the two buttons. By default, the list is set to show all effects.
ru: <gui>Библиотека эффектов</gui> содержит все аудио- и видеоэффекты, доступные в системе. Библиотека показывает тип эффекта в зависимости от нажатой в верхнем левом углу кнопки (<gui>Показывать видеоэффекты</gui> или <gui>Показывать аудиоэффекты</gui>) . После выбора типа эффектов их можно отсортировать, выбрав одну из категорий в раскрывающемся списке рядом с двумя кнопками. По умолчанию в списке отображаются все эффекты.

source: Alternatively, you can use the <gui>Search Bar</gui> that is shown at the top of the <gui>Effect Library</gui>. Typing into the search entry filters the contents of the <gui>Effect Library</gui> to show only effects whose name or description match your search terms. To reset the search entry, click the <gui>Clear</gui> icon in the search entry.
ru: Также можно использовать <gui>Панель поиска</gui>, расположенную в верхней части <gui>Библиотеки эффектов</gui>. Ввод текста в поисковую строку позволяет отфильтровать содержимое <gui>Библиотеки эффектов</gui>, чтобы отображались только эффекты, название или описание которых соответствует условиям поиска. Чтобы сбросить условия поиска, нажмите на значок <gui>Очистить</gui> в поле поискового запроса.

source: Configuring effects
ru: Настройка эффектов

source: To configure an effect, simply select it in the <guiseq><gui>middle pane</gui><gui>Clip</gui><gui>Effects</gui></guiseq>. The properties that can be adjusted will appear below in the same tab. Each variable can be put back to its original value by clicking the corresponding <gui>Reset to default value</gui> button.
ru: Чтобы настроить эффект, воспользуйтесь пунктом меню <guiseq><gui>Средней панели</gui><gui>Клип</gui><gui>Эффекты</gui></guiseq>. Свойства, которые можно изменить, появятся ниже в этой же вкладке. Каждую переменную можно вернуть к своему первоначальному значению с помощью соответствующей кнопки <gui>Сбросить в значение по умолчанию</gui>.

source: Animating effects with keyframes
ru: Анимирование эффектов ключевыми кадрами

source: The effect properties which can be controlled using keyframe curves have a <gui>Show keyframes for this property</gui> button in diamond shape. When you click it, the keyframe curves on the clip start controlling the respective property. You can now edit the keyframes to achieve the desired effect. Once you are done with editing, you can click the button again and the keyframe curve disappears from the clip. However, the effect property is still controlled by the adjusted keyframe curve (which is indicated by the filled shape on the button).
ru: Свойства эффектов, которые можно настраивать с помощью кривых ключевого кадра, имеют кнопку <gui>Показать ключевые кадры для этого свойства</gui> в форме ромба. При нажатии на эту кнопку кривые ключевого кадра в клипе начинают изменять соответствующее свойство. В таком случае можно редактировать ключевые кадры для достижения желаемого эффекта. Закончив редактирование, нажмите кнопку ещё раз, чтобы кривая ключевого кадра исчезла. При этом свойство эффекта по-прежнему будет зависеть от скорректированной кривой ключевого кадра (на которую указывает закрашенная фигура на кнопке).

source: Once a property becomes controlled, the widget for editing the property value directly is disabled. To remove the keyframes and be able to set again directly a constant value using the widget, you have to click the <gui>Reset to default value</gui> button. For more information on how to use keyframes see the <link xref="keyframecurves">Keyframe curves</link> page.
ru: Как только свойство станет управляемым, виджет редактирования значения свойства будет отключён. Чтобы убрать ключевые кадры и вернуть возможность указывать вручную постоянное значение с помощью виджета, нажмите кнопку <gui>Сбросить к значениям по умолчанию</gui>. Более подробная информация о том, как использовать ключевые кадры, содержится на странице <link xref="keyframecurves">Кривые ключевого кадра</link>.

source: If there is no <gui>Show keyframes for this value</gui> button next to the effect variable, it cannot be controlled with keyframes.
ru: Если рядом с переменной эффекта нет кнопки <gui>Показать ключевые кадры для этого значения</gui>, её нельзя настраивать с помощью ключевых кадров.

source: How to load and save projects, edit their settings and metadata.
ru: Загрузка и сохранение проектов, правка их параметров и метаданных.

source: Working with projects
ru: Работа с проектами

source: Saving a project
ru: Сохранение проекта

source: To save your project work, use the <gui>Save</gui> button in the header bar or press <keyseq><key>Ctrl</key><key>S</key></keyseq>. When you save a project for the first time, a dialog window appears, asking you where to save the project file and how to name it.
ru: Чтобы сохранить проектную работу, воспользуйтесь кнопкой <gui>Сохранить</gui> на панели заголовка или воспользуйтесь комбинацией клавиш <keyseq><key>Ctrl</key><key>S</key></keyseq>. При первом сохранении проекта появится диалог, предлагающий указать, куда следует сохранить файл проекта и какое имя ему задать.

source: If you want to save your project to a different file, use <guiseq><gui>App menu</gui><gui>Save as</gui></guiseq> or press <keyseq><key>Ctrl</key><key>Shift</key><key>S</key></keyseq>. This can be used to create different versions of your project.
ru: Чтобы сохранить проект в другом файле, воспользуйтесь пунктом <guiseq><gui>Меню приложения</gui><gui>Сохранить как</gui></guiseq> или комбинацией клавиш <keyseq><key>Ctrl</key><key>Shift</key><key>S</key></keyseq>. такой способ позволит создать несколько версий проекта.

source: Undoing and reverting changes
ru: Отмена и возврат изменений

source: To undo a change, simply click on the <gui>Undo</gui> button in the header bar or press <keyseq><key>Ctrl</key><key>Z</key></keyseq>. In addition to undoing individual changes, you can also decide to revert all the changes you have made since the last time you saved your project. To do so, use <guiseq><gui>App menu</gui><gui>Revert to saved version</gui></guiseq>.
ru: Чтобы отменить изменение, нажмите кнопку <gui>Отменить</gui> на панели заголовка, либо воспользуйтесь комбинацией клавиш <keyseq><key>Ctrl</key><key>Z</key></keyseq>. Помимо отмены определённых действий также можно отменить все изменения, которые были внесены в проект с момента его последнего сохранения с помощью пункта <guiseq><gui>Меню приложения</gui><gui>Вернуться к сохранённой версии</gui></guiseq>.

source: To redo changes that were undone, click on the <gui>Redo</gui> button in the header bar or press <keyseq><key>Ctrl</key><key>Shift</key><key>Z</key></keyseq>.
ru: Чтобы повторить действия, которые были отменены, нажмите кнопку <gui>Повторить</gui> на панели заголовка или воспользуйтесь комбинацией клавиш <keyseq><key>Ctrl</key><key>Shift</key><key>Z</key></keyseq>.

source: Editing the project settings
ru: Изменение параметров проекта
