Repository: hekimoghlu/OpenSystem
Catalog: src/*/pitivi/help/*/*.po
Languages: ru

source: Working with other containers and formats is slow and lacks precision. Fortunately most of the time the unsupported media can still be played. Taking advantage of this, <app>Pitivi</app> allows transcoding the unsupported media into a supported format. The result is a separate file placed in the same folder. The automatic creation of <em>optimized media</em> is controlled with the <gui>Optimize</gui> checkbox at the bottom of the <gui>file chooser dialog</gui>. The <em>optimized media</em> can be managed at any time with the <link xref="medialibrary">media library</link>.
ru: Работа с другими контейнерами и форматами производится медленно и неточно. К счастью, большую часть неподдерживаемых медиафайлов всё-таки можно воспроизвести. Пользуясь этим, <app>Pitivi</app> позволяет перекодировать неподдерживаемый медиафайл в поддерживаемый формат. В результате в ту же папку будет помещён отдельный файл. Автоматическое создание <em>оптимизированных медиафайлов</em> управляется флажком <gui>Оптимизировать</gui> в нижней части <gui>диалога выбора файлов</gui>. <em>Оптимизированными файлами</em> можно управлять в любое время с помощью <link xref="medialibrary">библиотеки медиафайлов</link>.

source: Most of the cameras nowadays create <code>.mts</code> and <code>.m2ts</code> files which use the MPEG Transport Stream container. This container is not optimal for video editing. This media is not supported as such and must be <em>optimized</em> for a smooth editing experience.
ru: Большинство фотоаппаратов в настоящее время создают файлы в формате <code>.mts</code> и <code>.m2ts</code>, которые используют контейнер MPEG Transport Stream. Этот контейнер не подходит для редактирования видео. Такие медиафайлы не поддерживаются как есть, и их необходимо <em>оптимизировать</em> для эффективной работы с ними.

source: Importing files using drag and drop
ru: Импорт файлов с помощью перетаскивания

source: The concept of drag and drop is a well-established method of bridging the gap between software applications. Simply select the files you want to import in another application (such as a file manager or a multimedia app) and drag them with your mouse onto <app>Pitivi</app>'s <gui>Media Library</gui>.
ru: Концепция перетаскивания — хорошо зарекомендовавший себя метод преодоления границ между приложениями. Просто выберите файлы, которые необходимо импортировать в другое приложение (например, в диспетчер файлов или мультимедийное приложение), и перетащите их с помощью мыши в <gui>Библиотеку медиафайлов</gui> <app>Pitivi</app>.

source: This feature can be used to:
ru: Эта функция полезна для:

source: Easily import music or video clips from a media player (such as <app>Rhythmbox</app> or <app>Totem</app>).
ru: Простого импорта музыкальных или видеоклипов из медиапроигрывателей (таких как <app>Rhythmbox</app> или <app>Totem</app>).

source: Allow using a full-fledged file manager (such as <app>Nautilus</app>, <app>Thunar</app>, <app>Dolphin</app> or <app>Konqueror</app>) instead of the file chooser dialog.
ru: Использования полнофункционального диспетчера файлов (такого как <app>Nautilus</app>, <app>Thunar</app>, <app>Dolphin</app> или <app>Konqueror</app>) вместо диалога выбора файлов.

source: Import a combination of multiple files and folders at the same time.
ru: Одновременного импорта нескольких файлов и папок.

source: Leverage the searching capability of another application (such as <app>GNOME Shell</app>, <app>Tracker</app>, <app>GNOME Activity Journal</app>, <app>GNOME Search Tool</app>, etc.).
ru: Использования возможностей поиска других приложений (таких как <app>GNOME Shell</app>, <app>Tracker</app>, <app>GNOME Activity Journal</app>, <app>GNOME Search Tool</app> и так далее).

# link:trail
source: Pitivi Quick Start Manual
ru: Руководство Pitivi для начинающих

# link
source: Pitivi Quick Start Manual
ru: Руководство Pitivi для начинающих

# text
source: Pitivi Quick Start Manual
ru: Руководство Pitivi для начинающих

source: <media type="image" width="48px" height="48px" src="figures/Pitivi.svg"/> Pitivi Video Editor
ru: <media type="image" width="48px" height="48px" src="figures/Pitivi.svg"/> Видеоредактор Pitivi

source: Built upon the <link href="http://en.wikipedia.org/wiki/GStreamer"><app>GStreamer</app></link> multimedia framework, <app>Pitivi</app> aims to be an intuitive and flexible video editor that integrates well with <link href="http://gnome.org"><app>GNOME</app></link> and can appeal to newbies and professionals alike.
ru: Разработанный на основе мультимедийной структуры <link href="http://en.wikipedia.org/wiki/GStreamer"><app>GStreamer</app></link>, <app>Pitivi</app> является интуитивно понятным и гибким видеоредактором, который хорошо интегрирован в <link href="http://gnome.org"><app>GNOME</app></link> и может понравиться как новичкам, так и профессионалам.

source: This guide is intended to help you grasp the concepts behind its design and get productive quickly.
ru: Это руководство помогает понять концепции, лежащие в основе приложения, и быстро приступить к работе.

source: Introduction
ru: Введение

source: Getting Started
ru: Начало работы

source: Basic Editing with the Timeline
ru: Базовое редактирование на монтажном столе

source: Effects and Transitions
ru: Эффекты и переходы

source: Exporting Your Finished Movie
ru: Экспорт законченного видео

source: Changing properties of a clip over time.
ru: Изменение свойств клипа во времени

source: Keyframe curves
ru: Кривые ключевого кадра

source: By using keyframe curves, you can change the value of a property over time, instead of having a fixed value for the entire duration of a clip. This can be used to change opacity or volume just as well as effect properties at any point in the clip's duration.
ru: Использование кривых ключевого кадра позволяет изменять значение свойства через какое-то время вместо сохранения фиксированного свойства на протяжении всего клипа. Эту функцию можно использовать для изменения непрозрачности или громкости, а также свойств эффекта в любой момент продолжительности клипа.

source: A terminological note:
ru: Примечание по терминам:

source: <em>Keyframes</em> are the points that are used to determine the property value at a specific point in time.
ru: <em>Ключевые кадры</em> — это точки, которые используются для определения значения свойства в определённый момент времени.

source: <em>Keyframe curves</em> are the lines connecting the points providing smooth transitions between them.
ru: <em>Кривые ключевых кадров</em> — это линии, соединяющие точки и обеспечивающие плавные переходы между ними.

source: By default, the keyframe curves on an audio clip control the volume (on a scale from 0 to 200%) and the keyframe curves on a video clip control the alpha (opacity) of the video (on a scale from 0 to 100%). See the <link xref="layers">Understanding layers</link> page for more details on opacity. The default alpha or volume keyframe curves are an intrinsic property of clips and cannot be removed.
ru: По умолчанию кривые ключевых кадров в аудиоклипах позволяют управлять громкостью (по шкале от 0 до 200%), а в видеоклипах — управлять альфа-каналом (непрозрачностью) видео (по шкале от 0 до 100%). Более подробная информация о непрозрачности содержится в разделе <link xref="layers">Основная информация о слоях</link>. Кривые альфа-каналов или громкость ключевых кадров по умолчанию являются внутренним свойством клипов, и их нельзя удалить.

source: You can create fade-in and fade-out transitions by controlling opacity and volume. See an example in the <link xref="transitions#fades">Transitions</link> page.
ru: Чтобы создать переходы с затуханием или нарастанием, настройте соответствующим образом непрозрачность и громкость. Примеры представлены на странице <link xref="transitions#fades">Переходы</link>.

source: Besides volume and alpha, you can use keyframes to control effect properties. See the <link xref="usingeffects#keyframes">Using effects</link> page for details.
ru: Помимо громкости и альфы ключевые кадры помогают настраивать свойства эффектов. Более подробно это описано на странице <link xref="usingeffects#keyframes">Использование эффектов</link>.

source: General usage
ru: Общее использование

source: The start and end keyframes are fixed to the start and end points of the clip and cannot be removed. The curve between these two keyframes is initially a flat horizontal line, indicating that the value of the controlled property is the same at each point in time within the clip's duration. To change the value (and the rate of its change) at any point, you can add one or more keyframes to the clip and drag them to appropriate vertical positions representing their values.
ru: Начало и конец ключевых кадров прикреплены к начальной и конечной позиции клипа, и их нельзя удалить. Кривая между этими двумя ключевыми кадрами изначально является плоской горизонтальной линией, говорящей о том, что значение контролируемого свойства одинаково в каждый момент времени всего клипа. Чтобы в любой момент изменить значение (и скорость его изменения), добавьте один или несколько ключевых кадров и перетащите их в соответствующие вертикальные позиции, представляющие их значения.

source: You can:
ru: Вы можете:

source: Add a new keyframe by clicking on the line.
ru: Добавить новый ключевой кадр, щёлкнув левой кнопкой мыши по линии.

source: Remove a keyframe by double-clicking on it.
ru: Удалить ключевой кадр двойным щелчком левой кнопкой мыши по нему.

source: Adjust the time and value of a keyframe by moving it with the mouse. When moving the keyframe, hold down <key>Ctrl</key> to lock the keyframe horizontally or vertically.
ru: Изменить время и значение ключевого кадра, переместив его с помощью мыши. При перемещении ключевого кадра нажмите и удерживайте клавишу <key>Ctrl</key>, чтобы заблокировать ключевой кадр горизонтально или вертикально.

source: Click-and-drag on a segment of a curve between two keyframes to adjust the vertical position of the segment.
ru: Перетащить сегмент кривой между двумя ключевыми кадрами, чтобы отрегулировать положение сегмента по вертикали.

source: Currently only linear keyframe curves are supported.
ru: В настоящее время поддерживаются только линейные кривые ключевых кадров.

source: Explaining how layers work within the timeline.
ru: Как устроены слои на монтажном столе.

source: Understanding layers
ru: Основная информация о слоях

source: <em>Layers</em> are a fundamental concept for advanced editing in the timeline: compositing, mixing multiple videos simultaneously, and adding titles depend on this feature.
ru: <em>Слои</em> — это фундаментальная концепция в расширенном редактировании на монтажном столе: от них зависят композиция, одновременное микширование несколько видео и добавление субтитров.

source: It is easier to think of layers in terms of images painted on glass. With several pieces of glass stacked on top of each other, each of these pieces of glass is a layer. If the top piece of glass is completely painted over, none of the pieces of glass underneath will be visible. If, on the other hand, you only paint over a portion of a piece of glass, you will be able to see what is underneath the non-painted parts.
ru: Слои легче представить в качестве изображений, нарисованных на стекле. Каждый кусочек стекла, уложенный друг на друга, представляет собой слой. Если закрасить верхний кусочек стекла, то ни одно из нижних стёкол не будет видно. Если же закрасить только часть этого кусочка, то будет видно то, что останется под неокрашенными частями.

source: Opacity (how solid “opaque” things are)
ru: Непрозрачность (насколько твёрдыми должны быть «непрозрачные» элементы)

source: Each layer (and each clip) has its own transparency. To continue the paint on glass metaphor, if the paint is thin enough, it can be seen through. Visually, an opacity of 100% means you cannot see the clips below that layer or clip, and an opacity of 50% means you can partly see them.
ru: Каждый слой (и клип) имеет свой уровень непрозрачности. Возвращаясь к примеру с рисунками на стекле, если рисунок достаточно тонкий, сквозь него можно увидеть то, что находится под ним. Визуально непрозрачность 100% означает, что клипы под этим слоем видны не будут, а непрозрачность 50% означает, что их можно будет видеть частично.

source: How this translates in terms of user interface
ru: Как это представлено в пользовательском интерфейсе

source: While, in real life, you can stack pieces of glass onto each other in three dimensions, your computer monitor only has two dimensions. Thus, the <em>layers on top</em> (the “Z” axis in the physical world) are also visually <em>on top</em>, albeit on the “Y” axis.
ru: В реальной жизни складывать куски стекла друг на друга можно в трёх измерениях, но монитор компьютера умеет делать это только в двух. Таким образом, <em>верхние слои</em> (ось «Z» в физическом мире) также визуально располагаются сверху, хоть и по оси «Y».

source: Diagram illustrating the <em>pieces of glass</em> (left) and how they are show as <em>layers</em> in <app>Pitivi</app>'s user interface (right).
ru: Диаграмма, иллюстрирующая <em>кусочки стекла</em> (слева) и их изображение в виде <em>слоёв</em> в пользовательском интерфейсе <app>Pitivi</app> (справа).

source: Clips located on a layer above will block the clips below from view, unless they have an opacity value lower than 100% (as shown with the two topmost layers in the previous illustration).
ru: Клипы, расположенные на слое выше, будут визуально перекрывать клипы, расположенные ниже, если их значение непрозрачности не будет ниже 100% (как показано на примере двух самых верхних слоёв на предыдущей иллюстрации).

source: Renaming a layer
ru: Переименование слоя

source: To rename a layer, click the layer's name, which is an editable text field.
ru: Чтобы переименовать слой, нажмите на имя слоя — это редактируемое текстовое поле.

source: Adjusting layer positioning
ru: Настройка расположения слоя

source: To move a layer to the top of the layer order, click <guiseq><gui>Layer icon</gui><gui>Move layer to top</gui></guiseq>. To move a layer to the one position higher in the layer order, click <guiseq><gui>Layer icon</gui><gui>Move layer up</gui></guiseq>.
ru: Чтобы переместить слой в начало всей стопки слоёв, воспользуйтесь пунктом меню <guiseq><gui>Значок слоя</gui><gui>Поднять слой наверх</gui></guiseq>. Чтобы переместить слой на одну позицию вверх в стопке слоёв, воспользуйтесь пунктом меню <guiseq><gui>Значок слоя</gui><gui>Поднять слой</gui></guiseq>.

source: To move a layer to the one position lower in the layer order, click <guiseq><gui>Layer icon</gui><gui>Move layer down</gui></guiseq>. To move a layer to the bottom of the layer order, click <guiseq><gui>Layer icon</gui><gui>Move layer to bottom</gui></guiseq>.
ru: Чтобы переместить слой на одну позицию ниже, нажмите на <guiseq><gui>значок слоя</gui><gui>Опустить слой</gui></guiseq>. Чтобы переместить слой в самый конец стопки слоёв, нажмите на <guiseq><gui>значок слоя</gui><gui>Опустить слой вниз</gui></guiseq>.

source: Adding and removing layers
ru: Добавление и удаление слоёв

source: To create a layer, drag a clip to the middle space between two existing layers or just above the top layer or just below the bottom layer. Once the thin space between the layers is highlighted, release the clip.
ru: Чтобы создать слой, перетащите клип в пространство между двумя существующими слоями, либо над самым верхним слоем, либо под самым нижним. Как только пространство между слоями будет подсвечено, отпустите клип.

source: To remove a layer, click <guiseq><gui>Layer icon</gui><gui>Delete layer</gui></guiseq>. The <gui>Layer icon</gui> can be found at the right of the layer name field.
ru: Чтобы удалить слой, воспользуйтесь пунктом меню <guiseq><gui>Значок слоя</gui><gui>Удалить слой</gui></guiseq>. <gui>Значок слоя</gui> находится в правой части поля с именем слоя.

source: Muting a layer
ru: Заглушение слоя

source: To mute a layer, click <gui>Volume icon</gui>. The icon will be toggled to show the layer has been muted. To unmute a layer, click <gui>Volume icon</gui> again.
ru: Чтобы заглушить слой, нажмите на <gui>Значок громкости</gui>. Значок изменится, информируя о том, что слой заглушен. Чтобы включить слой, снова нажмите на <gui>Значок громкости</gui>.

source: What about audio layers?
ru: Что такое аудио слои?

source: Unlike in vision, multiple sounds do not “block” each other. If you have multiple audio clips on separate layers, their sound will be mixed together. Controlling the volume of those audio clips simply changes their relative loudness.
ru: В отличие от видео слоёв, звуки не «блокируют» друг друга. Если на отдельных слоях есть несколько аудиоклипов, они все будут проигрываться. Изменение громкости этих аудиоклипов просто изменяет их относительную громкость.

source: Legal information.
ru: Юридическая информация.

source: License
ru: Лицензия

source: This work is distributed under a CreativeCommons Attribution-Share Alike 3.0 Unported license.
ru: Этот продукт распространяется на условиях лицензии CreativeCommons Attribution-Share Alike 3.0 Unported.

source: You are free:
ru: Вы можете:

source: <em>To share</em>
ru: <em>Распространять</em>

source: To copy, distribute and transmit the work.
ru: Копировать, распространять и передавать продукт.

source: <em>To remix</em>
ru: <em>Изменять</em>

source: To adapt the work.
ru: Адаптировать продукт.

source: Under the following conditions:
ru: Под следующими условиями:

source: <em>Attribution</em>
ru: <em>Ссылка на источник</em>

source: You must attribute the work in the manner specified by the author or licensor (but not in any way that suggests that they endorse you or your use of the work).
ru: Вы должны указать авторство работы в порядке, указанном автором или лицензиаром (но никоим образом не предполагающим, что они признают вас или использование вами продукта).

source: <em>Share Alike</em>
ru: <em>Распространение на тех же условиях</em>

source: If you alter, transform, or build upon this work, you may distribute the resulting work only under the same, similar or a compatible license.
ru: Если вы изменяете, преобразуете или дополняете этот продукт, вы можете распространять полученную работу только по той же, аналогичной или совместимой лицензии.

source: For the full text of the license, see the <link href="http://creativecommons.org/licenses/by-sa/3.0/legalcode">CreativeCommons website</link>, or read the full <link href="http://creativecommons.org/licenses/by-sa/3.0/">Commons Deed</link>.
ru: Полный текст лицензии представлен на <link href="http://creativecommons.org/licenses/by-sa/3.0/legalcode">сайте CreativeCommons</link>, либо ознакомьтесь с полным текстом <link href="http://creativecommons.org/licenses/by-sa/3.0/">Commons Deed</link>.

source: For the license of Pitivi itself, see the <link href="http://www.gnu.org/licenses/lgpl-2.1.html">GNU Lesser General Public License</link>.
ru: Лицензия Pitivi представлена здесь: <link href="http://www.gnu.org/licenses/lgpl-2.1.html">GNU Lesser General Public License</link>.

source: Discover the components of the main window.
ru: Компоненты главного окна.

source: The main window
ru: Главное окно

source: The main window, as the name implies, is the window containing the main components of the <app>Pitivi</app> user interface, namely: the header bar, the toolbars, the timeline and various customizable components (media library, previewer, effects library, transitions library, etc.).
ru: Главное окно представляет собой окно, содержащее основные компоненты пользовательского интерфейса <app>Pitivi</app>: панель заголовка, панели инструментов, монтажный стол и различные настраиваемые компоненты (библиотека медиафайлов, средство предварительного просмотра, библиотека эффектов, библиотека переходов и так далее).

source: In the figure above, the following areas can be observed:
ru: На снимке экрана выше представлены следующие области:

source: Header bar and main toolbar buttons
ru: Панель заголовка и кнопки главной панели инструментов

source: Main menu button
ru: Кнопка главного меню

source: Primary tabs: media library and effects library
ru: Основные вкладки: библиотека медиафайлов и эффектов

source: Contextual tabs: clip properties, transitions, titles
ru: Контекстные вкладки: свойства клипов, переходы, заголовки

source: Ruler
ru: Линейка

source: Resizing the components of the main window
ru: Изменение размера компонентов главного окна

source: The spaces between components can be clicked and dragged to proportionally resize the respective adjacent components.
ru: Чтобы пропорционально изменить размер смежных компонентов, можно перетаскивать промежутки между ними.

source: Hovering for more information
ru: Наведение курсора мыши для получения дополнительной информации

source: Hovering the mouse cursor over an element in the main window usually reveals an information tooltip regarding its function.
ru: Наведение курсора мыши на элемент в главном окне обычно вызывает всплывающую подсказку, в которой описывается этот элемент.

source: Header bar
ru: Панель заголовка

source: The header bar is a place where basic functions such as <gui>Undo</gui>, <gui>Redo</gui>, <gui>Save</gui>, or <gui>Render</gui> can be directly accessed. It also contains the main <gui>menu button</gui> where you can find further functions such as <gui>New project</gui>, <gui>Open project</gui>, <gui>Project settings</gui> or <gui>Preferences</gui>.
ru: Панель заголовка — это панель, позволяющая получить быстрый доступ к таким базовым функциям как <gui>Отменить</gui>, <gui>Повторить</gui>, <gui>Сохранить</gui> или <gui>Сборка</gui>. На ней также содержится <gui>Кнопка меню</gui>, где представлены более расширенные функции, такие как <gui>Создать новый проект</gui>, <gui>Открыть проект</gui>, <gui>Параметры проекта</gui> и <gui>Настройки</gui>.

source: The <gui>menu button</gui>'s contents can be accessed by pressing <key>F10</key>.
ru: Содержимое <gui>Кнопки меню</gui> также доступно по нажатию клавиши <key>F10</key>.

source: The ruler plays a crucial role in your interaction with the timeline. First, it represents a time scale providing time measurements (in seconds) for overall orientation. Second, it constitutes the primary surface on which you can move the playhead (and thus, change your position in time). To move your position, click anywhere on the ruler. You can also <em>scrub</em> the timeline by clicking on the ruler and holding down the mouse button while moving. See the section on <link xref="movearoundtimeline">scrubbing</link> for more details.
ru: Линейка играет важнейшую роль во взаимодействии с монтажным столом. Во-первых, она представляет собой шкалу времени, позволяющую измерить время (в секундах) для общей ориентации. Во-вторых, она также является основной поверхностью для перемещения точки воспроизведения (что позволяет менять свою позицию во времени). Чтобы переместить позицию, щёлкните левой кнопкой мыши в любом месте линейки. Также можно <em>перемотать</em> монтажный стол, нажав на линейку и удерживая левую кнопку мыши во время перемещения. Более подробная информация содержится в разделе <link xref="movearoundtimeline">о перемотке</link>.

source: The current playhead position is indicated by a red vertical line:
ru: Текущая позиция воспроизведения отмечена красной вертикальной линией:
